RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/* Bitfield definition for register: RIDR */
/*
 * UDRID (R)
 *
 * User-Defined Revision ID: General purpose revision identification set by the user.
 */
#define DDRPHY_RIDR_UDRID_MASK (0xFF000000UL)
#define DDRPHY_RIDR_UDRID_SHIFT (24U)
#define DDRPHY_RIDR_UDRID_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_UDRID_MASK) >> DDRPHY_RIDR_UDRID_SHIFT)

/*
 * PHYMJR (R)
 *
 * PHY Major Revision: Indicates major revision of the PHY such addition of the features that make the new version not compatible with previous versions.
 */
#define DDRPHY_RIDR_PHYMJR_MASK (0xF00000UL)
#define DDRPHY_RIDR_PHYMJR_SHIFT (20U)
#define DDRPHY_RIDR_PHYMJR_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_PHYMJR_MASK) >> DDRPHY_RIDR_PHYMJR_SHIFT)

/*
 * PHYMDR (R)
 *
 * PHY Moderate Revision: Indicates moderate revision of the PHY such as addition of new features. Normally the new version is still compatible with previous versions.
 */
#define DDRPHY_RIDR_PHYMDR_MASK (0xF0000UL)
#define DDRPHY_RIDR_PHYMDR_SHIFT (16U)
#define DDRPHY_RIDR_PHYMDR_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_PHYMDR_MASK) >> DDRPHY_RIDR_PHYMDR_SHIFT)

/*
 * PHYMNR (R)
 *
 * PHY Minor Revision: Indicates minor update of the PHY such as bug fixes. Normally no new features are included.
 */
#define DDRPHY_RIDR_PHYMNR_MASK (0xF000U)
#define DDRPHY_RIDR_PHYMNR_SHIFT (12U)
#define DDRPHY_RIDR_PHYMNR_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_PHYMNR_MASK) >> DDRPHY_RIDR_PHYMNR_SHIFT)

/*
 * PUBMJR (R)
 *
 * PUB Major Revision: Indicates major revision of the PUB such addition of the features that make the new version not compatible with previous versions.
 */
#define DDRPHY_RIDR_PUBMJR_MASK (0xF00U)
#define DDRPHY_RIDR_PUBMJR_SHIFT (8U)
#define DDRPHY_RIDR_PUBMJR_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_PUBMJR_MASK) >> DDRPHY_RIDR_PUBMJR_SHIFT)

/*
 * PUBMDR (R)
 *
 * PUB Moderate Revision: Indicates moderate revision of the PUB such as addition of new features. Normally the new version is still compatible with previous versions.
 */
#define DDRPHY_RIDR_PUBMDR_MASK (0xF0U)
#define DDRPHY_RIDR_PUBMDR_SHIFT (4U)
#define DDRPHY_RIDR_PUBMDR_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_PUBMDR_MASK) >> DDRPHY_RIDR_PUBMDR_SHIFT)

/*
 * PUBMNR (R)
 *
 * PUB Minor Revision: Indicates minor update of the PUB such as bug fixes. Normally no new features are included.
 */
#define DDRPHY_RIDR_PUBMNR_MASK (0xFU)
#define DDRPHY_RIDR_PUBMNR_SHIFT (0U)
#define DDRPHY_RIDR_PUBMNR_GET(x) (((uint32_t)(x) & DDRPHY_RIDR_PUBMNR_MASK) >> DDRPHY_RIDR_PUBMNR_SHIFT)

/* Bitfield definition for register: PIR */
/*
 * INITBYP (R/W)
 *
 * Initialization Bypass: Bypasses or stops, if set, all initialization routines currently running, including PHY initialization, DRAM initialization, and PHY training.
 * Initialization may be triggered manually using INIT and the other relevant bits of the PIR register. This bit is self-clearing.
 */
#define DDRPHY_PIR_INITBYP_MASK (0x80000000UL)
#define DDRPHY_PIR_INITBYP_SHIFT (31U)
#define DDRPHY_PIR_INITBYP_SET(x) (((uint32_t)(x) << DDRPHY_PIR_INITBYP_SHIFT) & DDRPHY_PIR_INITBYP_MASK)
#define DDRPHY_PIR_INITBYP_GET(x) (((uint32_t)(x) & DDRPHY_PIR_INITBYP_MASK) >> DDRPHY_PIR_INITBYP_SHIFT)

/*
 * ZCALBYP (R/W)
 *
 * Impedance Calibration Bypass: Bypasses or stops, if set, impedance calibration of all ZQ control blocks that automatically triggers after reset. Impedance calibration may be triggered manually using INIT and ZCAL bits of the PIR register. This bit is self-clearing.
 */
#define DDRPHY_PIR_ZCALBYP_MASK (0x40000000UL)
#define DDRPHY_PIR_ZCALBYP_SHIFT (30U)
#define DDRPHY_PIR_ZCALBYP_SET(x) (((uint32_t)(x) << DDRPHY_PIR_ZCALBYP_SHIFT) & DDRPHY_PIR_ZCALBYP_MASK)
#define DDRPHY_PIR_ZCALBYP_GET(x) (((uint32_t)(x) & DDRPHY_PIR_ZCALBYP_MASK) >> DDRPHY_PIR_ZCALBYP_SHIFT)

/*
 * DCALBYP (R/W)
 *
 * Digital Delay Line (DDL) Calibration Bypass: Bypasses or stops, if set, DDL calibration that automatically triggers after reset. DDL calibration may be triggered manually using INIT and DCAL bits of the PIR register. This bit is self- clearing.
 */
#define DDRPHY_PIR_DCALBYP_MASK (0x20000000UL)
#define DDRPHY_PIR_DCALBYP_SHIFT (29U)
#define DDRPHY_PIR_DCALBYP_SET(x) (((uint32_t)(x) << DDRPHY_PIR_DCALBYP_SHIFT) & DDRPHY_PIR_DCALBYP_MASK)
#define DDRPHY_PIR_DCALBYP_GET(x) (((uint32_t)(x) & DDRPHY_PIR_DCALBYP_MASK) >> DDRPHY_PIR_DCALBYP_SHIFT)

/*
 * LOCKBYP (R/W)
 *
 * PLL Lock Bypass: Bypasses or stops, if set, the waiting of PLLs to lock. PLL lock wait is automatically triggered after reset. PLL lock wait may be triggered manually using INIT and PLLINIT bits of the PIR register. This bit is self-clearing.
 */
#define DDRPHY_PIR_LOCKBYP_MASK (0x10000000UL)
#define DDRPHY_PIR_LOCKBYP_SHIFT (28U)
#define DDRPHY_PIR_LOCKBYP_SET(x) (((uint32_t)(x) << DDRPHY_PIR_LOCKBYP_SHIFT) & DDRPHY_PIR_LOCKBYP_MASK)
#define DDRPHY_PIR_LOCKBYP_GET(x) (((uint32_t)(x) & DDRPHY_PIR_LOCKBYP_MASK) >> DDRPHY_PIR_LOCKBYP_SHIFT)

/*
 * CLRSR (R/W)
 *
 * Clear Status Registers: Writing 1 to this bit clears (reset to 0) select status bits in register PGSR0.
 * This bit is primarily for debug purposes and is typically not needed during normal functional operation. It can be used when PGSR.IDONE=1, to manually clear a selection of the PGSR status bits, although starting a new initialization process (PIR[0].INIT = 1’b1) automatically clears the PGSR status bits associated with the initialization steps enabled.
 * The following list describes which bits within the PGSR0 register are cleared when CLRSR is set to 1’b1 and which bits are not cleared:
 * The following bits are not cleared by PIR[27] (CLRSR):
 * PGSR0[31] (APLOCK)
 * PGSR0[29:28] (PLDONE_CHN)
 * PGSR0[23] (WLAERR)
 * PGSR0[21] (WLERR)
 * PGSR0[4] (DIDONE)
 * PGSR0[2] (DCDONE)
 * PGSR0[1] (PLDONE)
 * PGSR0[0] (IDONE)
 * The following bits are always zero:
 * PGSR0[30] (reserved)
 * PGSR0[19:12] (reserved)
 * The following bits are cleared unconditionally by PIR[27] (CLRSR):
 * PGSR0[27] (WEERR)
 * PGSR0[26] (REERR)
 * PGSR0[25] (WDERR)
 * PGSR0[24] (RDERR)
 * - PGSR0[22] (QSGERR)
 * - PGSR0[20] (ZCERR)
 * - PGSR0[11] (WEDONE)
 * - PGSR0[10] (REDONE)
 * - PGSR0[9] (WDDONE)
 * - PGSR0[8] (RDDONE)
 * - PGSR0[7] (WLADONE)
 * - PGSR0[6] (QSGDONE)
 * - PGSR0[5] (WLDONE)
 * - PGSR0[3] (ZCDONE)
 */
#define DDRPHY_PIR_CLRSR_MASK (0x8000000UL)
#define DDRPHY_PIR_CLRSR_SHIFT (27U)
#define DDRPHY_PIR_CLRSR_SET(x) (((uint32_t)(x) << DDRPHY_PIR_CLRSR_SHIFT) & DDRPHY_PIR_CLRSR_MASK)
#define DDRPHY_PIR_CLRSR_GET(x) (((uint32_t)(x) & DDRPHY_PIR_CLRSR_MASK) >> DDRPHY_PIR_CLRSR_SHIFT)

