RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * RDIMMINIT (R/W)
 *
 * RDIMM Initialization: Executes the RDIMM buffer chip initialization before executing DRAM initialization. The RDIMM buffer chip initialization is run after the DRAM is reset and CKE have been driven high by the DRAM initialization sequence.
 */
#define DDRPHY_PIR_RDIMMINIT_MASK (0x80000UL)
#define DDRPHY_PIR_RDIMMINIT_SHIFT (19U)
#define DDRPHY_PIR_RDIMMINIT_SET(x) (((uint32_t)(x) << DDRPHY_PIR_RDIMMINIT_SHIFT) & DDRPHY_PIR_RDIMMINIT_MASK)
#define DDRPHY_PIR_RDIMMINIT_GET(x) (((uint32_t)(x) & DDRPHY_PIR_RDIMMINIT_MASK) >> DDRPHY_PIR_RDIMMINIT_SHIFT)

/*
 * CTLDINIT (R/W)
 *
 * Controller DRAM Initialization: Indicates, if set, that DRAM initialization will be performed by the controller. Otherwise if not set it indicates that DRAM initialization will be performed using the built-in initialization sequence or using software through the configuration port.
 */
#define DDRPHY_PIR_CTLDINIT_MASK (0x40000UL)
#define DDRPHY_PIR_CTLDINIT_SHIFT (18U)
#define DDRPHY_PIR_CTLDINIT_SET(x) (((uint32_t)(x) << DDRPHY_PIR_CTLDINIT_SHIFT) & DDRPHY_PIR_CTLDINIT_MASK)
#define DDRPHY_PIR_CTLDINIT_GET(x) (((uint32_t)(x) & DDRPHY_PIR_CTLDINIT_MASK) >> DDRPHY_PIR_CTLDINIT_SHIFT)

/*
 * PLLBYP (R/W)
 *
 * PLL Bypass: A setting of 1 on this bit will put all PHY PLLs in bypass mode.
 */
#define DDRPHY_PIR_PLLBYP_MASK (0x20000UL)
#define DDRPHY_PIR_PLLBYP_SHIFT (17U)
#define DDRPHY_PIR_PLLBYP_SET(x) (((uint32_t)(x) << DDRPHY_PIR_PLLBYP_SHIFT) & DDRPHY_PIR_PLLBYP_MASK)
#define DDRPHY_PIR_PLLBYP_GET(x) (((uint32_t)(x) & DDRPHY_PIR_PLLBYP_MASK) >> DDRPHY_PIR_PLLBYP_SHIFT)

/*
 * ICPC (R/W)
 *
 * Initialization Complete Pin Configuration: Specifies how the DFI initialization complete output pin (dfi_init_complete) should be used to indicate the status of initialization. Valid value are:
 * 0 = Asserted after PHY initialization (DLL locking and impedance calibration) is complete.
 * 1 = Asserted after PHY initialization is complete and the triggered the PUB initialization (DRAM initialization, data training, or initialization trigger with no selected initialization) is complete.
 */
#define DDRPHY_PIR_ICPC_MASK (0x10000UL)
#define DDRPHY_PIR_ICPC_SHIFT (16U)
#define DDRPHY_PIR_ICPC_SET(x) (((uint32_t)(x) << DDRPHY_PIR_ICPC_SHIFT) & DDRPHY_PIR_ICPC_MASK)
#define DDRPHY_PIR_ICPC_GET(x) (((uint32_t)(x) & DDRPHY_PIR_ICPC_MASK) >> DDRPHY_PIR_ICPC_SHIFT)

/*
 * WREYE (R/W)
 *
 * Write Data Eye Training: Executes a PUB training routine to maximize the write data eye.
 */
#define DDRPHY_PIR_WREYE_MASK (0x8000U)
#define DDRPHY_PIR_WREYE_SHIFT (15U)
#define DDRPHY_PIR_WREYE_SET(x) (((uint32_t)(x) << DDRPHY_PIR_WREYE_SHIFT) & DDRPHY_PIR_WREYE_MASK)
#define DDRPHY_PIR_WREYE_GET(x) (((uint32_t)(x) & DDRPHY_PIR_WREYE_MASK) >> DDRPHY_PIR_WREYE_SHIFT)

/*
 * RDEYE (R/W)
 *
 * Read Data Eye Training: Executes a PUB training routine to maximize the read data eye.
 */
#define DDRPHY_PIR_RDEYE_MASK (0x4000U)
#define DDRPHY_PIR_RDEYE_SHIFT (14U)
#define DDRPHY_PIR_RDEYE_SET(x) (((uint32_t)(x) << DDRPHY_PIR_RDEYE_SHIFT) & DDRPHY_PIR_RDEYE_MASK)
#define DDRPHY_PIR_RDEYE_GET(x) (((uint32_t)(x) & DDRPHY_PIR_RDEYE_MASK) >> DDRPHY_PIR_RDEYE_SHIFT)

/*
 * WRDSKW (R/W)
 *
 * Write Data Bit Deskew: Executes a PUB training routine to deskew the DQ bits during write.
 */
#define DDRPHY_PIR_WRDSKW_MASK (0x2000U)
#define DDRPHY_PIR_WRDSKW_SHIFT (13U)
#define DDRPHY_PIR_WRDSKW_SET(x) (((uint32_t)(x) << DDRPHY_PIR_WRDSKW_SHIFT) & DDRPHY_PIR_WRDSKW_MASK)
#define DDRPHY_PIR_WRDSKW_GET(x) (((uint32_t)(x) & DDRPHY_PIR_WRDSKW_MASK) >> DDRPHY_PIR_WRDSKW_SHIFT)

/*
 * RDDSKW (R/W)
 *
 * Read Data Bit Deskew: Executes a PUB training routine to deskew the DQ bits during read.
 */
#define DDRPHY_PIR_RDDSKW_MASK (0x1000U)
#define DDRPHY_PIR_RDDSKW_SHIFT (12U)
#define DDRPHY_PIR_RDDSKW_SET(x) (((uint32_t)(x) << DDRPHY_PIR_RDDSKW_SHIFT) & DDRPHY_PIR_RDDSKW_MASK)
#define DDRPHY_PIR_RDDSKW_GET(x) (((uint32_t)(x) & DDRPHY_PIR_RDDSKW_MASK) >> DDRPHY_PIR_RDDSKW_SHIFT)

/*
 * WLADJ (R/W)
 *
 * Write Leveling Adjust (DDR3 Only): Executes a PUB training routine that re- adjusts the write latency used during write in case the write leveling routine changed the expected latency.
 * Note: Ensure that the DCU command cache is cleared prior to running WLADJ.
 */
#define DDRPHY_PIR_WLADJ_MASK (0x800U)
#define DDRPHY_PIR_WLADJ_SHIFT (11U)
#define DDRPHY_PIR_WLADJ_SET(x) (((uint32_t)(x) << DDRPHY_PIR_WLADJ_SHIFT) & DDRPHY_PIR_WLADJ_MASK)
#define DDRPHY_PIR_WLADJ_GET(x) (((uint32_t)(x) & DDRPHY_PIR_WLADJ_MASK) >> DDRPHY_PIR_WLADJ_SHIFT)

/*
 * QSGATE (R/W)
 *
 * Read DQS Gate Training: Executes a PUB training routine to determine the optimum position of the read data DQS strobe for maximum system timing margins.
 */
#define DDRPHY_PIR_QSGATE_MASK (0x400U)
#define DDRPHY_PIR_QSGATE_SHIFT (10U)
#define DDRPHY_PIR_QSGATE_SET(x) (((uint32_t)(x) << DDRPHY_PIR_QSGATE_SHIFT) & DDRPHY_PIR_QSGATE_MASK)
#define DDRPHY_PIR_QSGATE_GET(x) (((uint32_t)(x) & DDRPHY_PIR_QSGATE_MASK) >> DDRPHY_PIR_QSGATE_SHIFT)

/*
 * WL (R/W)
 *
 * Write Leveling (DDR3 Only): Executes a PUB write leveling routine.
 */
#define DDRPHY_PIR_WL_MASK (0x200U)
#define DDRPHY_PIR_WL_SHIFT (9U)
#define DDRPHY_PIR_WL_SET(x) (((uint32_t)(x) << DDRPHY_PIR_WL_SHIFT) & DDRPHY_PIR_WL_MASK)
#define DDRPHY_PIR_WL_GET(x) (((uint32_t)(x) & DDRPHY_PIR_WL_MASK) >> DDRPHY_PIR_WL_SHIFT)

/*
 * DRAMINIT (R/W)
 *
 * DRAM Initialization: Executes the DRAM initialization sequence.
 */
#define DDRPHY_PIR_DRAMINIT_MASK (0x100U)
#define DDRPHY_PIR_DRAMINIT_SHIFT (8U)
#define DDRPHY_PIR_DRAMINIT_SET(x) (((uint32_t)(x) << DDRPHY_PIR_DRAMINIT_SHIFT) & DDRPHY_PIR_DRAMINIT_MASK)
#define DDRPHY_PIR_DRAMINIT_GET(x) (((uint32_t)(x) & DDRPHY_PIR_DRAMINIT_MASK) >> DDRPHY_PIR_DRAMINIT_SHIFT)

/*
 * DRAMRST (R/W)
 *
 * DRAM Reset (DDR3 Only): Issues a reset to the DRAM (by driving the DRAM reset pin low) and wait 200us. This can be triggered in isolation or with the full DRAM initialization (DRAMINIT). For the later case, the reset is issued and 200us is waited before starting the full initialization sequence.
 */
#define DDRPHY_PIR_DRAMRST_MASK (0x80U)
#define DDRPHY_PIR_DRAMRST_SHIFT (7U)
#define DDRPHY_PIR_DRAMRST_SET(x) (((uint32_t)(x) << DDRPHY_PIR_DRAMRST_SHIFT) & DDRPHY_PIR_DRAMRST_MASK)
#define DDRPHY_PIR_DRAMRST_GET(x) (((uint32_t)(x) & DDRPHY_PIR_DRAMRST_MASK) >> DDRPHY_PIR_DRAMRST_SHIFT)

