RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * OSCDIV (R/W)
 *
 * Oscillator Mode Division: Specifies the factor by which the delay line oscillator mode output is divided down before it is output on the delay line digital test output pin dl_dto. Valid values are:
 * 000 = Divide by 1
 * 001 = Divide by 256
 * 010 = Divide by 512
 * 011 = Divide by 1024
 * 100 = Divide by 2048
 * 101 = Divide by 4096
 * 110 = Divide by 8192
 * 111 = Divide by 65536
 */
#define DDRPHY_PGCR0_OSCDIV_MASK (0xE00U)
#define DDRPHY_PGCR0_OSCDIV_SHIFT (9U)
#define DDRPHY_PGCR0_OSCDIV_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_OSCDIV_SHIFT) & DDRPHY_PGCR0_OSCDIV_MASK)
#define DDRPHY_PGCR0_OSCDIV_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_OSCDIV_MASK) >> DDRPHY_PGCR0_OSCDIV_SHIFT)

/*
 * OSCEN (R/W)
 *
 * Oscillator Enable: Enables, if set, the delay line oscillation.
 */
#define DDRPHY_PGCR0_OSCEN_MASK (0x100U)
#define DDRPHY_PGCR0_OSCEN_SHIFT (8U)
#define DDRPHY_PGCR0_OSCEN_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_OSCEN_SHIFT) & DDRPHY_PGCR0_OSCEN_MASK)
#define DDRPHY_PGCR0_OSCEN_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_OSCEN_MASK) >> DDRPHY_PGCR0_OSCEN_SHIFT)

/*
 * DLTST (R/W)
 *
 * Delay Line Test Start: A write of '1' to this bit will trigger delay line oscillator mode period measurement. This bit is not self clearing and needs to be reset to '0' before the measurement can be re-triggered.
 */
#define DDRPHY_PGCR0_DLTST_MASK (0x80U)
#define DDRPHY_PGCR0_DLTST_SHIFT (7U)
#define DDRPHY_PGCR0_DLTST_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_DLTST_SHIFT) & DDRPHY_PGCR0_DLTST_MASK)
#define DDRPHY_PGCR0_DLTST_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_DLTST_MASK) >> DDRPHY_PGCR0_DLTST_SHIFT)

/*
 * DLTMODE (R/W)
 *
 * Delay Line Test Mode: Selects, if set, the delay line oscillator test mode. Setting this bit also clears all delay line register values. For DL oscillator testing, first set this bit, then apply desired non-zero LCDL and BDL register programmings.
 */
#define DDRPHY_PGCR0_DLTMODE_MASK (0x40U)
#define DDRPHY_PGCR0_DLTMODE_SHIFT (6U)
#define DDRPHY_PGCR0_DLTMODE_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_DLTMODE_SHIFT) & DDRPHY_PGCR0_DLTMODE_MASK)
#define DDRPHY_PGCR0_DLTMODE_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_DLTMODE_MASK) >> DDRPHY_PGCR0_DLTMODE_SHIFT)

/*
 * RDBVT (R/W)
 *
 * Read Data BDL VT Compensation: Enables, if set, the VT drift compensation of the read data bit delay lines.
 */
#define DDRPHY_PGCR0_RDBVT_MASK (0x20U)
#define DDRPHY_PGCR0_RDBVT_SHIFT (5U)
#define DDRPHY_PGCR0_RDBVT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_RDBVT_SHIFT) & DDRPHY_PGCR0_RDBVT_MASK)
#define DDRPHY_PGCR0_RDBVT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_RDBVT_MASK) >> DDRPHY_PGCR0_RDBVT_SHIFT)

/*
 * WDBVT (R/W)
 *
 * Write Data BDL VT Compensation: Enables, if set, the VT drift compensation of the write data bit delay lines.
 */
#define DDRPHY_PGCR0_WDBVT_MASK (0x10U)
#define DDRPHY_PGCR0_WDBVT_SHIFT (4U)
#define DDRPHY_PGCR0_WDBVT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_WDBVT_SHIFT) & DDRPHY_PGCR0_WDBVT_MASK)
#define DDRPHY_PGCR0_WDBVT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_WDBVT_MASK) >> DDRPHY_PGCR0_WDBVT_SHIFT)

/*
 * RGLVT (R/W)
 *
 * Read DQS Gating LCDL Delay VT Compensation: Enables, if set, the VT drift compensation of the read DQS gating LCDL.
 */
#define DDRPHY_PGCR0_RGLVT_MASK (0x8U)
#define DDRPHY_PGCR0_RGLVT_SHIFT (3U)
#define DDRPHY_PGCR0_RGLVT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_RGLVT_SHIFT) & DDRPHY_PGCR0_RGLVT_MASK)
#define DDRPHY_PGCR0_RGLVT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_RGLVT_MASK) >> DDRPHY_PGCR0_RGLVT_SHIFT)

/*
 * RDLVT (R/W)
 *
 * Read DQS LCDL Delay VT Compensation: Enables, if set, the VT drift compensation of the read DQS LCDL.
 */
#define DDRPHY_PGCR0_RDLVT_MASK (0x4U)
#define DDRPHY_PGCR0_RDLVT_SHIFT (2U)
#define DDRPHY_PGCR0_RDLVT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_RDLVT_SHIFT) & DDRPHY_PGCR0_RDLVT_MASK)
#define DDRPHY_PGCR0_RDLVT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_RDLVT_MASK) >> DDRPHY_PGCR0_RDLVT_SHIFT)

/*
 * WDLVT (R/W)
 *
 * Write DQ LCDL Delay VT Compensation: Enables, if set, the VT drift compensation of the write DQ LCDL.
 */
#define DDRPHY_PGCR0_WDLVT_MASK (0x2U)
#define DDRPHY_PGCR0_WDLVT_SHIFT (1U)
#define DDRPHY_PGCR0_WDLVT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_WDLVT_SHIFT) & DDRPHY_PGCR0_WDLVT_MASK)
#define DDRPHY_PGCR0_WDLVT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_WDLVT_MASK) >> DDRPHY_PGCR0_WDLVT_SHIFT)

/*
 * WLLVT (R/W)
 *
 * Write Leveling LCDL Delay VT Compensation: Enables, if set, the VT drift compensation of the write leveling LCDL.
 */
#define DDRPHY_PGCR0_WLLVT_MASK (0x1U)
#define DDRPHY_PGCR0_WLLVT_SHIFT (0U)
#define DDRPHY_PGCR0_WLLVT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR0_WLLVT_SHIFT) & DDRPHY_PGCR0_WLLVT_MASK)
#define DDRPHY_PGCR0_WLLVT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR0_WLLVT_MASK) >> DDRPHY_PGCR0_WLLVT_SHIFT)

/* Bitfield definition for register: PGCR1 */
/*
 * LBMODE (R/W)
 *
 * Loopback Mode: Indicates, if set, that the PHY/PUB is in loopback mode.
 */
#define DDRPHY_PGCR1_LBMODE_MASK (0x80000000UL)
#define DDRPHY_PGCR1_LBMODE_SHIFT (31U)
#define DDRPHY_PGCR1_LBMODE_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_LBMODE_SHIFT) & DDRPHY_PGCR1_LBMODE_MASK)
#define DDRPHY_PGCR1_LBMODE_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_LBMODE_MASK) >> DDRPHY_PGCR1_LBMODE_SHIFT)

/*
 * LBGDQS (R/W)
 *
 * Loopback DQS Gating: Selects the DQS gating mode that should be used when the PHY is in loopback mode, including BIST loopback mode. Valid values are:
 * 00 = DQS gate is always on
 * 01 = DQS gate training will be triggered on the PUB 10 = DQS gate is set manually using software
 * 11 = Reserved
 */
#define DDRPHY_PGCR1_LBGDQS_MASK (0x60000000UL)
#define DDRPHY_PGCR1_LBGDQS_SHIFT (29U)
#define DDRPHY_PGCR1_LBGDQS_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_LBGDQS_SHIFT) & DDRPHY_PGCR1_LBGDQS_MASK)
#define DDRPHY_PGCR1_LBGDQS_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_LBGDQS_MASK) >> DDRPHY_PGCR1_LBGDQS_SHIFT)

/*
 * LBDQSS (R/W)
 *
 * Loopback DQS Shift: Selects how the read DQS is shifted during loopback to ensure that the read DQS is centered into the read data eye. Valid values are:
 * 1b0 = PUB sets the read DQS LCDL to 0 (internally). DQS is already shifted 90 degrees by write path
 * 1b1 = The read DQS shift is set manually through software
 */
#define DDRPHY_PGCR1_LBDQSS_MASK (0x10000000UL)
#define DDRPHY_PGCR1_LBDQSS_SHIFT (28U)
#define DDRPHY_PGCR1_LBDQSS_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_LBDQSS_SHIFT) & DDRPHY_PGCR1_LBDQSS_MASK)
#define DDRPHY_PGCR1_LBDQSS_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_LBDQSS_MASK) >> DDRPHY_PGCR1_LBDQSS_SHIFT)

