RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * IOLB (R/W)
 *
 * I/O Loop-Back Select: Selects where inside the I/O the loop-back of signals happens. Valid values are:
 * 0 = Loopback is after output buffer; output enable must be asserted 1 = Loopback is before output buffer; output enable is don’t care
 */
#define DDRPHY_PGCR1_IOLB_MASK (0x8000000UL)
#define DDRPHY_PGCR1_IOLB_SHIFT (27U)
#define DDRPHY_PGCR1_IOLB_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_IOLB_SHIFT) & DDRPHY_PGCR1_IOLB_MASK)
#define DDRPHY_PGCR1_IOLB_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_IOLB_MASK) >> DDRPHY_PGCR1_IOLB_SHIFT)

/*
 * INHVT (R/W)
 *
 * VT Calculation Inhibit: Inhibits calculation of the next VT compensated delay line values. A value of 1 will inhibit the VT calculation. This bit should be set to 1 during writes to the delay line registers.
 */
#define DDRPHY_PGCR1_INHVT_MASK (0x4000000UL)
#define DDRPHY_PGCR1_INHVT_SHIFT (26U)
#define DDRPHY_PGCR1_INHVT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_INHVT_SHIFT) & DDRPHY_PGCR1_INHVT_MASK)
#define DDRPHY_PGCR1_INHVT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_INHVT_MASK) >> DDRPHY_PGCR1_INHVT_SHIFT)

/*
 * DXHRST (R/W)
 *
 * DX PHY High-Speed Reset: a Write of '0' to this bit resets the DX macro without resetting the PUB RTL logic. This bit is not self-clearing and a '1' must be written to de-assert the reset.
 */
#define DDRPHY_PGCR1_DXHRST_MASK (0x2000000UL)
#define DDRPHY_PGCR1_DXHRST_SHIFT (25U)
#define DDRPHY_PGCR1_DXHRST_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_DXHRST_SHIFT) & DDRPHY_PGCR1_DXHRST_MASK)
#define DDRPHY_PGCR1_DXHRST_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_DXHRST_MASK) >> DDRPHY_PGCR1_DXHRST_SHIFT)

/*
 * ZCKSEL (R/W)
 *
 * Impedance Clock Divider Select: Selects the divide ratio for the clock used by the impedance control logic relative to the clock used by the memory controller and SDRAM.
 * Valid values are:
 * 00 = Divide by 2
 * 01 = Divide by 8
 * 10 = Divide by 32
 * 11 = Divide by 64
 * For more information, refer to “Impedance Calibration” on page 174.
 */
#define DDRPHY_PGCR1_ZCKSEL_MASK (0x1800000UL)
#define DDRPHY_PGCR1_ZCKSEL_SHIFT (23U)
#define DDRPHY_PGCR1_ZCKSEL_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_ZCKSEL_SHIFT) & DDRPHY_PGCR1_ZCKSEL_MASK)
#define DDRPHY_PGCR1_ZCKSEL_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_ZCKSEL_MASK) >> DDRPHY_PGCR1_ZCKSEL_SHIFT)

/*
 * DLDLMT (R/W)
 *
 * Delay Line VT Drift Limit: Specifies the minimum change in the delay line VT drift in one direction which should result in the assertion of the delay line VT drift status signal (vt_drift). The limit is specified in terms of delay select values. A value of 0 disables the assertion of delay line VT drift status signal.
 */
#define DDRPHY_PGCR1_DLDLMT_MASK (0x7F8000UL)
#define DDRPHY_PGCR1_DLDLMT_SHIFT (15U)
#define DDRPHY_PGCR1_DLDLMT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_DLDLMT_SHIFT) & DDRPHY_PGCR1_DLDLMT_MASK)
#define DDRPHY_PGCR1_DLDLMT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_DLDLMT_MASK) >> DDRPHY_PGCR1_DLDLMT_SHIFT)

/*
 * FDEPTH (R/W)
 *
 * Filter Depth: Specifies the number of measurements over which all AC and DATX8 initial period measurements, that happen after reset or when calibration is manually triggered, are averaged. Valid values are:
 * 00 = 2
 * 01 = 4
 * 10 = 8
 * 11 = 16
 */
#define DDRPHY_PGCR1_FDEPTH_MASK (0x6000U)
#define DDRPHY_PGCR1_FDEPTH_SHIFT (13U)
#define DDRPHY_PGCR1_FDEPTH_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_FDEPTH_SHIFT) & DDRPHY_PGCR1_FDEPTH_MASK)
#define DDRPHY_PGCR1_FDEPTH_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_FDEPTH_MASK) >> DDRPHY_PGCR1_FDEPTH_SHIFT)

/*
 * LPFDEPTH (R/W)
 *
 * Low-Pass Filter Depth: Specifies the number of measurements over which MDL period measurements are filtered. This determines the time constant of the low pass filter. Valid values are:
 * 00 = 2
 * 01 = 4
 * 10 = 8
 * 11 = 16
 */
#define DDRPHY_PGCR1_LPFDEPTH_MASK (0x1800U)
#define DDRPHY_PGCR1_LPFDEPTH_SHIFT (11U)
#define DDRPHY_PGCR1_LPFDEPTH_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_LPFDEPTH_SHIFT) & DDRPHY_PGCR1_LPFDEPTH_MASK)
#define DDRPHY_PGCR1_LPFDEPTH_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_LPFDEPTH_MASK) >> DDRPHY_PGCR1_LPFDEPTH_SHIFT)

/*
 * LPFEN (R/W)
 *
 * Low-Pass Filter Enable: Enables, if set, the low pass filtering of MDL period measurements.
 */
#define DDRPHY_PGCR1_LPFEN_MASK (0x400U)
#define DDRPHY_PGCR1_LPFEN_SHIFT (10U)
#define DDRPHY_PGCR1_LPFEN_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_LPFEN_SHIFT) & DDRPHY_PGCR1_LPFEN_MASK)
#define DDRPHY_PGCR1_LPFEN_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_LPFEN_MASK) >> DDRPHY_PGCR1_LPFEN_SHIFT)

/*
 * MDLEN (R/W)
 *
 * Master Delay Line Enable: Enables, if set, the AC master delay line calibration to perform subsequent period measurements following the initial period measurements that are performed after reset or on when calibration is manually triggered. These additional measurements are accumulated and filtered as long as this bit remains high.
 */
#define DDRPHY_PGCR1_MDLEN_MASK (0x200U)
#define DDRPHY_PGCR1_MDLEN_SHIFT (9U)
#define DDRPHY_PGCR1_MDLEN_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_MDLEN_SHIFT) & DDRPHY_PGCR1_MDLEN_MASK)
#define DDRPHY_PGCR1_MDLEN_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_MDLEN_MASK) >> DDRPHY_PGCR1_MDLEN_SHIFT)

/*
 * IODDRM (R/W)
 *
 * I/O DDR Mode (D3F I/O Only): Selects the DDR mode for the I/Os. These bits connect to bits [2:1] of the IOM pin of the SSTL I/O. For more information, refer to the SSTL I/O chapter in the DWC DDR PHY Databook.
 */
#define DDRPHY_PGCR1_IODDRM_MASK (0x180U)
#define DDRPHY_PGCR1_IODDRM_SHIFT (7U)
#define DDRPHY_PGCR1_IODDRM_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_IODDRM_SHIFT) & DDRPHY_PGCR1_IODDRM_MASK)
#define DDRPHY_PGCR1_IODDRM_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_IODDRM_MASK) >> DDRPHY_PGCR1_IODDRM_SHIFT)

/*
 * WLSELT (R/W)
 *
 * Write Leveling Select Type: Selects the encoding type for the write leveling select signal depending on the desired setup/hold margins for the internal pipelines. Refer to the DDR PHY Databook for details of how the select type is used. Valid values are:
 * 0 = Type 1: Setup margin of 90 degrees and hold margin of 90 degrees 1 = Type 2: Setup margin of 135 degrees and hold margin of 45 degrees
 */
#define DDRPHY_PGCR1_WLSELT_MASK (0x40U)
#define DDRPHY_PGCR1_WLSELT_SHIFT (6U)
#define DDRPHY_PGCR1_WLSELT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_WLSELT_SHIFT) & DDRPHY_PGCR1_WLSELT_MASK)
#define DDRPHY_PGCR1_WLSELT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_WLSELT_MASK) >> DDRPHY_PGCR1_WLSELT_SHIFT)

