RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * ACHRST (R/W)
 *
 * AC PHY High-Speed Reset: a Write of '0' to this bit resets the AC macro without resetting the PUB RTL logic. This bit is not self-clearing and a '1' must be written to de-assert the reset.
 */
#define DDRPHY_PGCR1_ACHRST_MASK (0x20U)
#define DDRPHY_PGCR1_ACHRST_SHIFT (5U)
#define DDRPHY_PGCR1_ACHRST_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_ACHRST_SHIFT) & DDRPHY_PGCR1_ACHRST_MASK)
#define DDRPHY_PGCR1_ACHRST_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_ACHRST_MASK) >> DDRPHY_PGCR1_ACHRST_SHIFT)

/*
 * WSLOPT (R/W)
 *
 * Write System Latency Optimization: controls the insertion of a pipeline stage on the AC signals from the DFI interface to the PHY to cater for a negative write system latency (WSL) value (only -1 possible).
 * 0x0 = A pipeline stage is inserted only if WL2 training results in a WSL of -1 for any rank
 * 0x1 = Inserts a pipeline stage
 */
#define DDRPHY_PGCR1_WSLOPT_MASK (0x10U)
#define DDRPHY_PGCR1_WSLOPT_SHIFT (4U)
#define DDRPHY_PGCR1_WSLOPT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_WSLOPT_SHIFT) & DDRPHY_PGCR1_WSLOPT_MASK)
#define DDRPHY_PGCR1_WSLOPT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_WSLOPT_MASK) >> DDRPHY_PGCR1_WSLOPT_SHIFT)

/*
 * WLSTEP (R/W)
 *
 * Write Leveling Step: Specifies the number of delay step-size increments during each step of write leveling. Valid values are:
 * 0 = computed to be 1/2 of the associated lane's DXnGSR0.WLPRD value 1 = 1 step size
 */
#define DDRPHY_PGCR1_WLSTEP_MASK (0x4U)
#define DDRPHY_PGCR1_WLSTEP_SHIFT (2U)
#define DDRPHY_PGCR1_WLSTEP_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_WLSTEP_SHIFT) & DDRPHY_PGCR1_WLSTEP_MASK)
#define DDRPHY_PGCR1_WLSTEP_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_WLSTEP_MASK) >> DDRPHY_PGCR1_WLSTEP_SHIFT)

/*
 * WLMODE (R/W)
 *
 * Write Leveling (Software) Mode: Indicates, if set, that the PUB is in software write leveling mode in which software executes single steps of DQS pulsing by writing '1' to PIR.WL. The write leveling DQ status from the DRAM is captured in DXnGSR0.WLDQ.
 */
#define DDRPHY_PGCR1_WLMODE_MASK (0x2U)
#define DDRPHY_PGCR1_WLMODE_SHIFT (1U)
#define DDRPHY_PGCR1_WLMODE_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_WLMODE_SHIFT) & DDRPHY_PGCR1_WLMODE_MASK)
#define DDRPHY_PGCR1_WLMODE_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_WLMODE_MASK) >> DDRPHY_PGCR1_WLMODE_SHIFT)

/*
 * PDDISDX (R/W)
 *
 * Power Down Disabled Byte: Indicates, if set, that the PLL and I/Os of a disabled byte should be powered down.
 */
#define DDRPHY_PGCR1_PDDISDX_MASK (0x1U)
#define DDRPHY_PGCR1_PDDISDX_SHIFT (0U)
#define DDRPHY_PGCR1_PDDISDX_SET(x) (((uint32_t)(x) << DDRPHY_PGCR1_PDDISDX_SHIFT) & DDRPHY_PGCR1_PDDISDX_MASK)
#define DDRPHY_PGCR1_PDDISDX_GET(x) (((uint32_t)(x) & DDRPHY_PGCR1_PDDISDX_MASK) >> DDRPHY_PGCR1_PDDISDX_SHIFT)

/* Bitfield definition for register: PGSR0 */
/*
 * APLOCK (R)
 *
 * AC PLL Lock: Indicates, if set, that AC PLL has locked. This is a direct status of the AC PLL lock pin.
 */
#define DDRPHY_PGSR0_APLOCK_MASK (0x80000000UL)
#define DDRPHY_PGSR0_APLOCK_SHIFT (31U)
#define DDRPHY_PGSR0_APLOCK_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_APLOCK_MASK) >> DDRPHY_PGSR0_APLOCK_SHIFT)

/*
 * PLDONE_CHN (R)
 *
 * PLL Lock Done per Channel: Indicates PLL locking has completed for each underlying channel. Bit 28 represents channel 0 while bit 29 represents channel 1.
 */
#define DDRPHY_PGSR0_PLDONE_CHN_MASK (0x30000000UL)
#define DDRPHY_PGSR0_PLDONE_CHN_SHIFT (28U)
#define DDRPHY_PGSR0_PLDONE_CHN_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_PLDONE_CHN_MASK) >> DDRPHY_PGSR0_PLDONE_CHN_SHIFT)

/*
 * WEERR (R)
 *
 * Write Eye Training Error: Indicates, if set, that there is an error in write eye training.
 */
#define DDRPHY_PGSR0_WEERR_MASK (0x8000000UL)
#define DDRPHY_PGSR0_WEERR_SHIFT (27U)
#define DDRPHY_PGSR0_WEERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WEERR_MASK) >> DDRPHY_PGSR0_WEERR_SHIFT)

/*
 * REERR (R)
 *
 * Read Data Eye Training Error: Indicates, if set, that there is an error in read eye training.
 */
#define DDRPHY_PGSR0_REERR_MASK (0x4000000UL)
#define DDRPHY_PGSR0_REERR_SHIFT (26U)
#define DDRPHY_PGSR0_REERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_REERR_MASK) >> DDRPHY_PGSR0_REERR_SHIFT)

/*
 * WDERR (R)
 *
 * Write Data Bit Deskew Error: Indicates, if set, that there is an error in write bit deskew.
 */
#define DDRPHY_PGSR0_WDERR_MASK (0x2000000UL)
#define DDRPHY_PGSR0_WDERR_SHIFT (25U)
#define DDRPHY_PGSR0_WDERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WDERR_MASK) >> DDRPHY_PGSR0_WDERR_SHIFT)

/*
 * RDERR (R)
 *
 * Read Data Bit Deskew Error: Indicates, if set, that there is an error in read bit deskew.
 */
#define DDRPHY_PGSR0_RDERR_MASK (0x1000000UL)
#define DDRPHY_PGSR0_RDERR_SHIFT (24U)
#define DDRPHY_PGSR0_RDERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_RDERR_MASK) >> DDRPHY_PGSR0_RDERR_SHIFT)

/*
 * WLAERR (R)
 *
 * Write Data Leveling Adjustment Error: Indicates, if set, that there is an error in write leveling adjustment.
 */
#define DDRPHY_PGSR0_WLAERR_MASK (0x800000UL)
#define DDRPHY_PGSR0_WLAERR_SHIFT (23U)
#define DDRPHY_PGSR0_WLAERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WLAERR_MASK) >> DDRPHY_PGSR0_WLAERR_SHIFT)

/*
 * QSGERR (R)
 *
 * Read DQS Gate Training Error: Indicates, if set, that there is an error in DQS gate training.
 */
#define DDRPHY_PGSR0_QSGERR_MASK (0x400000UL)
#define DDRPHY_PGSR0_QSGERR_SHIFT (22U)
#define DDRPHY_PGSR0_QSGERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_QSGERR_MASK) >> DDRPHY_PGSR0_QSGERR_SHIFT)

/*
 * WLERR (R)
 *
 * Write Leveling Error: Indicates, if set, that there is an error in write leveling.
 */
#define DDRPHY_PGSR0_WLERR_MASK (0x200000UL)
#define DDRPHY_PGSR0_WLERR_SHIFT (21U)
#define DDRPHY_PGSR0_WLERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WLERR_MASK) >> DDRPHY_PGSR0_WLERR_SHIFT)

/*
 * ZCERR (R)
 *
 * Impedance Calibration Error: Indicates, if set, that there is an error in impedance calibration.
 */
#define DDRPHY_PGSR0_ZCERR_MASK (0x100000UL)
#define DDRPHY_PGSR0_ZCERR_SHIFT (20U)
#define DDRPHY_PGSR0_ZCERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_ZCERR_MASK) >> DDRPHY_PGSR0_ZCERR_SHIFT)

