RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * WEDONE (R)
 *
 * Write Data Eye Training Done: Indicates, if set, that write eye training has completed.
 */
#define DDRPHY_PGSR0_WEDONE_MASK (0x800U)
#define DDRPHY_PGSR0_WEDONE_SHIFT (11U)
#define DDRPHY_PGSR0_WEDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WEDONE_MASK) >> DDRPHY_PGSR0_WEDONE_SHIFT)

/*
 * REDONE (R)
 *
 * Read Data Eye Training Done: Indicates, if set, that read eye training has completed.
 */
#define DDRPHY_PGSR0_REDONE_MASK (0x400U)
#define DDRPHY_PGSR0_REDONE_SHIFT (10U)
#define DDRPHY_PGSR0_REDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_REDONE_MASK) >> DDRPHY_PGSR0_REDONE_SHIFT)

/*
 * WDDONE (R)
 *
 * Write Data Bit Deskew Done: Indicates, if set, that write bit deskew has completed.
 */
#define DDRPHY_PGSR0_WDDONE_MASK (0x200U)
#define DDRPHY_PGSR0_WDDONE_SHIFT (9U)
#define DDRPHY_PGSR0_WDDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WDDONE_MASK) >> DDRPHY_PGSR0_WDDONE_SHIFT)

/*
 * RDDONE (R)
 *
 * Read Data Bit Deskew Done: Indicates, if set, that read bit deskew has completed.
 */
#define DDRPHY_PGSR0_RDDONE_MASK (0x100U)
#define DDRPHY_PGSR0_RDDONE_SHIFT (8U)
#define DDRPHY_PGSR0_RDDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_RDDONE_MASK) >> DDRPHY_PGSR0_RDDONE_SHIFT)

/*
 * WLADONE (R)
 *
 * Write Leveling Adjustment Done: Indicates, if set, that write leveling adjustment has completed.
 */
#define DDRPHY_PGSR0_WLADONE_MASK (0x80U)
#define DDRPHY_PGSR0_WLADONE_SHIFT (7U)
#define DDRPHY_PGSR0_WLADONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WLADONE_MASK) >> DDRPHY_PGSR0_WLADONE_SHIFT)

/*
 * QSGDONE (R)
 *
 * Read DQS Gate Training Done: Indicates, if set, that DQS gate training has completed.
 */
#define DDRPHY_PGSR0_QSGDONE_MASK (0x40U)
#define DDRPHY_PGSR0_QSGDONE_SHIFT (6U)
#define DDRPHY_PGSR0_QSGDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_QSGDONE_MASK) >> DDRPHY_PGSR0_QSGDONE_SHIFT)

/*
 * WLDONE (R)
 *
 * Write Leveling Done: Indicates, if set, that write leveling has completed.
 */
#define DDRPHY_PGSR0_WLDONE_MASK (0x20U)
#define DDRPHY_PGSR0_WLDONE_SHIFT (5U)
#define DDRPHY_PGSR0_WLDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_WLDONE_MASK) >> DDRPHY_PGSR0_WLDONE_SHIFT)

/*
 * DIDONE (R)
 *
 * DRAM Initialization Done: Indicates, if set, that DRAM initialization has completed.
 */
#define DDRPHY_PGSR0_DIDONE_MASK (0x10U)
#define DDRPHY_PGSR0_DIDONE_SHIFT (4U)
#define DDRPHY_PGSR0_DIDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_DIDONE_MASK) >> DDRPHY_PGSR0_DIDONE_SHIFT)

/*
 * ZCDONE (R)
 *
 * Impedance Calibration Done: Indicates, if set, that impedance calibration has completed.
 */
#define DDRPHY_PGSR0_ZCDONE_MASK (0x8U)
#define DDRPHY_PGSR0_ZCDONE_SHIFT (3U)
#define DDRPHY_PGSR0_ZCDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_ZCDONE_MASK) >> DDRPHY_PGSR0_ZCDONE_SHIFT)

/*
 * DCDONE (R)
 *
 * Digital Delay Line (DDL) Calibration Done: Indicates, if set, that DDL calibration has completed.
 */
#define DDRPHY_PGSR0_DCDONE_MASK (0x4U)
#define DDRPHY_PGSR0_DCDONE_SHIFT (2U)
#define DDRPHY_PGSR0_DCDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_DCDONE_MASK) >> DDRPHY_PGSR0_DCDONE_SHIFT)

/*
 * PLDONE (R)
 *
 * PLL Lock Done: Indicates, if set, that PLL locking has completed.
 */
#define DDRPHY_PGSR0_PLDONE_MASK (0x2U)
#define DDRPHY_PGSR0_PLDONE_SHIFT (1U)
#define DDRPHY_PGSR0_PLDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_PLDONE_MASK) >> DDRPHY_PGSR0_PLDONE_SHIFT)

/*
 * IDONE (R)
 *
 * Initialization Done: Indicates, if set, that the DDR system initialization has completed. This bit is set after all the selected initialization routines in PIR register have completed.
 */
#define DDRPHY_PGSR0_IDONE_MASK (0x1U)
#define DDRPHY_PGSR0_IDONE_SHIFT (0U)
#define DDRPHY_PGSR0_IDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR0_IDONE_MASK) >> DDRPHY_PGSR0_IDONE_SHIFT)

/* Bitfield definition for register: PGSR1 */
/*
 * PARERR (R)
 *
 * RDIMM Parity Error: Indicates, if set, that there was a parity error (i.e. err_out_n was sampled low) during one of the transactions to the RDIMM buffer chip. This bit remains asserted until cleared by the PIR.CLRSR.
 */
#define DDRPHY_PGSR1_PARERR_MASK (0x80000000UL)
#define DDRPHY_PGSR1_PARERR_SHIFT (31U)
#define DDRPHY_PGSR1_PARERR_GET(x) (((uint32_t)(x) & DDRPHY_PGSR1_PARERR_MASK) >> DDRPHY_PGSR1_PARERR_SHIFT)

/*
 * VTSTOP (R)
 *
 * VT Stop: Indicates, if set, that the VT calculation logic has stopped computing the next values for the VT compensated delay line values. After assertion of the PGCR.INHVT, the VTSTOP bit should be read to ensure all VT compensation logic has stopped computations before writing to the delay line registers.
 */
#define DDRPHY_PGSR1_VTSTOP_MASK (0x40000000UL)
#define DDRPHY_PGSR1_VTSTOP_SHIFT (30U)
#define DDRPHY_PGSR1_VTSTOP_GET(x) (((uint32_t)(x) & DDRPHY_PGSR1_VTSTOP_MASK) >> DDRPHY_PGSR1_VTSTOP_SHIFT)

/*
 * DLTCODE (R)
 *
 * Delay Line Test Code: Returns the code measured by the PHY control block that corresponds to the period of the AC delay line digital test output.
 */
#define DDRPHY_PGSR1_DLTCODE_MASK (0x1FFFFFEUL)
#define DDRPHY_PGSR1_DLTCODE_SHIFT (1U)
#define DDRPHY_PGSR1_DLTCODE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR1_DLTCODE_MASK) >> DDRPHY_PGSR1_DLTCODE_SHIFT)

/*
 * DLTDONE (R)
 *
 * Delay Line Test Done: Indicates, if set, that the PHY control block has finished doing period measurement of the AC delay line digital test output.
 */
#define DDRPHY_PGSR1_DLTDONE_MASK (0x1U)
#define DDRPHY_PGSR1_DLTDONE_SHIFT (0U)
#define DDRPHY_PGSR1_DLTDONE_GET(x) (((uint32_t)(x) & DDRPHY_PGSR1_DLTDONE_MASK) >> DDRPHY_PGSR1_DLTDONE_SHIFT)

/* Bitfield definition for register: PLLCR */
/*
 * BYP (R/W)
 *
 * PLL Bypass: Bypasses the PLL, if set, to 1.
 */
#define DDRPHY_PLLCR_BYP_MASK (0x80000000UL)
#define DDRPHY_PLLCR_BYP_SHIFT (31U)
#define DDRPHY_PLLCR_BYP_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_BYP_SHIFT) & DDRPHY_PLLCR_BYP_MASK)
#define DDRPHY_PLLCR_BYP_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_BYP_MASK) >> DDRPHY_PLLCR_BYP_SHIFT)

/*
 * PLLRST (R/W)
 *
 * PLL Rest: Resets the PLLs by driving the PLL reset pin. This bit is not self-clearing and a ‘0’ must be written to de-assert the reset.
 */
#define DDRPHY_PLLCR_PLLRST_MASK (0x40000000UL)
#define DDRPHY_PLLCR_PLLRST_SHIFT (30U)
#define DDRPHY_PLLCR_PLLRST_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_PLLRST_SHIFT) & DDRPHY_PLLCR_PLLRST_MASK)
#define DDRPHY_PLLCR_PLLRST_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_PLLRST_MASK) >> DDRPHY_PLLCR_PLLRST_SHIFT)

