RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * PLLPD (R/W)
 *
 * PLL Power Down: Puts the PLLs in power down mode by driving the PLL power down pin. This bit is not self-clearing and a ‘0’ must be written to de-assert the power-down.
 */
#define DDRPHY_PLLCR_PLLPD_MASK (0x20000000UL)
#define DDRPHY_PLLCR_PLLPD_SHIFT (29U)
#define DDRPHY_PLLCR_PLLPD_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_PLLPD_SHIFT) & DDRPHY_PLLCR_PLLPD_MASK)
#define DDRPHY_PLLCR_PLLPD_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_PLLPD_MASK) >> DDRPHY_PLLCR_PLLPD_SHIFT)

/*
 * FRQSEL (R/W)
 *
 * PLL Frequency Select: Selects the operating range of the PLL. Valid values for PHYs that go up to 2133 Mbps are:
 * 00 = PLL reference clock (ctl_clk/REF_CLK) ranges from 335MHz to 533MHz 01 = PLL reference clock (ctl_clk/REF_CLK) ranges from 225MHz to 385MHz 10 = Reserved
 * 11 = PLL reference clock (ctl_clk/REF_CLK) ranges from 166MHz to 275MHz
 * Valid values for PHYs that don’t go up to 2133 Mbps are:
 * 00 = PLL reference clock (ctl_clk/REF_CLK) ranges from 250MHz to 400MHz 01 = PLL reference clock (ctl_clk/REF_CLK) ranges from 166MHz to 300MHz 10 = Reserved
 * 11 = Reserved
 */
#define DDRPHY_PLLCR_FRQSEL_MASK (0xC0000UL)
#define DDRPHY_PLLCR_FRQSEL_SHIFT (18U)
#define DDRPHY_PLLCR_FRQSEL_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_FRQSEL_SHIFT) & DDRPHY_PLLCR_FRQSEL_MASK)
#define DDRPHY_PLLCR_FRQSEL_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_FRQSEL_MASK) >> DDRPHY_PLLCR_FRQSEL_SHIFT)

/*
 * QPMODE (R/W)
 *
 * PLL Quadrature Phase Mode: Enables, if set, the quadrature phase clock outputs. This mode is not used in this version of the PHY.
 */
#define DDRPHY_PLLCR_QPMODE_MASK (0x20000UL)
#define DDRPHY_PLLCR_QPMODE_SHIFT (17U)
#define DDRPHY_PLLCR_QPMODE_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_QPMODE_SHIFT) & DDRPHY_PLLCR_QPMODE_MASK)
#define DDRPHY_PLLCR_QPMODE_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_QPMODE_MASK) >> DDRPHY_PLLCR_QPMODE_SHIFT)

/*
 * CPPC (R/W)
 *
 * Charge Pump Proportional Current Control
 */
#define DDRPHY_PLLCR_CPPC_MASK (0x1E000UL)
#define DDRPHY_PLLCR_CPPC_SHIFT (13U)
#define DDRPHY_PLLCR_CPPC_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_CPPC_SHIFT) & DDRPHY_PLLCR_CPPC_MASK)
#define DDRPHY_PLLCR_CPPC_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_CPPC_MASK) >> DDRPHY_PLLCR_CPPC_SHIFT)

/*
 * CPIC (R/W)
 *
 * Charge Pump Integrating Current Control
 */
#define DDRPHY_PLLCR_CPIC_MASK (0x1800U)
#define DDRPHY_PLLCR_CPIC_SHIFT (11U)
#define DDRPHY_PLLCR_CPIC_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_CPIC_SHIFT) & DDRPHY_PLLCR_CPIC_MASK)
#define DDRPHY_PLLCR_CPIC_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_CPIC_MASK) >> DDRPHY_PLLCR_CPIC_SHIFT)

/*
 * GSHIFT (R/W)
 *
 * Gear Shift: Enables, if set, rapid locking mode.
 */
#define DDRPHY_PLLCR_GSHIFT_MASK (0x400U)
#define DDRPHY_PLLCR_GSHIFT_SHIFT (10U)
#define DDRPHY_PLLCR_GSHIFT_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_GSHIFT_SHIFT) & DDRPHY_PLLCR_GSHIFT_MASK)
#define DDRPHY_PLLCR_GSHIFT_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_GSHIFT_MASK) >> DDRPHY_PLLCR_GSHIFT_SHIFT)

/*
 * ATOEN (R/W)
 *
 * Analog Test Enable (ATOEN): Selects the analog test signal that is driven on the analog test output pin. Otherwise the analog test output is tri-stated. This allows analog test output pins from multiple PLLs to be connected together. Valid values are:
 * 0000 = All PLL analog test signals are tri-stated 0001 = AC PLL analog test signal is driven out
 * 0010 = DATX8 0 PLL analog test signal is driven out 0011 = DATX8 1 PLL analog test signal is driven out 0100 = DATX8 2 PLL analog test signal is driven out 0101 = DATX8 3 PLL analog test signal is driven out 0110 = DATX8 4 PLL analog test signal is driven out 0111 = DATX8 5 PLL analog test signal is driven out 1000 = DATX8 6 PLL analog test signal is driven out 1001 = DATX8 7 PLL analog test signal is driven out 1010 = DATX8 8 PLL analog test signal is driven out 1011 – 1111 = Reserved
 */
#define DDRPHY_PLLCR_ATOEN_MASK (0x3C0U)
#define DDRPHY_PLLCR_ATOEN_SHIFT (6U)
#define DDRPHY_PLLCR_ATOEN_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_ATOEN_SHIFT) & DDRPHY_PLLCR_ATOEN_MASK)
#define DDRPHY_PLLCR_ATOEN_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_ATOEN_MASK) >> DDRPHY_PLLCR_ATOEN_SHIFT)

/*
 * ATC (R/W)
 *
 * Analog Test Control: Selects various PLL analog test signals to be brought out via PLL analog test output pin (pll_ato). Valid values are:
 * 0000 = Reserved
 * 0001 = vdd_ckin
 * 0010 = vrfbf
 * 0011 = vdd_cko
 * 0100 = vp_cp
 * 0101 = vpfil(vp)
 * 0110 = Reserved
 * 0111 = gd
 * 1000 = vcntrl_atb
 * 1001 = vref_atb
 * 1010 = vpsf_atb
 * 1011 – 1111 = Reserved
 */
#define DDRPHY_PLLCR_ATC_MASK (0x3CU)
#define DDRPHY_PLLCR_ATC_SHIFT (2U)
#define DDRPHY_PLLCR_ATC_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_ATC_SHIFT) & DDRPHY_PLLCR_ATC_MASK)
#define DDRPHY_PLLCR_ATC_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_ATC_MASK) >> DDRPHY_PLLCR_ATC_SHIFT)

/*
 * DTC (R/W)
 *
 * Digital Test Control: Selects various PLL digital test signals and other test mode signals to be brought out via bit [1] of the PLL digital test output (pll_dto[1]). Valid values are:
 * 00 = ‘0’ (Test output is disabled) 01 = PLL x1 clock (X1)
 * 10 = PLL reference (input) clock (REF_CLK) 11 = PLL feedback clock (FB_X1)
 */
#define DDRPHY_PLLCR_DTC_MASK (0x3U)
#define DDRPHY_PLLCR_DTC_SHIFT (0U)
#define DDRPHY_PLLCR_DTC_SET(x) (((uint32_t)(x) << DDRPHY_PLLCR_DTC_SHIFT) & DDRPHY_PLLCR_DTC_MASK)
#define DDRPHY_PLLCR_DTC_GET(x) (((uint32_t)(x) & DDRPHY_PLLCR_DTC_MASK) >> DDRPHY_PLLCR_DTC_SHIFT)

/* Bitfield definition for register: PTR0 */
/*
 * TPLLPD (R/W)
 *
 * PLL Power-Down Time: Number of configuration or APB clock cycles that the PLL must remain in power-down mode, i.e. number of clock cycles from when PLL power-down pin is asserted to when PLL power-down pin is de-asserted. This must correspond to a value that is equal to or more than 1us. Default value corresponds to 1us.
 */
#define DDRPHY_PTR0_TPLLPD_MASK (0xFFE00000UL)
#define DDRPHY_PTR0_TPLLPD_SHIFT (21U)
#define DDRPHY_PTR0_TPLLPD_SET(x) (((uint32_t)(x) << DDRPHY_PTR0_TPLLPD_SHIFT) & DDRPHY_PTR0_TPLLPD_MASK)
#define DDRPHY_PTR0_TPLLPD_GET(x) (((uint32_t)(x) & DDRPHY_PTR0_TPLLPD_MASK) >> DDRPHY_PTR0_TPLLPD_SHIFT)

