RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * TPLLGS (R/W)
 *
 * PLL Gear Shift Time: Number of configuration or APB clock cycles from when the PLL reset pin is de-asserted to when the PLL gear shift pin is de-asserted. This must correspond to a value that is equal to or more than 4us. Default value corresponds to 4us.
 */
#define DDRPHY_PTR0_TPLLGS_MASK (0x1FFFC0UL)
#define DDRPHY_PTR0_TPLLGS_SHIFT (6U)
#define DDRPHY_PTR0_TPLLGS_SET(x) (((uint32_t)(x) << DDRPHY_PTR0_TPLLGS_SHIFT) & DDRPHY_PTR0_TPLLGS_MASK)
#define DDRPHY_PTR0_TPLLGS_GET(x) (((uint32_t)(x) & DDRPHY_PTR0_TPLLGS_MASK) >> DDRPHY_PTR0_TPLLGS_SHIFT)

/*
 * TPHYRST (R/W)
 *
 * PHY Reset Time: Number of configuration or APB clock cycles that the PHY reset must remain asserted after PHY calibration is done before the reset to the PHY is de-asserted. This is used to extend the reset to the PHY so that the reset is asserted for some clock cycles after the clocks are stable. Valid values are from 1 to 63 (the value must be non-zero).
 */
#define DDRPHY_PTR0_TPHYRST_MASK (0x3FU)
#define DDRPHY_PTR0_TPHYRST_SHIFT (0U)
#define DDRPHY_PTR0_TPHYRST_SET(x) (((uint32_t)(x) << DDRPHY_PTR0_TPHYRST_SHIFT) & DDRPHY_PTR0_TPHYRST_MASK)
#define DDRPHY_PTR0_TPHYRST_GET(x) (((uint32_t)(x) & DDRPHY_PTR0_TPHYRST_MASK) >> DDRPHY_PTR0_TPHYRST_SHIFT)

/* Bitfield definition for register: PTR1 */
/*
 * TPLLLOCK (R/W)
 *
 * PLL Lock Time: Number of configuration or APB clock cycles for the PLL to stabilize and lock, i.e. number of clock cycles from when the PLL reset pin is de-asserted to when the PLL has lock and is ready for use. This must correspond to a value that is equal to or more than 100us. Default value corresponds to 100us.
 */
#define DDRPHY_PTR1_TPLLLOCK_MASK (0xFFFF0000UL)
#define DDRPHY_PTR1_TPLLLOCK_SHIFT (16U)
#define DDRPHY_PTR1_TPLLLOCK_SET(x) (((uint32_t)(x) << DDRPHY_PTR1_TPLLLOCK_SHIFT) & DDRPHY_PTR1_TPLLLOCK_MASK)
#define DDRPHY_PTR1_TPLLLOCK_GET(x) (((uint32_t)(x) & DDRPHY_PTR1_TPLLLOCK_MASK) >> DDRPHY_PTR1_TPLLLOCK_SHIFT)

/*
 * TPLLRST (R/W)
 *
 * PLL Reset Time: Number of configuration or APB clock cycles that the PLL must remain in reset mode, i.e. number of clock cycles from when PLL power-down pin is de-asserted and PLL reset pin is asserted to when PLL reset pin is de-asserted.
 * The setting must correspond to a value that is equal to, or greater than, 3us.
 */
#define DDRPHY_PTR1_TPLLRST_MASK (0x1FFFU)
#define DDRPHY_PTR1_TPLLRST_SHIFT (0U)
#define DDRPHY_PTR1_TPLLRST_SET(x) (((uint32_t)(x) << DDRPHY_PTR1_TPLLRST_SHIFT) & DDRPHY_PTR1_TPLLRST_MASK)
#define DDRPHY_PTR1_TPLLRST_GET(x) (((uint32_t)(x) & DDRPHY_PTR1_TPLLRST_MASK) >> DDRPHY_PTR1_TPLLRST_SHIFT)

/* Bitfield definition for register: PTR2 */
/*
 * TWLDLYS (R/W)
 *
 * Write Leveling Delay Settling Time: Number of controller clock cycles from when a new value of the write leveling delay is applies to the LCDL to when to DQS high is driven high. This allows the delay to settle.
 */
#define DDRPHY_PTR2_TWLDLYS_MASK (0xF8000UL)
#define DDRPHY_PTR2_TWLDLYS_SHIFT (15U)
#define DDRPHY_PTR2_TWLDLYS_SET(x) (((uint32_t)(x) << DDRPHY_PTR2_TWLDLYS_SHIFT) & DDRPHY_PTR2_TWLDLYS_MASK)
#define DDRPHY_PTR2_TWLDLYS_GET(x) (((uint32_t)(x) & DDRPHY_PTR2_TWLDLYS_MASK) >> DDRPHY_PTR2_TWLDLYS_SHIFT)

/*
 * TCALH (R/W)
 *
 * Calibration Hold Time: Number of controller clock cycles from when the clock was disabled (cal_clk_en deasserted) to when calibration is enable (cal_en asserted).
 */
#define DDRPHY_PTR2_TCALH_MASK (0x7C00U)
#define DDRPHY_PTR2_TCALH_SHIFT (10U)
#define DDRPHY_PTR2_TCALH_SET(x) (((uint32_t)(x) << DDRPHY_PTR2_TCALH_SHIFT) & DDRPHY_PTR2_TCALH_MASK)
#define DDRPHY_PTR2_TCALH_GET(x) (((uint32_t)(x) & DDRPHY_PTR2_TCALH_MASK) >> DDRPHY_PTR2_TCALH_SHIFT)

/*
 * TCALS (R/W)
 *
 * Calibration Setup Time: Number of controller clock cycles from when calibration is enabled (cal_en asserted) to when the calibration clock is asserted again (cal_clk_en asserted).
 */
#define DDRPHY_PTR2_TCALS_MASK (0x3E0U)
#define DDRPHY_PTR2_TCALS_SHIFT (5U)
#define DDRPHY_PTR2_TCALS_SET(x) (((uint32_t)(x) << DDRPHY_PTR2_TCALS_SHIFT) & DDRPHY_PTR2_TCALS_MASK)
#define DDRPHY_PTR2_TCALS_GET(x) (((uint32_t)(x) & DDRPHY_PTR2_TCALS_MASK) >> DDRPHY_PTR2_TCALS_SHIFT)

/*
 * TCALON (R/W)
 *
 * Calibration On Time: Number of clock cycles that the calibration clock is enabled (cal_clk_en asserted).
 */
#define DDRPHY_PTR2_TCALON_MASK (0x1FU)
#define DDRPHY_PTR2_TCALON_SHIFT (0U)
#define DDRPHY_PTR2_TCALON_SET(x) (((uint32_t)(x) << DDRPHY_PTR2_TCALON_SHIFT) & DDRPHY_PTR2_TCALON_MASK)
#define DDRPHY_PTR2_TCALON_GET(x) (((uint32_t)(x) & DDRPHY_PTR2_TCALON_MASK) >> DDRPHY_PTR2_TCALON_SHIFT)

/* Bitfield definition for register: PTR3 */
/*
 * TDINIT1 (R/W)
 *
 * DRAM Initialization Time 1: DRAM initialization time in DRAM clock cycles corresponding to the following:
 * DDR3 = CKE high time to first command (tRFC + 10 ns or 5 tCK, whichever is bigger) DDR2 = CKE high time to first command (400 ns)
 * Default value corresponds to DDR3 tRFC of 360ns at 1066 MHz.
 */
#define DDRPHY_PTR3_TDINIT1_MASK (0x1FF00000UL)
#define DDRPHY_PTR3_TDINIT1_SHIFT (20U)
#define DDRPHY_PTR3_TDINIT1_SET(x) (((uint32_t)(x) << DDRPHY_PTR3_TDINIT1_SHIFT) & DDRPHY_PTR3_TDINIT1_MASK)
#define DDRPHY_PTR3_TDINIT1_GET(x) (((uint32_t)(x) & DDRPHY_PTR3_TDINIT1_MASK) >> DDRPHY_PTR3_TDINIT1_SHIFT)

/*
 * TDINIT0 (R/W)
 *
 * DRAM Initialization Time 0: DRAM initialization time in DRAM clock cycles corresponding to the following:
 * DDR3 = CKE low time with power and clock stable (500 us) DDR2 = CKE low time with power and clock stable (200 us) Default value corresponds to DDR3 500 us at 1066 MHz.
 * During Verilog simulations, it is recommended that this value is changed to a much smaller value in order to avoid long simulation times. However, this may cause a memory model error, due to a violation of the CKE setup sequence. This violation is expected if this value is not programmed to the required SDRAM CKE low time, but memory models should be able to tolerate this violation without malfunction of the model.
 */
#define DDRPHY_PTR3_TDINIT0_MASK (0xFFFFFUL)
#define DDRPHY_PTR3_TDINIT0_SHIFT (0U)
#define DDRPHY_PTR3_TDINIT0_SET(x) (((uint32_t)(x) << DDRPHY_PTR3_TDINIT0_SHIFT) & DDRPHY_PTR3_TDINIT0_MASK)
#define DDRPHY_PTR3_TDINIT0_GET(x) (((uint32_t)(x) & DDRPHY_PTR3_TDINIT0_MASK) >> DDRPHY_PTR3_TDINIT0_SHIFT)

/* Bitfield definition for register: PTR4 */
/*
 * TDINIT3 (R/W)
 *
 * DRAM Initialization Time 3: DRAM initialization time in DRAM clock cycles corresponding to the following:
 * DDR3 = Time from ZQ initialization command to first command (1 us) Default value corresponds to the DDR3 640ns at 1066 MHz.
 */
#define DDRPHY_PTR4_TDINIT3_MASK (0xFFC0000UL)
#define DDRPHY_PTR4_TDINIT3_SHIFT (18U)
#define DDRPHY_PTR4_TDINIT3_SET(x) (((uint32_t)(x) << DDRPHY_PTR4_TDINIT3_SHIFT) & DDRPHY_PTR4_TDINIT3_MASK)
#define DDRPHY_PTR4_TDINIT3_GET(x) (((uint32_t)(x) & DDRPHY_PTR4_TDINIT3_MASK) >> DDRPHY_PTR4_TDINIT3_SHIFT)

