RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * TDINIT2 (R/W)
 *
 * DRAM Initialization Time 2: DRAM initialization time in DRAM clock cycles corresponding to the following:
 * DDR3 = Reset low time (200 us on power-up or 100 ns after power-up) Default value corresponds to DDR3 200 us at 1066 MHz.
 */
#define DDRPHY_PTR4_TDINIT2_MASK (0x3FFFFUL)
#define DDRPHY_PTR4_TDINIT2_SHIFT (0U)
#define DDRPHY_PTR4_TDINIT2_SET(x) (((uint32_t)(x) << DDRPHY_PTR4_TDINIT2_SHIFT) & DDRPHY_PTR4_TDINIT2_MASK)
#define DDRPHY_PTR4_TDINIT2_GET(x) (((uint32_t)(x) & DDRPHY_PTR4_TDINIT2_MASK) >> DDRPHY_PTR4_TDINIT2_SHIFT)

/* Bitfield definition for register: ACMDLR */
/*
 * MDLD (R/W)
 *
 * MDL Delay: Delay select for the LCDL for the Master Delay Line.
 */
#define DDRPHY_ACMDLR_MDLD_MASK (0xFF0000UL)
#define DDRPHY_ACMDLR_MDLD_SHIFT (16U)
#define DDRPHY_ACMDLR_MDLD_SET(x) (((uint32_t)(x) << DDRPHY_ACMDLR_MDLD_SHIFT) & DDRPHY_ACMDLR_MDLD_MASK)
#define DDRPHY_ACMDLR_MDLD_GET(x) (((uint32_t)(x) & DDRPHY_ACMDLR_MDLD_MASK) >> DDRPHY_ACMDLR_MDLD_SHIFT)

/*
 * TPRD (R/W)
 *
 * Target Period: Target period measured by the master delay line calibration for VT drift compensation. This is the current measured value of the period and is continuously updated if the MDL is enabled to do so.
 */
#define DDRPHY_ACMDLR_TPRD_MASK (0xFF00U)
#define DDRPHY_ACMDLR_TPRD_SHIFT (8U)
#define DDRPHY_ACMDLR_TPRD_SET(x) (((uint32_t)(x) << DDRPHY_ACMDLR_TPRD_SHIFT) & DDRPHY_ACMDLR_TPRD_MASK)
#define DDRPHY_ACMDLR_TPRD_GET(x) (((uint32_t)(x) & DDRPHY_ACMDLR_TPRD_MASK) >> DDRPHY_ACMDLR_TPRD_SHIFT)

/*
 * IPRD (R/W)
 *
 * Initial Period: Initial period measured by the master delay line calibration for VT drift compensation. This value is used as the denominator when calculating the ratios of updates during VT compensation.
 */
#define DDRPHY_ACMDLR_IPRD_MASK (0xFFU)
#define DDRPHY_ACMDLR_IPRD_SHIFT (0U)
#define DDRPHY_ACMDLR_IPRD_SET(x) (((uint32_t)(x) << DDRPHY_ACMDLR_IPRD_SHIFT) & DDRPHY_ACMDLR_IPRD_MASK)
#define DDRPHY_ACMDLR_IPRD_GET(x) (((uint32_t)(x) & DDRPHY_ACMDLR_IPRD_MASK) >> DDRPHY_ACMDLR_IPRD_SHIFT)

/* Bitfield definition for register: ACBDLR */
/*
 * ACBD (R/W)
 *
 * Address/Command Bit Delay: Delay select for the BDLs on address and command signals.
 */
#define DDRPHY_ACBDLR_ACBD_MASK (0xFC0000UL)
#define DDRPHY_ACBDLR_ACBD_SHIFT (18U)
#define DDRPHY_ACBDLR_ACBD_SET(x) (((uint32_t)(x) << DDRPHY_ACBDLR_ACBD_SHIFT) & DDRPHY_ACBDLR_ACBD_MASK)
#define DDRPHY_ACBDLR_ACBD_GET(x) (((uint32_t)(x) & DDRPHY_ACBDLR_ACBD_MASK) >> DDRPHY_ACBDLR_ACBD_SHIFT)

/*
 * CK2BD (R/W)
 *
 * CK2 Bit Delay: Delay select for the BDL on CK2.
 */
#define DDRPHY_ACBDLR_CK2BD_MASK (0x3F000UL)
#define DDRPHY_ACBDLR_CK2BD_SHIFT (12U)
#define DDRPHY_ACBDLR_CK2BD_SET(x) (((uint32_t)(x) << DDRPHY_ACBDLR_CK2BD_SHIFT) & DDRPHY_ACBDLR_CK2BD_MASK)
#define DDRPHY_ACBDLR_CK2BD_GET(x) (((uint32_t)(x) & DDRPHY_ACBDLR_CK2BD_MASK) >> DDRPHY_ACBDLR_CK2BD_SHIFT)

/*
 * CK1BD (R/W)
 *
 * CK1 Bit Delay: Delay select for the BDL on CK1.
 */
#define DDRPHY_ACBDLR_CK1BD_MASK (0xFC0U)
#define DDRPHY_ACBDLR_CK1BD_SHIFT (6U)
#define DDRPHY_ACBDLR_CK1BD_SET(x) (((uint32_t)(x) << DDRPHY_ACBDLR_CK1BD_SHIFT) & DDRPHY_ACBDLR_CK1BD_MASK)
#define DDRPHY_ACBDLR_CK1BD_GET(x) (((uint32_t)(x) & DDRPHY_ACBDLR_CK1BD_MASK) >> DDRPHY_ACBDLR_CK1BD_SHIFT)

/*
 * CK0BD (R/W)
 *
 * CK0 Bit Delay: Delay select for the BDL on CK0.
 */
#define DDRPHY_ACBDLR_CK0BD_MASK (0x3FU)
#define DDRPHY_ACBDLR_CK0BD_SHIFT (0U)
#define DDRPHY_ACBDLR_CK0BD_SET(x) (((uint32_t)(x) << DDRPHY_ACBDLR_CK0BD_SHIFT) & DDRPHY_ACBDLR_CK0BD_MASK)
#define DDRPHY_ACBDLR_CK0BD_GET(x) (((uint32_t)(x) & DDRPHY_ACBDLR_CK0BD_MASK) >> DDRPHY_ACBDLR_CK0BD_SHIFT)

/* Bitfield definition for register: ACIOCR */
/*
 * ACSR (R/W)
 *
 * Address/Command Slew Rate (D3F I/O Only): Selects slew rate of the I/O for all address and command pins.
 */
#define DDRPHY_ACIOCR_ACSR_MASK (0xC0000000UL)
#define DDRPHY_ACIOCR_ACSR_SHIFT (30U)
#define DDRPHY_ACIOCR_ACSR_SET(x) (((uint32_t)(x) << DDRPHY_ACIOCR_ACSR_SHIFT) & DDRPHY_ACIOCR_ACSR_MASK)
#define DDRPHY_ACIOCR_ACSR_GET(x) (((uint32_t)(x) & DDRPHY_ACIOCR_ACSR_MASK) >> DDRPHY_ACIOCR_ACSR_SHIFT)

/*
 * RSTIOM (R/W)
 *
 * SDRAM Reset I/O Mode: Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for SDRAM Reset.
 */
#define DDRPHY_ACIOCR_RSTIOM_MASK (0x20000000UL)
#define DDRPHY_ACIOCR_RSTIOM_SHIFT (29U)
#define DDRPHY_ACIOCR_RSTIOM_SET(x) (((uint32_t)(x) << DDRPHY_ACIOCR_RSTIOM_SHIFT) & DDRPHY_ACIOCR_RSTIOM_MASK)
#define DDRPHY_ACIOCR_RSTIOM_GET(x) (((uint32_t)(x) & DDRPHY_ACIOCR_RSTIOM_MASK) >> DDRPHY_ACIOCR_RSTIOM_SHIFT)

/*
 * RSTPDR (R/W)
 *
 * SDRAM Reset Power Down Receiver: Powers down, when set, the input receiver on the I/O for SDRAM RST# pin.
 */
#define DDRPHY_ACIOCR_RSTPDR_MASK (0x10000000UL)
#define DDRPHY_ACIOCR_RSTPDR_SHIFT (28U)
#define DDRPHY_ACIOCR_RSTPDR_SET(x) (((uint32_t)(x) << DDRPHY_ACIOCR_RSTPDR_SHIFT) & DDRPHY_ACIOCR_RSTPDR_MASK)
#define DDRPHY_ACIOCR_RSTPDR_GET(x) (((uint32_t)(x) & DDRPHY_ACIOCR_RSTPDR_MASK) >> DDRPHY_ACIOCR_RSTPDR_SHIFT)

/*
 * RSTPDD1 (R/W)
 *
 * SDRAM Reset Power Down Driver: Powers down, when set, the output driver on the I/O for SDRAM RST# pin.
 */
#define DDRPHY_ACIOCR_RSTPDD1_MASK (0x8000000UL)
#define DDRPHY_ACIOCR_RSTPDD1_SHIFT (27U)
#define DDRPHY_ACIOCR_RSTPDD1_SET(x) (((uint32_t)(x) << DDRPHY_ACIOCR_RSTPDD1_SHIFT) & DDRPHY_ACIOCR_RSTPDD1_MASK)
#define DDRPHY_ACIOCR_RSTPDD1_GET(x) (((uint32_t)(x) & DDRPHY_ACIOCR_RSTPDD1_MASK) >> DDRPHY_ACIOCR_RSTPDD1_SHIFT)

/*
 * RSTODT (R/W)
 *
 * SDRAM Reset On-Die Termination: Enables, when set, the on-die termination on the I/O for SDRAM RST# pin.
 */
#define DDRPHY_ACIOCR_RSTODT_MASK (0x4000000UL)
#define DDRPHY_ACIOCR_RSTODT_SHIFT (26U)
#define DDRPHY_ACIOCR_RSTODT_SET(x) (((uint32_t)(x) << DDRPHY_ACIOCR_RSTODT_SHIFT) & DDRPHY_ACIOCR_RSTODT_MASK)
#define DDRPHY_ACIOCR_RSTODT_GET(x) (((uint32_t)(x) & DDRPHY_ACIOCR_RSTODT_MASK) >> DDRPHY_ACIOCR_RSTODT_SHIFT)

/*
 * RANKPDR (R/W)
 *
 * Rank Power Down Receiver: Powers down, when set, the input receiver on the I/O CKE[3:0], ODT[3:0], and CS#[3:0] pins. RANKPDR[0] controls the power down for CKE[0], ODT[0], and CS#[0], RANKPDR[1] controls the power down for CKE[1], ODT[1], and CS#[1], and so on.
 */
#define DDRPHY_ACIOCR_RANKPDR_MASK (0x3C00000UL)
#define DDRPHY_ACIOCR_RANKPDR_SHIFT (22U)
#define DDRPHY_ACIOCR_RANKPDR_SET(x) (((uint32_t)(x) << DDRPHY_ACIOCR_RANKPDR_SHIFT) & DDRPHY_ACIOCR_RANKPDR_MASK)
#define DDRPHY_ACIOCR_RANKPDR_GET(x) (((uint32_t)(x) & DDRPHY_ACIOCR_RANKPDR_MASK) >> DDRPHY_ACIOCR_RANKPDR_SHIFT)

