RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DXIOM (R/W)
 *
 * Data I/O Mode: Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for DQ, DM, and DQS/DQS# pins of all DATX8 macros. This bit is ORed with the IOM configuration bit of the individual DATX8.
 */
#define DDRPHY_DXCCR_DXIOM_MASK (0x2U)
#define DDRPHY_DXCCR_DXIOM_SHIFT (1U)
#define DDRPHY_DXCCR_DXIOM_SET(x) (((uint32_t)(x) << DDRPHY_DXCCR_DXIOM_SHIFT) & DDRPHY_DXCCR_DXIOM_MASK)
#define DDRPHY_DXCCR_DXIOM_GET(x) (((uint32_t)(x) & DDRPHY_DXCCR_DXIOM_MASK) >> DDRPHY_DXCCR_DXIOM_SHIFT)

/*
 * DXODT (R/W)
 *
 * Data On-Die Termination: Enables, when set, the on-die termination on the I/O for DQ, DM, and DQS/DQS# pins of all DATX8 macros. This bit is ORed with the ODT configuration bit of the individual DATX8 (“DATX8 General Configuration Register (DXnGCR)” on page 148)
 */
#define DDRPHY_DXCCR_DXODT_MASK (0x1U)
#define DDRPHY_DXCCR_DXODT_SHIFT (0U)
#define DDRPHY_DXCCR_DXODT_SET(x) (((uint32_t)(x) << DDRPHY_DXCCR_DXODT_SHIFT) & DDRPHY_DXCCR_DXODT_MASK)
#define DDRPHY_DXCCR_DXODT_GET(x) (((uint32_t)(x) & DDRPHY_DXCCR_DXODT_MASK) >> DDRPHY_DXCCR_DXODT_SHIFT)

/* Bitfield definition for register: DSGCR */
/*
 * CKEOE (R/W)
 *
 * SDRAM CKE Output Enable: Enables, when set, the output driver on the I/O for SDRAM CKE pins.
 */
#define DDRPHY_DSGCR_CKEOE_MASK (0x80000000UL)
#define DDRPHY_DSGCR_CKEOE_SHIFT (31U)
#define DDRPHY_DSGCR_CKEOE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_CKEOE_SHIFT) & DDRPHY_DSGCR_CKEOE_MASK)
#define DDRPHY_DSGCR_CKEOE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_CKEOE_MASK) >> DDRPHY_DSGCR_CKEOE_SHIFT)

/*
 * RSTOE (R/W)
 *
 * SDRAM Reset Output Enable: Enables, when set, the output driver on the I/O for SDRAM RST# pin.
 */
#define DDRPHY_DSGCR_RSTOE_MASK (0x40000000UL)
#define DDRPHY_DSGCR_RSTOE_SHIFT (30U)
#define DDRPHY_DSGCR_RSTOE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_RSTOE_SHIFT) & DDRPHY_DSGCR_RSTOE_MASK)
#define DDRPHY_DSGCR_RSTOE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_RSTOE_MASK) >> DDRPHY_DSGCR_RSTOE_SHIFT)

/*
 * ODTOE (R/W)
 *
 * SDRAM ODT Output Enable: Enables, when set, the output driver on the I/O for SDRAM ODT pins.
 */
#define DDRPHY_DSGCR_ODTOE_MASK (0x20000000UL)
#define DDRPHY_DSGCR_ODTOE_SHIFT (29U)
#define DDRPHY_DSGCR_ODTOE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_ODTOE_SHIFT) & DDRPHY_DSGCR_ODTOE_MASK)
#define DDRPHY_DSGCR_ODTOE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_ODTOE_MASK) >> DDRPHY_DSGCR_ODTOE_SHIFT)

/*
 * CKOE (R/W)
 *
 * SDRAM CK Output Enable: Enables, when set, the output driver on the I/O for SDRAM CK/CK# pins.
 */
#define DDRPHY_DSGCR_CKOE_MASK (0x10000000UL)
#define DDRPHY_DSGCR_CKOE_SHIFT (28U)
#define DDRPHY_DSGCR_CKOE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_CKOE_SHIFT) & DDRPHY_DSGCR_CKOE_MASK)
#define DDRPHY_DSGCR_CKOE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_CKOE_MASK) >> DDRPHY_DSGCR_CKOE_SHIFT)

/*
 * ODTPDD1 (R/W)
 *
 * ODT Power Down Driver: Powers down, when set, the output driver on the I/O for ODT[3:0] pins. ODTPDD[0] controls the power down for ODT[0], ODTPDD[1] controls the power down for ODT[1], and so on.
 */
#define DDRPHY_DSGCR_ODTPDD1_MASK (0xF000000UL)
#define DDRPHY_DSGCR_ODTPDD1_SHIFT (24U)
#define DDRPHY_DSGCR_ODTPDD1_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_ODTPDD1_SHIFT) & DDRPHY_DSGCR_ODTPDD1_MASK)
#define DDRPHY_DSGCR_ODTPDD1_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_ODTPDD1_MASK) >> DDRPHY_DSGCR_ODTPDD1_SHIFT)

/*
 * CKEPDD1 (R/W)
 *
 * CKE Power Down Driver: Powers down, when set, the output driver on the I/O for CKE[3:0] pins. CKEPDD[0] controls the power down for CKE[0], CKEPDD[1] controls the power down for CKE[1], and so on.
 */
#define DDRPHY_DSGCR_CKEPDD1_MASK (0xF00000UL)
#define DDRPHY_DSGCR_CKEPDD1_SHIFT (20U)
#define DDRPHY_DSGCR_CKEPDD1_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_CKEPDD1_SHIFT) & DDRPHY_DSGCR_CKEPDD1_MASK)
#define DDRPHY_DSGCR_CKEPDD1_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_CKEPDD1_MASK) >> DDRPHY_DSGCR_CKEPDD1_SHIFT)

/*
 * SDRMODE (R/W)
 *
 * Single Data Rate Mode: Indicates, if set, that the external controller is configured to run in single data rate (SDR) mode. Otherwise if not set the controller is running in half data rate (HDR) mode. This bit not supported in the current version of the PUB.
 */
#define DDRPHY_DSGCR_SDRMODE_MASK (0x80000UL)
#define DDRPHY_DSGCR_SDRMODE_SHIFT (19U)
#define DDRPHY_DSGCR_SDRMODE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_SDRMODE_SHIFT) & DDRPHY_DSGCR_SDRMODE_MASK)
#define DDRPHY_DSGCR_SDRMODE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_SDRMODE_MASK) >> DDRPHY_DSGCR_SDRMODE_SHIFT)

/*
 * RRMODE (R/W)
 *
 * Rise-to-Rise Mode: Indicates, if set, that the PHY mission mode is configured to run in rise-to-rise mode. Otherwise if not set the PHY mission mode is running in rise-to- fall mode.
 */
#define DDRPHY_DSGCR_RRMODE_MASK (0x40000UL)
#define DDRPHY_DSGCR_RRMODE_SHIFT (18U)
#define DDRPHY_DSGCR_RRMODE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_RRMODE_SHIFT) & DDRPHY_DSGCR_RRMODE_MASK)
#define DDRPHY_DSGCR_RRMODE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_RRMODE_MASK) >> DDRPHY_DSGCR_RRMODE_SHIFT)

/*
 * ATOAE (R/W)
 *
 * ATO Analog Test Enable: Enables, if set, the analog test output (ATO) I/O.
 */
#define DDRPHY_DSGCR_ATOAE_MASK (0x20000UL)
#define DDRPHY_DSGCR_ATOAE_SHIFT (17U)
#define DDRPHY_DSGCR_ATOAE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_ATOAE_SHIFT) & DDRPHY_DSGCR_ATOAE_MASK)
#define DDRPHY_DSGCR_ATOAE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_ATOAE_MASK) >> DDRPHY_DSGCR_ATOAE_SHIFT)

/*
 * DTOOE (R/W)
 *
 * DTO Output Enable: Enables, when set, the output driver on the I/O for DTO pins.
 */
#define DDRPHY_DSGCR_DTOOE_MASK (0x10000UL)
#define DDRPHY_DSGCR_DTOOE_SHIFT (16U)
#define DDRPHY_DSGCR_DTOOE_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_DTOOE_SHIFT) & DDRPHY_DSGCR_DTOOE_MASK)
#define DDRPHY_DSGCR_DTOOE_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_DTOOE_MASK) >> DDRPHY_DSGCR_DTOOE_SHIFT)

/*
 * DTOIOM (R/W)
 *
 * DTO I/O Mode: Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for DTO pins.
 */
#define DDRPHY_DSGCR_DTOIOM_MASK (0x8000U)
#define DDRPHY_DSGCR_DTOIOM_SHIFT (15U)
#define DDRPHY_DSGCR_DTOIOM_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_DTOIOM_SHIFT) & DDRPHY_DSGCR_DTOIOM_MASK)
#define DDRPHY_DSGCR_DTOIOM_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_DTOIOM_MASK) >> DDRPHY_DSGCR_DTOIOM_SHIFT)

