RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * PUREN (R/W)
 *
 * PHY Update Request Enable: Specifies if set, that the PHY should issue PHY- initiated update request when there is DDL VT drift.
 */
#define DDRPHY_DSGCR_PUREN_MASK (0x1U)
#define DDRPHY_DSGCR_PUREN_SHIFT (0U)
#define DDRPHY_DSGCR_PUREN_SET(x) (((uint32_t)(x) << DDRPHY_DSGCR_PUREN_SHIFT) & DDRPHY_DSGCR_PUREN_MASK)
#define DDRPHY_DSGCR_PUREN_GET(x) (((uint32_t)(x) & DDRPHY_DSGCR_PUREN_MASK) >> DDRPHY_DSGCR_PUREN_SHIFT)

/* Bitfield definition for register: DCR */
/*
 * UDIMM (R/W)
 *
 * Un-buffered DIMM Address Mirroring: Indicates, if set, that there is address mirroring on the second rank of an un-buffered DIMM (the rank connected to CS#[1]). In this case, the PUB re-scrambles the bank and address when sending mode register commands to the second rank. This only applies to PUB internal SDRAM transactions. Transactions generated by the controller must make its own adjustments when using an un-buffered DIMM. DCR[NOSRA] must be set if address mirroring is enabled.
 */
#define DDRPHY_DCR_UDIMM_MASK (0x20000000UL)
#define DDRPHY_DCR_UDIMM_SHIFT (29U)
#define DDRPHY_DCR_UDIMM_SET(x) (((uint32_t)(x) << DDRPHY_DCR_UDIMM_SHIFT) & DDRPHY_DCR_UDIMM_MASK)
#define DDRPHY_DCR_UDIMM_GET(x) (((uint32_t)(x) & DDRPHY_DCR_UDIMM_MASK) >> DDRPHY_DCR_UDIMM_SHIFT)

/*
 * DDR2T (R/W)
 *
 * DDR 2T Timing: Indicates, if set, that 2T timing should be used by PUB internally generated SDRAM transactions.
 */
#define DDRPHY_DCR_DDR2T_MASK (0x10000000UL)
#define DDRPHY_DCR_DDR2T_SHIFT (28U)
#define DDRPHY_DCR_DDR2T_SET(x) (((uint32_t)(x) << DDRPHY_DCR_DDR2T_SHIFT) & DDRPHY_DCR_DDR2T_MASK)
#define DDRPHY_DCR_DDR2T_GET(x) (((uint32_t)(x) & DDRPHY_DCR_DDR2T_MASK) >> DDRPHY_DCR_DDR2T_SHIFT)

/*
 * NOSRA (R/W)
 *
 * No Simultaneous Rank Access: Specifies, if set, that simultaneous rank access on the same clock cycle is not allowed. This means that multiple chip select signals should not be asserted at the same time. This may be required on some DIMM systems.
 */
#define DDRPHY_DCR_NOSRA_MASK (0x8000000UL)
#define DDRPHY_DCR_NOSRA_SHIFT (27U)
#define DDRPHY_DCR_NOSRA_SET(x) (((uint32_t)(x) << DDRPHY_DCR_NOSRA_SHIFT) & DDRPHY_DCR_NOSRA_MASK)
#define DDRPHY_DCR_NOSRA_GET(x) (((uint32_t)(x) & DDRPHY_DCR_NOSRA_MASK) >> DDRPHY_DCR_NOSRA_SHIFT)

/*
 * BYTEMASK (R/W)
 *
 * Byte Mask: Mask applied to all beats of read data on all bytes lanes during read DQS gate training. This allows training to be conducted based on selected bit(s) from the byte lanes.
 * Valid values for each bit are:
 * 0 = Disable compare for that bit 1 = Enable compare for that bit
 * Note that this mask applies in DDR3 MPR operation mode as well and must be in keeping with the PDQ field setting.
 */
#define DDRPHY_DCR_BYTEMASK_MASK (0x3FC00UL)
#define DDRPHY_DCR_BYTEMASK_SHIFT (10U)
#define DDRPHY_DCR_BYTEMASK_SET(x) (((uint32_t)(x) << DDRPHY_DCR_BYTEMASK_SHIFT) & DDRPHY_DCR_BYTEMASK_MASK)
#define DDRPHY_DCR_BYTEMASK_GET(x) (((uint32_t)(x) & DDRPHY_DCR_BYTEMASK_MASK) >> DDRPHY_DCR_BYTEMASK_SHIFT)

/*
 * MPRDQ (R/W)
 *
 * Multi-Purpose Register (MPR) DQ (DDR3 Only): Specifies the value that is driven on non-primary DQ pins during MPR reads. Valid values are:
 * 0 = Primary DQ drives out the data from MPR (0-1-0-1); non-primary DQs drive ‘0’ 1 = Primary DQ and non-primary DQs all drive the same data from MPR (0-1-0-1)
 */
#define DDRPHY_DCR_MPRDQ_MASK (0x80U)
#define DDRPHY_DCR_MPRDQ_SHIFT (7U)
#define DDRPHY_DCR_MPRDQ_SET(x) (((uint32_t)(x) << DDRPHY_DCR_MPRDQ_SHIFT) & DDRPHY_DCR_MPRDQ_MASK)
#define DDRPHY_DCR_MPRDQ_GET(x) (((uint32_t)(x) & DDRPHY_DCR_MPRDQ_MASK) >> DDRPHY_DCR_MPRDQ_SHIFT)

/*
 * PDQ (R/W)
 *
 * Primary DQ (DDR3 Only): Specifies the DQ pin in a byte that is designated as a primary pin for Multi-Purpose Register (MPR) reads. Valid values are 0 to 7 for DQ[0] to DQ[7], respectively.
 */
#define DDRPHY_DCR_PDQ_MASK (0x70U)
#define DDRPHY_DCR_PDQ_SHIFT (4U)
#define DDRPHY_DCR_PDQ_SET(x) (((uint32_t)(x) << DDRPHY_DCR_PDQ_SHIFT) & DDRPHY_DCR_PDQ_MASK)
#define DDRPHY_DCR_PDQ_GET(x) (((uint32_t)(x) & DDRPHY_DCR_PDQ_MASK) >> DDRPHY_DCR_PDQ_SHIFT)

/*
 * DDR8BNK (R/W)
 *
 * DDR 8-Bank: Indicates, if set, that the SDRAM used has 8 banks. tRPA = tRP+1 and tFAW are used for 8-bank DRAMs, otherwise tRPA = tRP and no tFAW is used.
 * Note that a setting of 1 for DRAMs that have fewer than 8 banks results in correct functionality, but less tight DRAM command spacing for the parameters.
 */
#define DDRPHY_DCR_DDR8BNK_MASK (0x8U)
#define DDRPHY_DCR_DDR8BNK_SHIFT (3U)
#define DDRPHY_DCR_DDR8BNK_SET(x) (((uint32_t)(x) << DDRPHY_DCR_DDR8BNK_SHIFT) & DDRPHY_DCR_DDR8BNK_MASK)
#define DDRPHY_DCR_DDR8BNK_GET(x) (((uint32_t)(x) & DDRPHY_DCR_DDR8BNK_MASK) >> DDRPHY_DCR_DDR8BNK_SHIFT)

/*
 * DDRMD (R/W)
 *
 * DDR Mode: SDRAM DDR mode. Valid values are: 000 = Reserved
 * 001 = Reserved
 * 010 = DDR2
 * 011 = DDR3
 * 100 – 111 = Reserved
 */
#define DDRPHY_DCR_DDRMD_MASK (0x7U)
#define DDRPHY_DCR_DDRMD_SHIFT (0U)
#define DDRPHY_DCR_DDRMD_SET(x) (((uint32_t)(x) << DDRPHY_DCR_DDRMD_SHIFT) & DDRPHY_DCR_DDRMD_MASK)
#define DDRPHY_DCR_DDRMD_GET(x) (((uint32_t)(x) & DDRPHY_DCR_DDRMD_MASK) >> DDRPHY_DCR_DDRMD_SHIFT)

/* Bitfield definition for register: DTPR0 */
/*
 * TRC (R/W)
 *
 * Activate to activate command delay (same bank). Valid values are 2 to 63.
 */
#define DDRPHY_DTPR0_TRC_MASK (0xFC000000UL)
#define DDRPHY_DTPR0_TRC_SHIFT (26U)
#define DDRPHY_DTPR0_TRC_SET(x) (((uint32_t)(x) << DDRPHY_DTPR0_TRC_SHIFT) & DDRPHY_DTPR0_TRC_MASK)
#define DDRPHY_DTPR0_TRC_GET(x) (((uint32_t)(x) & DDRPHY_DTPR0_TRC_MASK) >> DDRPHY_DTPR0_TRC_SHIFT)

/*
 * TRRD (R/W)
 *
 * Activate to activate command delay (different banks). Valid values are 1 to 15.
 */
#define DDRPHY_DTPR0_TRRD_MASK (0x3C00000UL)
#define DDRPHY_DTPR0_TRRD_SHIFT (22U)
#define DDRPHY_DTPR0_TRRD_SET(x) (((uint32_t)(x) << DDRPHY_DTPR0_TRRD_SHIFT) & DDRPHY_DTPR0_TRRD_MASK)
#define DDRPHY_DTPR0_TRRD_GET(x) (((uint32_t)(x) & DDRPHY_DTPR0_TRRD_MASK) >> DDRPHY_DTPR0_TRRD_SHIFT)

/*
 * TRAS (R/W)
 *
 * Activate to precharge command delay. Valid values are 2 to 63.
 */
#define DDRPHY_DTPR0_TRAS_MASK (0x3F0000UL)
#define DDRPHY_DTPR0_TRAS_SHIFT (16U)
#define DDRPHY_DTPR0_TRAS_SET(x) (((uint32_t)(x) << DDRPHY_DTPR0_TRAS_SHIFT) & DDRPHY_DTPR0_TRAS_MASK)
#define DDRPHY_DTPR0_TRAS_GET(x) (((uint32_t)(x) & DDRPHY_DTPR0_TRAS_MASK) >> DDRPHY_DTPR0_TRAS_SHIFT)

