RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * TRCD (R/W)
 *
 * Activate to read or write delay. Minimum time from when an activate command is issued to when a read or write to the activated row can be issued. Valid values are 2 to 15.
 */
#define DDRPHY_DTPR0_TRCD_MASK (0xF000U)
#define DDRPHY_DTPR0_TRCD_SHIFT (12U)
#define DDRPHY_DTPR0_TRCD_SET(x) (((uint32_t)(x) << DDRPHY_DTPR0_TRCD_SHIFT) & DDRPHY_DTPR0_TRCD_MASK)
#define DDRPHY_DTPR0_TRCD_GET(x) (((uint32_t)(x) & DDRPHY_DTPR0_TRCD_MASK) >> DDRPHY_DTPR0_TRCD_SHIFT)

/*
 * TRP (R/W)
 *
 * Precharge command period: The minimum time between a precharge command and any other command. Note that the Controller automatically derives tRPA for 8- bank DDR2 devices by adding 1 to tRP. Valid values are 2 to 15.
 */
#define DDRPHY_DTPR0_TRP_MASK (0xF00U)
#define DDRPHY_DTPR0_TRP_SHIFT (8U)
#define DDRPHY_DTPR0_TRP_SET(x) (((uint32_t)(x) << DDRPHY_DTPR0_TRP_SHIFT) & DDRPHY_DTPR0_TRP_MASK)
#define DDRPHY_DTPR0_TRP_GET(x) (((uint32_t)(x) & DDRPHY_DTPR0_TRP_MASK) >> DDRPHY_DTPR0_TRP_SHIFT)

/*
 * TWTR (R/W)
 *
 * Internal write to read command delay. Valid values are 1 to 15.
 */
#define DDRPHY_DTPR0_TWTR_MASK (0xF0U)
#define DDRPHY_DTPR0_TWTR_SHIFT (4U)
#define DDRPHY_DTPR0_TWTR_SET(x) (((uint32_t)(x) << DDRPHY_DTPR0_TWTR_SHIFT) & DDRPHY_DTPR0_TWTR_MASK)
#define DDRPHY_DTPR0_TWTR_GET(x) (((uint32_t)(x) & DDRPHY_DTPR0_TWTR_MASK) >> DDRPHY_DTPR0_TWTR_SHIFT)

/*
 * TRTP (R/W)
 *
 * Internal read to precharge command delay. Valid values are 2 to 15.
 */
#define DDRPHY_DTPR0_TRTP_MASK (0xFU)
#define DDRPHY_DTPR0_TRTP_SHIFT (0U)
#define DDRPHY_DTPR0_TRTP_SET(x) (((uint32_t)(x) << DDRPHY_DTPR0_TRTP_SHIFT) & DDRPHY_DTPR0_TRTP_MASK)
#define DDRPHY_DTPR0_TRTP_GET(x) (((uint32_t)(x) & DDRPHY_DTPR0_TRTP_MASK) >> DDRPHY_DTPR0_TRTP_SHIFT)

/* Bitfield definition for register: DTPR1 */
/*
 * TAOND_TAOFD (R/W)
 *
 * ODT turn-on/turn-off delays (DDR2 only). Valid values are: 00 = 2/2.5
 * 01 = 3/3.5
 * 10 = 4/4.5
 * 11 = 5/5.5
 * Most DDR2 devices utilize a fixed value of 2/2.5. For non-standard SDRAMs, the user must ensure that the operational Write Latency is always greater than or equal to the ODT turn-on delay. For example, a DDR2 SDRAM with CAS latency set to 3 and CAS additive latency set to 0 has a Write Latency of 2. Thus 2/2.5 can be used, but not 3/3.5 or higher.
 */
#define DDRPHY_DTPR1_TAOND_TAOFD_MASK (0xC0000000UL)
#define DDRPHY_DTPR1_TAOND_TAOFD_SHIFT (30U)
#define DDRPHY_DTPR1_TAOND_TAOFD_SET(x) (((uint32_t)(x) << DDRPHY_DTPR1_TAOND_TAOFD_SHIFT) & DDRPHY_DTPR1_TAOND_TAOFD_MASK)
#define DDRPHY_DTPR1_TAOND_TAOFD_GET(x) (((uint32_t)(x) & DDRPHY_DTPR1_TAOND_TAOFD_MASK) >> DDRPHY_DTPR1_TAOND_TAOFD_SHIFT)

/*
 * TWLO (R/W)
 *
 * Write leveling output delay: Number of clock cycles from when write leveling DQS is driven high by the control block to when the results from the SDRAM on DQ is sampled by the control block. This must include the SDRAM tWLO timing parameter plus the round trip delay from control block to SDRAM back to control block.
 */
#define DDRPHY_DTPR1_TWLO_MASK (0x3C000000UL)
#define DDRPHY_DTPR1_TWLO_SHIFT (26U)
#define DDRPHY_DTPR1_TWLO_SET(x) (((uint32_t)(x) << DDRPHY_DTPR1_TWLO_SHIFT) & DDRPHY_DTPR1_TWLO_MASK)
#define DDRPHY_DTPR1_TWLO_GET(x) (((uint32_t)(x) & DDRPHY_DTPR1_TWLO_MASK) >> DDRPHY_DTPR1_TWLO_SHIFT)

/*
 * TWLMRD (R/W)
 *
 * Minimum delay from when write leveling mode is programmed to the first DQS/DQS# rising edge.
 */
#define DDRPHY_DTPR1_TWLMRD_MASK (0x3F00000UL)
#define DDRPHY_DTPR1_TWLMRD_SHIFT (20U)
#define DDRPHY_DTPR1_TWLMRD_SET(x) (((uint32_t)(x) << DDRPHY_DTPR1_TWLMRD_SHIFT) & DDRPHY_DTPR1_TWLMRD_MASK)
#define DDRPHY_DTPR1_TWLMRD_GET(x) (((uint32_t)(x) & DDRPHY_DTPR1_TWLMRD_MASK) >> DDRPHY_DTPR1_TWLMRD_SHIFT)

/*
 * TRFC (R/W)
 *
 * Refresh-to-Refresh: Indicates the minimum time between two refresh commands or between a refresh and an active command. This is derived from the minimum refresh interval from the datasheet, tRFC(min), divided by the clock cycle time. The default number of clock cycles is for the largest JEDEC tRFC(min parameter value supported.
 */
#define DDRPHY_DTPR1_TRFC_MASK (0xFF800UL)
#define DDRPHY_DTPR1_TRFC_SHIFT (11U)
#define DDRPHY_DTPR1_TRFC_SET(x) (((uint32_t)(x) << DDRPHY_DTPR1_TRFC_SHIFT) & DDRPHY_DTPR1_TRFC_MASK)
#define DDRPHY_DTPR1_TRFC_GET(x) (((uint32_t)(x) & DDRPHY_DTPR1_TRFC_MASK) >> DDRPHY_DTPR1_TRFC_SHIFT)

/*
 * TFAW (R/W)
 *
 * 4-bank activate period. No more than 4-bank activate commands may be issued in a given tFAW period. Only applies to 8-bank devices. Valid values are 2 to 63.
 */
#define DDRPHY_DTPR1_TFAW_MASK (0x7E0U)
#define DDRPHY_DTPR1_TFAW_SHIFT (5U)
#define DDRPHY_DTPR1_TFAW_SET(x) (((uint32_t)(x) << DDRPHY_DTPR1_TFAW_SHIFT) & DDRPHY_DTPR1_TFAW_MASK)
#define DDRPHY_DTPR1_TFAW_GET(x) (((uint32_t)(x) & DDRPHY_DTPR1_TFAW_MASK) >> DDRPHY_DTPR1_TFAW_SHIFT)

/*
 * TMOD (R/W)
 *
 * Load mode update delay (DDR3 only). The minimum time between a load mode register command and a non-load mode register command. Valid values are: 000 = 12
 * 001 = 13
 * 010 = 14
 * 011 = 15
 * 100 = 16
 * 101 = 17
 * 110 – 111 = Reserved
 */
#define DDRPHY_DTPR1_TMOD_MASK (0x1CU)
#define DDRPHY_DTPR1_TMOD_SHIFT (2U)
#define DDRPHY_DTPR1_TMOD_SET(x) (((uint32_t)(x) << DDRPHY_DTPR1_TMOD_SHIFT) & DDRPHY_DTPR1_TMOD_MASK)
#define DDRPHY_DTPR1_TMOD_GET(x) (((uint32_t)(x) & DDRPHY_DTPR1_TMOD_MASK) >> DDRPHY_DTPR1_TMOD_SHIFT)

/*
 * TMRD (R/W)
 *
 * Load mode cycle time: The minimum time between a load mode register command and any other command. For DDR3 this is the minimum time between two load mode register commands. Valid values for DDR2 are 2 to 3. For DDR3, the value used for tMRD is 4 plus the value programmed in these bits, i.e. tMRD value for DDR3 ranges from 4 to 7.
 */
#define DDRPHY_DTPR1_TMRD_MASK (0x3U)
#define DDRPHY_DTPR1_TMRD_SHIFT (0U)
#define DDRPHY_DTPR1_TMRD_SET(x) (((uint32_t)(x) << DDRPHY_DTPR1_TMRD_SHIFT) & DDRPHY_DTPR1_TMRD_MASK)
#define DDRPHY_DTPR1_TMRD_GET(x) (((uint32_t)(x) & DDRPHY_DTPR1_TMRD_MASK) >> DDRPHY_DTPR1_TMRD_SHIFT)

/* Bitfield definition for register: DTPR2 */
/*
 * TCCD (R/W)
 *
 * Read to read and write to write command delay. Valid values are: 0 = BL/2 for DDR2 and 4 for DDR3
 * 1 = BL/2 + 1 for DDR2 and 5 for DDR3
 */
#define DDRPHY_DTPR2_TCCD_MASK (0x80000000UL)
#define DDRPHY_DTPR2_TCCD_SHIFT (31U)
#define DDRPHY_DTPR2_TCCD_SET(x) (((uint32_t)(x) << DDRPHY_DTPR2_TCCD_SHIFT) & DDRPHY_DTPR2_TCCD_MASK)
#define DDRPHY_DTPR2_TCCD_GET(x) (((uint32_t)(x) & DDRPHY_DTPR2_TCCD_MASK) >> DDRPHY_DTPR2_TCCD_SHIFT)

