RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * TRTW (R/W)
 *
 * Read to Write command delay. Valid values are:
 * 0 = standard bus turn around delay
 * 1 = add 1 clock to standard bus turn around delay
 * This parameter allows the user to increase the delay between issuing Write commands to the SDRAM when preceded by Read commands. This provides an option to increase bus turn-around margin for high frequency systems.
 */
#define DDRPHY_DTPR2_TRTW_MASK (0x40000000UL)
#define DDRPHY_DTPR2_TRTW_SHIFT (30U)
#define DDRPHY_DTPR2_TRTW_SET(x) (((uint32_t)(x) << DDRPHY_DTPR2_TRTW_SHIFT) & DDRPHY_DTPR2_TRTW_MASK)
#define DDRPHY_DTPR2_TRTW_GET(x) (((uint32_t)(x) & DDRPHY_DTPR2_TRTW_MASK) >> DDRPHY_DTPR2_TRTW_SHIFT)

/*
 * TRTODT (R/W)
 *
 * Read to ODT delay (DDR3 only). Specifies whether ODT can be enabled immediately after the read post-amble or one clock delay has to be added. Valid values are:
 * 0 = ODT may be turned on immediately after read post-amble
 * 1 = ODT may not be turned on until one clock after the read post-amble
 * If tRTODT is set to 1, then the read-to-write latency is increased by 1 if ODT is enabled.
 */
#define DDRPHY_DTPR2_TRTODT_MASK (0x20000000UL)
#define DDRPHY_DTPR2_TRTODT_SHIFT (29U)
#define DDRPHY_DTPR2_TRTODT_SET(x) (((uint32_t)(x) << DDRPHY_DTPR2_TRTODT_SHIFT) & DDRPHY_DTPR2_TRTODT_MASK)
#define DDRPHY_DTPR2_TRTODT_GET(x) (((uint32_t)(x) & DDRPHY_DTPR2_TRTODT_MASK) >> DDRPHY_DTPR2_TRTODT_SHIFT)

/*
 * TDLLK (R/W)
 *
 * DLL locking time. Valid values are 2 to 1023.
 */
#define DDRPHY_DTPR2_TDLLK_MASK (0x1FF80000UL)
#define DDRPHY_DTPR2_TDLLK_SHIFT (19U)
#define DDRPHY_DTPR2_TDLLK_SET(x) (((uint32_t)(x) << DDRPHY_DTPR2_TDLLK_SHIFT) & DDRPHY_DTPR2_TDLLK_MASK)
#define DDRPHY_DTPR2_TDLLK_GET(x) (((uint32_t)(x) & DDRPHY_DTPR2_TDLLK_MASK) >> DDRPHY_DTPR2_TDLLK_SHIFT)

/*
 * TCKE (R/W)
 *
 * CKE minimum pulse width. Also specifies the minimum time that the SDRAM must remain in power down or self refresh mode. For DDR3 this parameter must be set to the value of tCKESR which is usually bigger than the value of tCKE. Valid values are 2 to 15.
 */
#define DDRPHY_DTPR2_TCKE_MASK (0x78000UL)
#define DDRPHY_DTPR2_TCKE_SHIFT (15U)
#define DDRPHY_DTPR2_TCKE_SET(x) (((uint32_t)(x) << DDRPHY_DTPR2_TCKE_SHIFT) & DDRPHY_DTPR2_TCKE_MASK)
#define DDRPHY_DTPR2_TCKE_GET(x) (((uint32_t)(x) & DDRPHY_DTPR2_TCKE_MASK) >> DDRPHY_DTPR2_TCKE_SHIFT)

/*
 * TXP (R/W)
 *
 * Power down exit delay. The minimum time between a power down exit command and any other command. This parameter must be set to the maximum of the various minimum power down exit delay parameters specified in the SDRAM datasheet, i.e. max(tXP, tXARD, tXARDS) for DDR2 and max(tXP, tXPDLL) for DDR3. Valid values are 2 to 31.
 */
#define DDRPHY_DTPR2_TXP_MASK (0x7C00U)
#define DDRPHY_DTPR2_TXP_SHIFT (10U)
#define DDRPHY_DTPR2_TXP_SET(x) (((uint32_t)(x) << DDRPHY_DTPR2_TXP_SHIFT) & DDRPHY_DTPR2_TXP_MASK)
#define DDRPHY_DTPR2_TXP_GET(x) (((uint32_t)(x) & DDRPHY_DTPR2_TXP_MASK) >> DDRPHY_DTPR2_TXP_SHIFT)

/*
 * TXS (R/W)
 *
 * Self refresh exit delay. The minimum time between a self refresh exit command and any other command. This parameter must be set to the maximum of the various minimum self refresh exit delay parameters specified in the SDRAM datasheet, i.e. max(tXSNR, tXSRD) for DDR2 and max(tXS, tXSDLL) for DDR3. Valid values are 2 to 1023.
 */
#define DDRPHY_DTPR2_TXS_MASK (0x3FFU)
#define DDRPHY_DTPR2_TXS_SHIFT (0U)
#define DDRPHY_DTPR2_TXS_SET(x) (((uint32_t)(x) << DDRPHY_DTPR2_TXS_SHIFT) & DDRPHY_DTPR2_TXS_MASK)
#define DDRPHY_DTPR2_TXS_GET(x) (((uint32_t)(x) & DDRPHY_DTPR2_TXS_MASK) >> DDRPHY_DTPR2_TXS_SHIFT)

/* Bitfield definition for register: MR0 */
/*
 * PD (R/W)
 *
 * Power-Down Control: Controls the exit time for power-down modes. Refer to the SDRAM datasheet for details on power-down modes. Valid values are:
 * 0 = Slow exit (DLL off) 1 = Fast exit (DLL on)
 */
#define DDRPHY_MR0_PD_MASK (0x1000U)
#define DDRPHY_MR0_PD_SHIFT (12U)
#define DDRPHY_MR0_PD_SET(x) (((uint32_t)(x) << DDRPHY_MR0_PD_SHIFT) & DDRPHY_MR0_PD_MASK)
#define DDRPHY_MR0_PD_GET(x) (((uint32_t)(x) & DDRPHY_MR0_PD_MASK) >> DDRPHY_MR0_PD_SHIFT)

/*
 * WR (R/W)
 *
 * Write Recovery: This is the value of the write recovery. It is calculated by dividing the datasheet write recovery time, tWR (ns) by the datasheet clock cycle time, tCK (ns) and rounding up a non-integer value to the next integer. Valid values are:
 * 000 = 16
 * 001 = 5
 * 010 = 6
 * 011 = 7
 * 100 = 8
 * 101 = 10
 * 110 = 12
 * 111 = 14
 * All other settings are reserved and should not be used.
 * NOTE: tWR (ns) is the time from the first SDRAM positive clock edge after the last data-in pair of a write command, to when a precharge of the same bank can be issued.
 */
#define DDRPHY_MR0_WR_MASK (0xE00U)
#define DDRPHY_MR0_WR_SHIFT (9U)
#define DDRPHY_MR0_WR_SET(x) (((uint32_t)(x) << DDRPHY_MR0_WR_SHIFT) & DDRPHY_MR0_WR_MASK)
#define DDRPHY_MR0_WR_GET(x) (((uint32_t)(x) & DDRPHY_MR0_WR_MASK) >> DDRPHY_MR0_WR_SHIFT)

/*
 * DR (R/W)
 *
 * DLL Reset: Writing a ‘1’ to this bit will reset the SDRAM DLL. This bit is self- clearing, i.e. it returns back to ‘0’ after the DLL reset has been issued.
 */
#define DDRPHY_MR0_DR_MASK (0x100U)
#define DDRPHY_MR0_DR_SHIFT (8U)
#define DDRPHY_MR0_DR_SET(x) (((uint32_t)(x) << DDRPHY_MR0_DR_SHIFT) & DDRPHY_MR0_DR_MASK)
#define DDRPHY_MR0_DR_GET(x) (((uint32_t)(x) & DDRPHY_MR0_DR_MASK) >> DDRPHY_MR0_DR_SHIFT)

/*
 * TM (R/W)
 *
 * Operating Mode: Selects either normal operating mode (0) or test mode (1). Test mode is reserved for the manufacturer and should not be used.
 */
#define DDRPHY_MR0_TM_MASK (0x80U)
#define DDRPHY_MR0_TM_SHIFT (7U)
#define DDRPHY_MR0_TM_SET(x) (((uint32_t)(x) << DDRPHY_MR0_TM_SHIFT) & DDRPHY_MR0_TM_MASK)
#define DDRPHY_MR0_TM_GET(x) (((uint32_t)(x) & DDRPHY_MR0_TM_MASK) >> DDRPHY_MR0_TM_SHIFT)

/*
 * CLH (R/W)
 *
 * CAS Latency: The delay between when the SDRAM registers a read command to when data is available. Valid values are:
 * 0010 = 5
 * 0100 = 6
 * 0110 = 7
 * 1000 = 8
 * 1010 = 9
 * 1100 = 10
 * 1110 = 11
 * 0001 = 12
 * 0011 = 13
 * 0101 = 14
 * All other settings are reserved and should not be used.
 */
#define DDRPHY_MR0_CLH_MASK (0x70U)
#define DDRPHY_MR0_CLH_SHIFT (4U)
#define DDRPHY_MR0_CLH_SET(x) (((uint32_t)(x) << DDRPHY_MR0_CLH_SHIFT) & DDRPHY_MR0_CLH_MASK)
#define DDRPHY_MR0_CLH_GET(x) (((uint32_t)(x) & DDRPHY_MR0_CLH_MASK) >> DDRPHY_MR0_CLH_SHIFT)

