RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * BT (R/W)
 *
 * Burst Type: Indicates whether a burst is sequential (0) or interleaved (1).
 */
#define DDRPHY_MR0_BT_MASK (0x8U)
#define DDRPHY_MR0_BT_SHIFT (3U)
#define DDRPHY_MR0_BT_SET(x) (((uint32_t)(x) << DDRPHY_MR0_BT_SHIFT) & DDRPHY_MR0_BT_MASK)
#define DDRPHY_MR0_BT_GET(x) (((uint32_t)(x) & DDRPHY_MR0_BT_MASK) >> DDRPHY_MR0_BT_SHIFT)

/*
 * CLL (R/W)
 *
 * CAS Latency low bit
 */
#define DDRPHY_MR0_CLL_MASK (0x4U)
#define DDRPHY_MR0_CLL_SHIFT (2U)
#define DDRPHY_MR0_CLL_SET(x) (((uint32_t)(x) << DDRPHY_MR0_CLL_SHIFT) & DDRPHY_MR0_CLL_MASK)
#define DDRPHY_MR0_CLL_GET(x) (((uint32_t)(x) & DDRPHY_MR0_CLL_MASK) >> DDRPHY_MR0_CLL_SHIFT)

/*
 * BL (R/W)
 *
 * Burst Length: Determines the maximum number of column locations that can be accessed during a given read or write command. Valid values are:
 * Valid values for DDR3 are: 00 = 8 (Fixed)
 * 01 = 4 or 8 (On the fly)
 * 10 = 4 (Fixed)
 * 11 = Reserved
 */
#define DDRPHY_MR0_BL_MASK (0x3U)
#define DDRPHY_MR0_BL_SHIFT (0U)
#define DDRPHY_MR0_BL_SET(x) (((uint32_t)(x) << DDRPHY_MR0_BL_SHIFT) & DDRPHY_MR0_BL_MASK)
#define DDRPHY_MR0_BL_GET(x) (((uint32_t)(x) & DDRPHY_MR0_BL_MASK) >> DDRPHY_MR0_BL_SHIFT)

/* Bitfield definition for register: MR */
/*
 * PD (R/W)
 *
 * Power-Down Control: Controls the exit time for power-down modes. Refer to the SDRAM datasheet for details on power-down modes. Valid values are:
 * 0 = Fast exit 1 = Slow exit
 */
#define DDRPHY_MR_PD_MASK (0x1000U)
#define DDRPHY_MR_PD_SHIFT (12U)
#define DDRPHY_MR_PD_SET(x) (((uint32_t)(x) << DDRPHY_MR_PD_SHIFT) & DDRPHY_MR_PD_MASK)
#define DDRPHY_MR_PD_GET(x) (((uint32_t)(x) & DDRPHY_MR_PD_MASK) >> DDRPHY_MR_PD_SHIFT)

/*
 * WR (R/W)
 *
 * Write Recovery: This is the value of the write recovery. It is calculated by dividing the datasheet write recovery time, tWR (ns) by the datasheet clock cycle time, tCK (ns) and rounding up a non-integer value to the next integer. Valid values are:
 * 001 = 2
 * 010 = 3
 * 011 = 4
 * 100 = 5
 * 101 = 6
 * All other settings are reserved and should not be used.
 * NOTE: tWR (ns) is the time from the first SDRAM positive clock edge after the last data-in pair of a write command, to when a precharge of the same bank can be issued.
 */
#define DDRPHY_MR_WR_MASK (0xE00U)
#define DDRPHY_MR_WR_SHIFT (9U)
#define DDRPHY_MR_WR_SET(x) (((uint32_t)(x) << DDRPHY_MR_WR_SHIFT) & DDRPHY_MR_WR_MASK)
#define DDRPHY_MR_WR_GET(x) (((uint32_t)(x) & DDRPHY_MR_WR_MASK) >> DDRPHY_MR_WR_SHIFT)

/*
 * DR (R/W)
 *
 * DLL Reset: Writing a ‘1’ to this bit will reset the SDRAM DLL. This bit is self- clearing, i.e. it returns back to ‘0’ after the DLL reset has been issued.
 */
#define DDRPHY_MR_DR_MASK (0x100U)
#define DDRPHY_MR_DR_SHIFT (8U)
#define DDRPHY_MR_DR_SET(x) (((uint32_t)(x) << DDRPHY_MR_DR_SHIFT) & DDRPHY_MR_DR_MASK)
#define DDRPHY_MR_DR_GET(x) (((uint32_t)(x) & DDRPHY_MR_DR_MASK) >> DDRPHY_MR_DR_SHIFT)

/*
 * TM (R/W)
 *
 * Operating Mode: Selects either normal operating mode (0) or test mode (1). Test mode is reserved for the manufacturer and should not be used.
 */
#define DDRPHY_MR_TM_MASK (0x80U)
#define DDRPHY_MR_TM_SHIFT (7U)
#define DDRPHY_MR_TM_SET(x) (((uint32_t)(x) << DDRPHY_MR_TM_SHIFT) & DDRPHY_MR_TM_MASK)
#define DDRPHY_MR_TM_GET(x) (((uint32_t)(x) & DDRPHY_MR_TM_MASK) >> DDRPHY_MR_TM_SHIFT)

/*
 * CL (R/W)
 *
 * CAS Latency: The delay between when the SDRAM registers a read command to when data is available. Valid values are:
 * 010 = 2
 * 011 = 3
 * 100 = 4
 * 101 = 5
 * 110 = 6
 * 111 = 7
 * All other settings are reserved and should not be used.
 */
#define DDRPHY_MR_CL_MASK (0x70U)
#define DDRPHY_MR_CL_SHIFT (4U)
#define DDRPHY_MR_CL_SET(x) (((uint32_t)(x) << DDRPHY_MR_CL_SHIFT) & DDRPHY_MR_CL_MASK)
#define DDRPHY_MR_CL_GET(x) (((uint32_t)(x) & DDRPHY_MR_CL_MASK) >> DDRPHY_MR_CL_SHIFT)

/*
 * BT (R/W)
 *
 * Burst Type: Indicates whether a burst is sequential (0) or interleaved (1).
 */
#define DDRPHY_MR_BT_MASK (0x8U)
#define DDRPHY_MR_BT_SHIFT (3U)
#define DDRPHY_MR_BT_SET(x) (((uint32_t)(x) << DDRPHY_MR_BT_SHIFT) & DDRPHY_MR_BT_MASK)
#define DDRPHY_MR_BT_GET(x) (((uint32_t)(x) & DDRPHY_MR_BT_MASK) >> DDRPHY_MR_BT_SHIFT)

/*
 * BL (R/W)
 *
 * Burst Length: Determines the maximum number of column locations that can be accessed during a given read or write command. Valid values are:
 * 010 = 4
 * 011 = 8
 * All other settings are reserved and should not be used.
 */
#define DDRPHY_MR_BL_MASK (0x7U)
#define DDRPHY_MR_BL_SHIFT (0U)
#define DDRPHY_MR_BL_SET(x) (((uint32_t)(x) << DDRPHY_MR_BL_SHIFT) & DDRPHY_MR_BL_MASK)
#define DDRPHY_MR_BL_GET(x) (((uint32_t)(x) & DDRPHY_MR_BL_MASK) >> DDRPHY_MR_BL_SHIFT)

/* Bitfield definition for register: MR1 */
/*
 * QOFF (R/W)
 *
 * Output Enable/Disable: When ‘0’, all outputs function normal; when ‘1’ all SDRAM outputs are disabled removing output buffer current. This feature is intended to be used for IDD characterization of read current and should not be used in normal operation.
 */
#define DDRPHY_MR1_QOFF_MASK (0x1000U)
#define DDRPHY_MR1_QOFF_SHIFT (12U)
#define DDRPHY_MR1_QOFF_SET(x) (((uint32_t)(x) << DDRPHY_MR1_QOFF_SHIFT) & DDRPHY_MR1_QOFF_MASK)
#define DDRPHY_MR1_QOFF_GET(x) (((uint32_t)(x) & DDRPHY_MR1_QOFF_MASK) >> DDRPHY_MR1_QOFF_SHIFT)

/*
 * TDQS (R/W)
 *
 * Termination Data Strobe: When enabled (‘1’) TDQS provides additional termination resistance outputs that may be useful in some system configurations. Refer to the SDRAM datasheet for details.
 */
#define DDRPHY_MR1_TDQS_MASK (0x800U)
#define DDRPHY_MR1_TDQS_SHIFT (11U)
#define DDRPHY_MR1_TDQS_SET(x) (((uint32_t)(x) << DDRPHY_MR1_TDQS_SHIFT) & DDRPHY_MR1_TDQS_MASK)
#define DDRPHY_MR1_TDQS_GET(x) (((uint32_t)(x) & DDRPHY_MR1_TDQS_MASK) >> DDRPHY_MR1_TDQS_SHIFT)

/*
 * RTTH (R/W)
 *
 * On Die Termination high bit
 */
#define DDRPHY_MR1_RTTH_MASK (0x200U)
#define DDRPHY_MR1_RTTH_SHIFT (9U)
#define DDRPHY_MR1_RTTH_SET(x) (((uint32_t)(x) << DDRPHY_MR1_RTTH_SHIFT) & DDRPHY_MR1_RTTH_MASK)
#define DDRPHY_MR1_RTTH_GET(x) (((uint32_t)(x) & DDRPHY_MR1_RTTH_MASK) >> DDRPHY_MR1_RTTH_SHIFT)

