RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * LEVEL (R/W)
 *
 * Write Leveling Enable: Enables write-leveling when set.
 */
#define DDRPHY_MR1_LEVEL_MASK (0x80U)
#define DDRPHY_MR1_LEVEL_SHIFT (7U)
#define DDRPHY_MR1_LEVEL_SET(x) (((uint32_t)(x) << DDRPHY_MR1_LEVEL_SHIFT) & DDRPHY_MR1_LEVEL_MASK)
#define DDRPHY_MR1_LEVEL_GET(x) (((uint32_t)(x) & DDRPHY_MR1_LEVEL_MASK) >> DDRPHY_MR1_LEVEL_SHIFT)

/*
 * RTTM (R/W)
 *
 * On Die Termination mid bit:
 * Selects the effective resistance for SDRAM on die termination. Valid values are:
 * 000 = ODT disabled 001 = RZQ/4
 * 010 = RZQ/2
 * 011 = RZQ/6
 * 100 = RZQ/12
 * 101 = RZQ/8
 * All other settings are reserved and should not be used.
 * Bit on [9, 6,2]
 */
#define DDRPHY_MR1_RTTM_MASK (0x40U)
#define DDRPHY_MR1_RTTM_SHIFT (6U)
#define DDRPHY_MR1_RTTM_SET(x) (((uint32_t)(x) << DDRPHY_MR1_RTTM_SHIFT) & DDRPHY_MR1_RTTM_MASK)
#define DDRPHY_MR1_RTTM_GET(x) (((uint32_t)(x) & DDRPHY_MR1_RTTM_MASK) >> DDRPHY_MR1_RTTM_SHIFT)

/*
 * DICH (R/W)
 *
 * Output Driver Impedance Control high bit:
 * Controls the output drive strength. Valid values are:
 * 00 = RZQ/6
 * 01 = RZQ7
 * 10 = Reserved
 * 11 = Reserved
 */
#define DDRPHY_MR1_DICH_MASK (0x20U)
#define DDRPHY_MR1_DICH_SHIFT (5U)
#define DDRPHY_MR1_DICH_SET(x) (((uint32_t)(x) << DDRPHY_MR1_DICH_SHIFT) & DDRPHY_MR1_DICH_MASK)
#define DDRPHY_MR1_DICH_GET(x) (((uint32_t)(x) & DDRPHY_MR1_DICH_MASK) >> DDRPHY_MR1_DICH_SHIFT)

/*
 * AL (R/W)
 *
 * Posted CAS Additive Latency: Setting additive latency that allows read and write commands to be issued to the SDRAM earlier than normal (refer to the SDRAM datasheet for details). Valid values are:
 * 00 = 0 (AL disabled)
 * 01 = CL - 1
 * 10 = CL - 2
 * 11 = Reserved
 */
#define DDRPHY_MR1_AL_MASK (0x18U)
#define DDRPHY_MR1_AL_SHIFT (3U)
#define DDRPHY_MR1_AL_SET(x) (((uint32_t)(x) << DDRPHY_MR1_AL_SHIFT) & DDRPHY_MR1_AL_MASK)
#define DDRPHY_MR1_AL_GET(x) (((uint32_t)(x) & DDRPHY_MR1_AL_MASK) >> DDRPHY_MR1_AL_SHIFT)

/*
 * RTTL (R/W)
 *
 * On Die Termination low bit
 */
#define DDRPHY_MR1_RTTL_MASK (0x4U)
#define DDRPHY_MR1_RTTL_SHIFT (2U)
#define DDRPHY_MR1_RTTL_SET(x) (((uint32_t)(x) << DDRPHY_MR1_RTTL_SHIFT) & DDRPHY_MR1_RTTL_MASK)
#define DDRPHY_MR1_RTTL_GET(x) (((uint32_t)(x) & DDRPHY_MR1_RTTL_MASK) >> DDRPHY_MR1_RTTL_SHIFT)

/*
 * DICL (R/W)
 *
 * Output Driver Impedance Control low bit
 */
#define DDRPHY_MR1_DICL_MASK (0x2U)
#define DDRPHY_MR1_DICL_SHIFT (1U)
#define DDRPHY_MR1_DICL_SET(x) (((uint32_t)(x) << DDRPHY_MR1_DICL_SHIFT) & DDRPHY_MR1_DICL_MASK)
#define DDRPHY_MR1_DICL_GET(x) (((uint32_t)(x) & DDRPHY_MR1_DICL_MASK) >> DDRPHY_MR1_DICL_SHIFT)

/*
 * DE (R/W)
 *
 * DLL Enable/Disable: Enable (0) or disable (1) the DLL. DLL must be enabled for normal operation.
 * Note: SDRAM DLL off mode is not supported
 */
#define DDRPHY_MR1_DE_MASK (0x1U)
#define DDRPHY_MR1_DE_SHIFT (0U)
#define DDRPHY_MR1_DE_SET(x) (((uint32_t)(x) << DDRPHY_MR1_DE_SHIFT) & DDRPHY_MR1_DE_MASK)
#define DDRPHY_MR1_DE_GET(x) (((uint32_t)(x) & DDRPHY_MR1_DE_MASK) >> DDRPHY_MR1_DE_SHIFT)

/* Bitfield definition for register: EMR */
/*
 * QOFF (R/W)
 *
 * Output Enable/Disable: When ‘0’, all outputs function normal; when ‘1’ all SDRAM outputs are disabled removing output buffer current. This feature is intended to be
 * used for IDD characterization of read current and should not be used in normal operation.
 */
#define DDRPHY_EMR_QOFF_MASK (0x1000U)
#define DDRPHY_EMR_QOFF_SHIFT (12U)
#define DDRPHY_EMR_QOFF_SET(x) (((uint32_t)(x) << DDRPHY_EMR_QOFF_SHIFT) & DDRPHY_EMR_QOFF_MASK)
#define DDRPHY_EMR_QOFF_GET(x) (((uint32_t)(x) & DDRPHY_EMR_QOFF_MASK) >> DDRPHY_EMR_QOFF_SHIFT)

/*
 * RDQS (R/W)
 *
 * RDQS Enable/Disable: When enabled (‘1’), RDQS is identical in function and timing to data strobe DQS during a read, and ignored during a write. A ‘0’ disables the SDRAM from driving RDQS. The Controller does not allow the user to change this bit.
 */
#define DDRPHY_EMR_RDQS_MASK (0x800U)
#define DDRPHY_EMR_RDQS_SHIFT (11U)
#define DDRPHY_EMR_RDQS_SET(x) (((uint32_t)(x) << DDRPHY_EMR_RDQS_SHIFT) & DDRPHY_EMR_RDQS_MASK)
#define DDRPHY_EMR_RDQS_GET(x) (((uint32_t)(x) & DDRPHY_EMR_RDQS_MASK) >> DDRPHY_EMR_RDQS_SHIFT)

/*
 * DQS (R/W)
 *
 * DQS_b Enable/Disable: When ‘0’, DQS_b is the complement of the differential data strobe pair DQS/DQS_b. When ‘1’, DQS is used in a single-ended mode and the DQS_b pin is disabled. Also used to similarly enable/disable RDQS_b if RDQS is enabled. The Controller does not allow the user to change this bit.
 */
#define DDRPHY_EMR_DQS_MASK (0x400U)
#define DDRPHY_EMR_DQS_SHIFT (10U)
#define DDRPHY_EMR_DQS_SET(x) (((uint32_t)(x) << DDRPHY_EMR_DQS_SHIFT) & DDRPHY_EMR_DQS_MASK)
#define DDRPHY_EMR_DQS_GET(x) (((uint32_t)(x) & DDRPHY_EMR_DQS_MASK) >> DDRPHY_EMR_DQS_SHIFT)

/*
 * OCD (R/W)
 *
 * Off-Chip Driver (OCD) Impedance Calibration: Used to calibrate and match pull-up to pull- down impedance to 18  nominal (refer to the SDRAM datasheet for details). Valid values are:
 * 000 = OCD calibration mode exit 001 = Drive (1) pull-up
 * 010 = Drive (0) pull-down
 * 100 = OCD enter adjust mode 111 = OCD calibration default
 * All other settings are reserved and should not be used. Note that OCD is not supported by all vendors. Refer to the SDRAM datasheet for details on the recommended OCD settings.
 */
#define DDRPHY_EMR_OCD_MASK (0x380U)
#define DDRPHY_EMR_OCD_SHIFT (7U)
#define DDRPHY_EMR_OCD_SET(x) (((uint32_t)(x) << DDRPHY_EMR_OCD_SHIFT) & DDRPHY_EMR_OCD_MASK)
#define DDRPHY_EMR_OCD_GET(x) (((uint32_t)(x) & DDRPHY_EMR_OCD_MASK) >> DDRPHY_EMR_OCD_SHIFT)

/*
 * RTTH (R/W)
 *
 * On Die Termination high bit:
 * Selects the effective resistance for SDRAM on die termination. Valid values are:
 * 00 = ODT disabled 01 = 75
 * 10 = 150
 * 11 = 50 (some vendors)
 */
#define DDRPHY_EMR_RTTH_MASK (0x40U)
#define DDRPHY_EMR_RTTH_SHIFT (6U)
#define DDRPHY_EMR_RTTH_SET(x) (((uint32_t)(x) << DDRPHY_EMR_RTTH_SHIFT) & DDRPHY_EMR_RTTH_MASK)
#define DDRPHY_EMR_RTTH_GET(x) (((uint32_t)(x) & DDRPHY_EMR_RTTH_MASK) >> DDRPHY_EMR_RTTH_SHIFT)

