RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * AL (R/W)
 *
 * Posted CAS Additive Latency: Setting additive latency that allows read and write commands to be issued to the SDRAM earlier than normal (refer to the SDRAM datasheet for details). Valid values are:
 * 000 = 0
 * 001 = 1
 * 010 = 2
 * 011 = 3
 * 100 = 4
 * 101 = 5
 * All other settings are reserved and should not be used. The maximum allowed value of AL is tRCD-1.
 */
#define DDRPHY_EMR_AL_MASK (0x38U)
#define DDRPHY_EMR_AL_SHIFT (3U)
#define DDRPHY_EMR_AL_SET(x) (((uint32_t)(x) << DDRPHY_EMR_AL_SHIFT) & DDRPHY_EMR_AL_MASK)
#define DDRPHY_EMR_AL_GET(x) (((uint32_t)(x) & DDRPHY_EMR_AL_MASK) >> DDRPHY_EMR_AL_SHIFT)

/*
 * RTTL (R/W)
 *
 * On Die Termination low bit:
 */
#define DDRPHY_EMR_RTTL_MASK (0x4U)
#define DDRPHY_EMR_RTTL_SHIFT (2U)
#define DDRPHY_EMR_RTTL_SET(x) (((uint32_t)(x) << DDRPHY_EMR_RTTL_SHIFT) & DDRPHY_EMR_RTTL_MASK)
#define DDRPHY_EMR_RTTL_GET(x) (((uint32_t)(x) & DDRPHY_EMR_RTTL_MASK) >> DDRPHY_EMR_RTTL_SHIFT)

/*
 * DIC (R/W)
 *
 * Output Driver Impedance Control: Controls the output drive strength. Valid values are:
 * 0 = Full strength
 * 1 = Reduced strength
 */
#define DDRPHY_EMR_DIC_MASK (0x2U)
#define DDRPHY_EMR_DIC_SHIFT (1U)
#define DDRPHY_EMR_DIC_SET(x) (((uint32_t)(x) << DDRPHY_EMR_DIC_SHIFT) & DDRPHY_EMR_DIC_MASK)
#define DDRPHY_EMR_DIC_GET(x) (((uint32_t)(x) & DDRPHY_EMR_DIC_MASK) >> DDRPHY_EMR_DIC_SHIFT)

/*
 * DE (R/W)
 *
 * DLL Enable/Disable: Enable (0) or disable (1) the DLL. DLL must be enabled for normal operation.
 */
#define DDRPHY_EMR_DE_MASK (0x1U)
#define DDRPHY_EMR_DE_SHIFT (0U)
#define DDRPHY_EMR_DE_SET(x) (((uint32_t)(x) << DDRPHY_EMR_DE_SHIFT) & DDRPHY_EMR_DE_MASK)
#define DDRPHY_EMR_DE_GET(x) (((uint32_t)(x) & DDRPHY_EMR_DE_MASK) >> DDRPHY_EMR_DE_SHIFT)

/* Bitfield definition for register: MR2 */
/*
 * RTTWR (R/W)
 *
 * Dynamic ODT: Selects RTT for dynamic ODT. Valid values are: 00 = Dynamic ODT off
 * 01 = RZQ/4
 * 10 = RZQ/2
 * 11 = Reserved
 */
#define DDRPHY_MR2_RTTWR_MASK (0x600U)
#define DDRPHY_MR2_RTTWR_SHIFT (9U)
#define DDRPHY_MR2_RTTWR_SET(x) (((uint32_t)(x) << DDRPHY_MR2_RTTWR_SHIFT) & DDRPHY_MR2_RTTWR_MASK)
#define DDRPHY_MR2_RTTWR_GET(x) (((uint32_t)(x) & DDRPHY_MR2_RTTWR_MASK) >> DDRPHY_MR2_RTTWR_SHIFT)

/*
 * SRT (R/W)
 *
 * Self-Refresh Temperature Range: Selects either normal (‘0’) or extended (‘1’) operating temperature range during self-refresh.
 */
#define DDRPHY_MR2_SRT_MASK (0x80U)
#define DDRPHY_MR2_SRT_SHIFT (7U)
#define DDRPHY_MR2_SRT_SET(x) (((uint32_t)(x) << DDRPHY_MR2_SRT_SHIFT) & DDRPHY_MR2_SRT_MASK)
#define DDRPHY_MR2_SRT_GET(x) (((uint32_t)(x) & DDRPHY_MR2_SRT_MASK) >> DDRPHY_MR2_SRT_SHIFT)

/*
 * ASR (R/W)
 *
 * Auto Self-Refresh: When enabled (‘1’), SDRAM automatically provides self-refresh power management functions for all supported operating temperature values.
 * Otherwise the SRT bit must be programmed to indicate the temperature range.
 */
#define DDRPHY_MR2_ASR_MASK (0x40U)
#define DDRPHY_MR2_ASR_SHIFT (6U)
#define DDRPHY_MR2_ASR_SET(x) (((uint32_t)(x) << DDRPHY_MR2_ASR_SHIFT) & DDRPHY_MR2_ASR_MASK)
#define DDRPHY_MR2_ASR_GET(x) (((uint32_t)(x) & DDRPHY_MR2_ASR_MASK) >> DDRPHY_MR2_ASR_SHIFT)

/*
 * CWL (R/W)
 *
 * CAS Write Latency: The delay between when the SDRAM registers a write command to when write data is available. Valid values are:
 * 000 = 5 (tCK > 2.5ns)
 * 001 = 6 (2.5ns > tCK > 1.875ns)
 * 010 = 7 (1.875ns > tCK> 1.5ns)
 * 011 = 8 (1.5ns > tCK > 1.25ns)
 * 100 = 9 (1.25ns > tCK > 1.07ns)
 * 101 = 10 (1.07ns > tCK > 0.935ns)
 * 110 = 11 (0.935ns > tCK > 0.833ns)
 * 111 = 12 (0.833ns > tCK > 0.75ns)
 * All other settings are reserved and should not be used.
 */
#define DDRPHY_MR2_CWL_MASK (0x38U)
#define DDRPHY_MR2_CWL_SHIFT (3U)
#define DDRPHY_MR2_CWL_SET(x) (((uint32_t)(x) << DDRPHY_MR2_CWL_SHIFT) & DDRPHY_MR2_CWL_MASK)
#define DDRPHY_MR2_CWL_GET(x) (((uint32_t)(x) & DDRPHY_MR2_CWL_MASK) >> DDRPHY_MR2_CWL_SHIFT)

/*
 * PASR (R/W)
 *
 * Partial Array Self Refresh: Specifies that data located in areas of the array beyond the specified location will be lost if self refresh is entered.
 * Valid settings for 4 banks are:
 * 000 = Full Array
 * 001 = Half Array (BA[1:0] = 00 & 01)
 * 010 = Quarter Array (BA[1:0] = 00) 011 = Not defined
 * 100 = 3/4 Array (BA[1:0] = 01, 10, & 11)
 * 101 = Half Array (BA[1:0] = 10 & 11)
 * 110 = Quarter Array (BA[1:0] = 11) 111 = Not defined
 * Valid settings for 8 banks are:
 * 000 = Full Array
 * 001 = Half Array (BA[2:0] = 000, 001, 010 & 011)
 * 010 = Quarter Array (BA[2:0] = 000, 001) 011 = 1/8 Array (BA[2:0] = 000)
 * 100 = 3/4 Array (BA[2:0] = 010, 011, 100, 101, 110 & 111)
 * 101 = Half Array (BA[2:0] = 100, 101, 110 & 111)
 * 110 = Quarter Array (BA[2:0] = 110 & 111)
 * 111 = 1/8 Array (BA[2:0] 111)
 */
#define DDRPHY_MR2_PASR_MASK (0x7U)
#define DDRPHY_MR2_PASR_SHIFT (0U)
#define DDRPHY_MR2_PASR_SET(x) (((uint32_t)(x) << DDRPHY_MR2_PASR_SHIFT) & DDRPHY_MR2_PASR_MASK)
#define DDRPHY_MR2_PASR_GET(x) (((uint32_t)(x) & DDRPHY_MR2_PASR_MASK) >> DDRPHY_MR2_PASR_SHIFT)

/* Bitfield definition for register: EMR2 */
/*
 * SRF (R/W)
 *
 * Self Refresh Rate: Enables, if set, high temperature self refresh rate.
 */
#define DDRPHY_EMR2_SRF_MASK (0x80U)
#define DDRPHY_EMR2_SRF_SHIFT (7U)
#define DDRPHY_EMR2_SRF_SET(x) (((uint32_t)(x) << DDRPHY_EMR2_SRF_SHIFT) & DDRPHY_EMR2_SRF_MASK)
#define DDRPHY_EMR2_SRF_GET(x) (((uint32_t)(x) & DDRPHY_EMR2_SRF_MASK) >> DDRPHY_EMR2_SRF_SHIFT)

/*
 * DCC (R/W)
 *
 * Duty Cycle Corrector: Enables, if set, duty cycle correction within SDRAM.
 */
#define DDRPHY_EMR2_DCC_MASK (0x8U)
#define DDRPHY_EMR2_DCC_SHIFT (3U)
#define DDRPHY_EMR2_DCC_SET(x) (((uint32_t)(x) << DDRPHY_EMR2_DCC_SHIFT) & DDRPHY_EMR2_DCC_MASK)
#define DDRPHY_EMR2_DCC_GET(x) (((uint32_t)(x) & DDRPHY_EMR2_DCC_MASK) >> DDRPHY_EMR2_DCC_SHIFT)

/*
 * PASR (R/W)
 *
 * Partial Array Self Refresh: Specifies that data located in areas of the array beyond the specified location will be lost if self refresh is entered.
 * Valid settings for 4 banks are:
 * 000 = Full Array
 * 001 = Half Array (BA[1:0] = 00 & 01)
 * 010 = Quarter Array (BA[1:0] = 00) 011 = Not defined
 * 100 = 3/4 Array (BA[1:0] = 01, 10, & 11)
 * 101 = Half Array (BA[1:0] = 10 & 11)
 * 110 = Quarter Array (BA[1:0] = 11) 111 = Not defined
 * Valid settings for 8 banks are:
 * 000 = Full Array
 * 001 = Half Array (BA[2:0] = 000, 001, 010 & 011)
 * 010 = Quarter Array (BA[2:0] = 000, 001) 011 = 1/8 Array (BA[2:0] = 000)
 * 100 = 3/4 Array (BA[2:0] = 010, 011, 100, 101, 110 & 111)
 * 101 = Half Array (BA[2:0] = 100, 101, 110 & 111)
 * 110 = Quarter Array (BA[2:0] = 110 & 111)
 * 111 = 1/8 Array (BA[2:0] 111)
 */
#define DDRPHY_EMR2_PASR_MASK (0x7U)
#define DDRPHY_EMR2_PASR_SHIFT (0U)
#define DDRPHY_EMR2_PASR_SET(x) (((uint32_t)(x) << DDRPHY_EMR2_PASR_SHIFT) & DDRPHY_EMR2_PASR_MASK)
#define DDRPHY_EMR2_PASR_GET(x) (((uint32_t)(x) & DDRPHY_EMR2_PASR_MASK) >> DDRPHY_EMR2_PASR_SHIFT)

/* Bitfield definition for register: MR3 */
/*
 * MPR (R/W)
 *
 * Multi-Purpose Register Enable: Enables, if set, that read data should come from the Multi-Purpose Register. Otherwise read data come from the DRAM array.
 */
#define DDRPHY_MR3_MPR_MASK (0x4U)
#define DDRPHY_MR3_MPR_SHIFT (2U)
#define DDRPHY_MR3_MPR_SET(x) (((uint32_t)(x) << DDRPHY_MR3_MPR_SHIFT) & DDRPHY_MR3_MPR_MASK)
#define DDRPHY_MR3_MPR_GET(x) (((uint32_t)(x) & DDRPHY_MR3_MPR_MASK) >> DDRPHY_MR3_MPR_SHIFT)

