RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DTDEN (R/W)
 *
 * Data Training Debug Enable: Enables, if set, the data training single step debug mode.
 */
#define DDRPHY_DTCR_DTDEN_MASK (0x100000UL)
#define DDRPHY_DTCR_DTDEN_SHIFT (20U)
#define DDRPHY_DTCR_DTDEN_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTDEN_SHIFT) & DDRPHY_DTCR_DTDEN_MASK)
#define DDRPHY_DTCR_DTDEN_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTDEN_MASK) >> DDRPHY_DTCR_DTDEN_SHIFT)

/*
 * DTDBS (R/W)
 *
 * Data Training Debug Byte Select: Selects the byte during data training single step debug mode.
 * Note: DTDEN is not used to enable this feature.
 */
#define DDRPHY_DTCR_DTDBS_MASK (0xF0000UL)
#define DDRPHY_DTCR_DTDBS_SHIFT (16U)
#define DDRPHY_DTCR_DTDBS_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTDBS_SHIFT) & DDRPHY_DTCR_DTDBS_MASK)
#define DDRPHY_DTCR_DTDBS_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTDBS_MASK) >> DDRPHY_DTCR_DTDBS_SHIFT)

/*
 * DTWDQMO (R/W)
 *
 * Data Training WDQ Margin Override: If set, the Training WDQ Margin value specified in DTCR[11:8] (DTWDQM) is used during data training. Otherwise the value is computed as ¼ of the ddr_clk period measurement found during calibration of the WDQ LCDL.
 */
#define DDRPHY_DTCR_DTWDQMO_MASK (0x4000U)
#define DDRPHY_DTCR_DTWDQMO_SHIFT (14U)
#define DDRPHY_DTCR_DTWDQMO_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTWDQMO_SHIFT) & DDRPHY_DTCR_DTWDQMO_MASK)
#define DDRPHY_DTCR_DTWDQMO_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTWDQMO_MASK) >> DDRPHY_DTCR_DTWDQMO_SHIFT)

/*
 * DTBDC (R/W)
 *
 * Data Training Bit Deskew Centering: Enables, if set, eye centering capability during write and read bit deskew training.
 */
#define DDRPHY_DTCR_DTBDC_MASK (0x2000U)
#define DDRPHY_DTCR_DTBDC_SHIFT (13U)
#define DDRPHY_DTCR_DTBDC_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTBDC_SHIFT) & DDRPHY_DTCR_DTBDC_MASK)
#define DDRPHY_DTCR_DTBDC_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTBDC_MASK) >> DDRPHY_DTCR_DTBDC_SHIFT)

/*
 * DTWBDDM (R/W)
 *
 * Data Training Write Bit Deskew Data Mask, if set, it enables write bit deskew of the data mask
 */
#define DDRPHY_DTCR_DTWBDDM_MASK (0x1000U)
#define DDRPHY_DTCR_DTWBDDM_SHIFT (12U)
#define DDRPHY_DTCR_DTWBDDM_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTWBDDM_SHIFT) & DDRPHY_DTCR_DTWBDDM_MASK)
#define DDRPHY_DTCR_DTWBDDM_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTWBDDM_MASK) >> DDRPHY_DTCR_DTWBDDM_SHIFT)

/*
 * DTWDQM (R/W)
 *
 * Training WDQ Margin: Defines how close to 0 or how close to 2*(wdq calibration_value) the WDQ LCDL can be moved during training. Basically defines how much timing margin.
 */
#define DDRPHY_DTCR_DTWDQM_MASK (0xF00U)
#define DDRPHY_DTCR_DTWDQM_SHIFT (8U)
#define DDRPHY_DTCR_DTWDQM_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTWDQM_SHIFT) & DDRPHY_DTCR_DTWDQM_MASK)
#define DDRPHY_DTCR_DTWDQM_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTWDQM_MASK) >> DDRPHY_DTCR_DTWDQM_SHIFT)

/*
 * DTCMPD (R/W)
 *
 * Read Data Training Compare Data: Specifies, if set, that DQS gate training should also check if the returning read data is correct. Otherwise data-training only checks if the correct number of DQS edges were returned.
 */
#define DDRPHY_DTCR_DTCMPD_MASK (0x80U)
#define DDRPHY_DTCR_DTCMPD_SHIFT (7U)
#define DDRPHY_DTCR_DTCMPD_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTCMPD_SHIFT) & DDRPHY_DTCR_DTCMPD_MASK)
#define DDRPHY_DTCR_DTCMPD_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTCMPD_MASK) >> DDRPHY_DTCR_DTCMPD_SHIFT)

/*
 * DTMPR (R/W)
 *
 * Read Data Training Using MPR (DDR3 Only): Specifies, if set, that DQS gate training should use the SDRAM Multi-Purpose Register (MPR) register. Otherwise data-training is performed by first writing to some locations in the SDRAM and then reading them back.
 */
#define DDRPHY_DTCR_DTMPR_MASK (0x40U)
#define DDRPHY_DTCR_DTMPR_SHIFT (6U)
#define DDRPHY_DTCR_DTMPR_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTMPR_SHIFT) & DDRPHY_DTCR_DTMPR_MASK)
#define DDRPHY_DTCR_DTMPR_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTMPR_MASK) >> DDRPHY_DTCR_DTMPR_SHIFT)

/*
 * DTRANK (R/W)
 *
 * Data Training Rank: Select the SDRAM rank to be used during Read DQS gate training, Read/Write Data Bit Deskew, Read/Write Eye Training.
 */
#define DDRPHY_DTCR_DTRANK_MASK (0x30U)
#define DDRPHY_DTCR_DTRANK_SHIFT (4U)
#define DDRPHY_DTCR_DTRANK_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTRANK_SHIFT) & DDRPHY_DTCR_DTRANK_MASK)
#define DDRPHY_DTCR_DTRANK_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTRANK_MASK) >> DDRPHY_DTCR_DTRANK_SHIFT)

/*
 * DTRPTN (R/W)
 *
 * Data Training Repeat Number: Repeat number used to confirm stability of DDR write or read.
 * Note: The minimum value should be 0x4 and the maximum value should be 0x14.
 */
#define DDRPHY_DTCR_DTRPTN_MASK (0xFU)
#define DDRPHY_DTCR_DTRPTN_SHIFT (0U)
#define DDRPHY_DTCR_DTRPTN_SET(x) (((uint32_t)(x) << DDRPHY_DTCR_DTRPTN_SHIFT) & DDRPHY_DTCR_DTRPTN_MASK)
#define DDRPHY_DTCR_DTRPTN_GET(x) (((uint32_t)(x) & DDRPHY_DTCR_DTRPTN_MASK) >> DDRPHY_DTCR_DTRPTN_SHIFT)

/* Bitfield definition for register: DTAR0 */
/*
 * DTBANK (R/W)
 *
 * Data Training Bank Address: Selects the SDRAM bank address to be used during data training.
 */
#define DDRPHY_DTAR0_DTBANK_MASK (0x70000000UL)
#define DDRPHY_DTAR0_DTBANK_SHIFT (28U)
#define DDRPHY_DTAR0_DTBANK_SET(x) (((uint32_t)(x) << DDRPHY_DTAR0_DTBANK_SHIFT) & DDRPHY_DTAR0_DTBANK_MASK)
#define DDRPHY_DTAR0_DTBANK_GET(x) (((uint32_t)(x) & DDRPHY_DTAR0_DTBANK_MASK) >> DDRPHY_DTAR0_DTBANK_SHIFT)

/*
 * DTROW (R/W)
 *
 * Data Training Row Address: Selects the SDRAM row address to be used during data training.
 */
#define DDRPHY_DTAR0_DTROW_MASK (0xFFFF000UL)
#define DDRPHY_DTAR0_DTROW_SHIFT (12U)
#define DDRPHY_DTAR0_DTROW_SET(x) (((uint32_t)(x) << DDRPHY_DTAR0_DTROW_SHIFT) & DDRPHY_DTAR0_DTROW_MASK)
#define DDRPHY_DTAR0_DTROW_GET(x) (((uint32_t)(x) & DDRPHY_DTAR0_DTROW_MASK) >> DDRPHY_DTAR0_DTROW_SHIFT)

/*
 * DTCOL (R/W)
 *
 * Data Training Column Address: Selects the SDRAM column address to be used during data training. The lower four bits of this address must always be “000”.
 */
#define DDRPHY_DTAR0_DTCOL_MASK (0xFFFU)
#define DDRPHY_DTAR0_DTCOL_SHIFT (0U)
#define DDRPHY_DTAR0_DTCOL_SET(x) (((uint32_t)(x) << DDRPHY_DTAR0_DTCOL_SHIFT) & DDRPHY_DTAR0_DTCOL_MASK)
#define DDRPHY_DTAR0_DTCOL_GET(x) (((uint32_t)(x) & DDRPHY_DTAR0_DTCOL_MASK) >> DDRPHY_DTAR0_DTCOL_SHIFT)

/* Bitfield definition for register: DTAR1 */
/*
 * DTBANK (R/W)
 *
 * Data Training Bank Address: Selects the SDRAM bank address to be used during data training.
 */
#define DDRPHY_DTAR1_DTBANK_MASK (0x70000000UL)
#define DDRPHY_DTAR1_DTBANK_SHIFT (28U)
#define DDRPHY_DTAR1_DTBANK_SET(x) (((uint32_t)(x) << DDRPHY_DTAR1_DTBANK_SHIFT) & DDRPHY_DTAR1_DTBANK_MASK)
#define DDRPHY_DTAR1_DTBANK_GET(x) (((uint32_t)(x) & DDRPHY_DTAR1_DTBANK_MASK) >> DDRPHY_DTAR1_DTBANK_SHIFT)

