RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DTROW (R/W)
 *
 * Data Training Row Address: Selects the SDRAM row address to be used during data training.
 */
#define DDRPHY_DTAR1_DTROW_MASK (0xFFFF000UL)
#define DDRPHY_DTAR1_DTROW_SHIFT (12U)
#define DDRPHY_DTAR1_DTROW_SET(x) (((uint32_t)(x) << DDRPHY_DTAR1_DTROW_SHIFT) & DDRPHY_DTAR1_DTROW_MASK)
#define DDRPHY_DTAR1_DTROW_GET(x) (((uint32_t)(x) & DDRPHY_DTAR1_DTROW_MASK) >> DDRPHY_DTAR1_DTROW_SHIFT)

/*
 * DTCOL (R/W)
 *
 * Data Training Column Address: Selects the SDRAM column address to be used during data training. The lower four bits of this address must always be “000”.
 */
#define DDRPHY_DTAR1_DTCOL_MASK (0xFFFU)
#define DDRPHY_DTAR1_DTCOL_SHIFT (0U)
#define DDRPHY_DTAR1_DTCOL_SET(x) (((uint32_t)(x) << DDRPHY_DTAR1_DTCOL_SHIFT) & DDRPHY_DTAR1_DTCOL_MASK)
#define DDRPHY_DTAR1_DTCOL_GET(x) (((uint32_t)(x) & DDRPHY_DTAR1_DTCOL_MASK) >> DDRPHY_DTAR1_DTCOL_SHIFT)

/* Bitfield definition for register: DTAR2 */
/*
 * DTBANK (R/W)
 *
 * Data Training Bank Address: Selects the SDRAM bank address to be used during data training.
 */
#define DDRPHY_DTAR2_DTBANK_MASK (0x70000000UL)
#define DDRPHY_DTAR2_DTBANK_SHIFT (28U)
#define DDRPHY_DTAR2_DTBANK_SET(x) (((uint32_t)(x) << DDRPHY_DTAR2_DTBANK_SHIFT) & DDRPHY_DTAR2_DTBANK_MASK)
#define DDRPHY_DTAR2_DTBANK_GET(x) (((uint32_t)(x) & DDRPHY_DTAR2_DTBANK_MASK) >> DDRPHY_DTAR2_DTBANK_SHIFT)

/*
 * DTROW (R/W)
 *
 * Data Training Row Address: Selects the SDRAM row address to be used during data training.
 */
#define DDRPHY_DTAR2_DTROW_MASK (0xFFFF000UL)
#define DDRPHY_DTAR2_DTROW_SHIFT (12U)
#define DDRPHY_DTAR2_DTROW_SET(x) (((uint32_t)(x) << DDRPHY_DTAR2_DTROW_SHIFT) & DDRPHY_DTAR2_DTROW_MASK)
#define DDRPHY_DTAR2_DTROW_GET(x) (((uint32_t)(x) & DDRPHY_DTAR2_DTROW_MASK) >> DDRPHY_DTAR2_DTROW_SHIFT)

/*
 * DTCOL (R/W)
 *
 * Data Training Column Address: Selects the SDRAM column address to be used during data training. The lower four bits of this address must always be “000”.
 */
#define DDRPHY_DTAR2_DTCOL_MASK (0xFFFU)
#define DDRPHY_DTAR2_DTCOL_SHIFT (0U)
#define DDRPHY_DTAR2_DTCOL_SET(x) (((uint32_t)(x) << DDRPHY_DTAR2_DTCOL_SHIFT) & DDRPHY_DTAR2_DTCOL_MASK)
#define DDRPHY_DTAR2_DTCOL_GET(x) (((uint32_t)(x) & DDRPHY_DTAR2_DTCOL_MASK) >> DDRPHY_DTAR2_DTCOL_SHIFT)

/* Bitfield definition for register: DTAR3 */
/*
 * DTBANK (R/W)
 *
 * Data Training Bank Address: Selects the SDRAM bank address to be used during data training.
 */
#define DDRPHY_DTAR3_DTBANK_MASK (0x70000000UL)
#define DDRPHY_DTAR3_DTBANK_SHIFT (28U)
#define DDRPHY_DTAR3_DTBANK_SET(x) (((uint32_t)(x) << DDRPHY_DTAR3_DTBANK_SHIFT) & DDRPHY_DTAR3_DTBANK_MASK)
#define DDRPHY_DTAR3_DTBANK_GET(x) (((uint32_t)(x) & DDRPHY_DTAR3_DTBANK_MASK) >> DDRPHY_DTAR3_DTBANK_SHIFT)

/*
 * DTROW (R/W)
 *
 * Data Training Row Address: Selects the SDRAM row address to be used during data training.
 */
#define DDRPHY_DTAR3_DTROW_MASK (0xFFFF000UL)
#define DDRPHY_DTAR3_DTROW_SHIFT (12U)
#define DDRPHY_DTAR3_DTROW_SET(x) (((uint32_t)(x) << DDRPHY_DTAR3_DTROW_SHIFT) & DDRPHY_DTAR3_DTROW_MASK)
#define DDRPHY_DTAR3_DTROW_GET(x) (((uint32_t)(x) & DDRPHY_DTAR3_DTROW_MASK) >> DDRPHY_DTAR3_DTROW_SHIFT)

/*
 * DTCOL (R/W)
 *
 * Data Training Column Address: Selects the SDRAM column address to be used during data training. The lower four bits of this address must always be “000”.
 */
#define DDRPHY_DTAR3_DTCOL_MASK (0xFFFU)
#define DDRPHY_DTAR3_DTCOL_SHIFT (0U)
#define DDRPHY_DTAR3_DTCOL_SET(x) (((uint32_t)(x) << DDRPHY_DTAR3_DTCOL_SHIFT) & DDRPHY_DTAR3_DTCOL_MASK)
#define DDRPHY_DTAR3_DTCOL_GET(x) (((uint32_t)(x) & DDRPHY_DTAR3_DTCOL_MASK) >> DDRPHY_DTAR3_DTCOL_SHIFT)

/* Bitfield definition for register: DTDR0 */
/*
 * DTBYTE3 (R/W)
 *
 */
#define DDRPHY_DTDR0_DTBYTE3_MASK (0xFF000000UL)
#define DDRPHY_DTDR0_DTBYTE3_SHIFT (24U)
#define DDRPHY_DTDR0_DTBYTE3_SET(x) (((uint32_t)(x) << DDRPHY_DTDR0_DTBYTE3_SHIFT) & DDRPHY_DTDR0_DTBYTE3_MASK)
#define DDRPHY_DTDR0_DTBYTE3_GET(x) (((uint32_t)(x) & DDRPHY_DTDR0_DTBYTE3_MASK) >> DDRPHY_DTDR0_DTBYTE3_SHIFT)

/*
 * DTBYTE2 (R/W)
 *
 */
#define DDRPHY_DTDR0_DTBYTE2_MASK (0xFF0000UL)
#define DDRPHY_DTDR0_DTBYTE2_SHIFT (16U)
#define DDRPHY_DTDR0_DTBYTE2_SET(x) (((uint32_t)(x) << DDRPHY_DTDR0_DTBYTE2_SHIFT) & DDRPHY_DTDR0_DTBYTE2_MASK)
#define DDRPHY_DTDR0_DTBYTE2_GET(x) (((uint32_t)(x) & DDRPHY_DTDR0_DTBYTE2_MASK) >> DDRPHY_DTDR0_DTBYTE2_SHIFT)

/*
 * DTBYTE1 (R/W)
 *
 */
#define DDRPHY_DTDR0_DTBYTE1_MASK (0xFF00U)
#define DDRPHY_DTDR0_DTBYTE1_SHIFT (8U)
#define DDRPHY_DTDR0_DTBYTE1_SET(x) (((uint32_t)(x) << DDRPHY_DTDR0_DTBYTE1_SHIFT) & DDRPHY_DTDR0_DTBYTE1_MASK)
#define DDRPHY_DTDR0_DTBYTE1_GET(x) (((uint32_t)(x) & DDRPHY_DTDR0_DTBYTE1_MASK) >> DDRPHY_DTDR0_DTBYTE1_SHIFT)

/*
 * DTBYTE0 (R/W)
 *
 * Data Training Data: The first 4 bytes of data used during data training. This same data byte is used for each Byte Lane. Default sequence is a walking 1 while toggling data every data cycle.
 */
#define DDRPHY_DTDR0_DTBYTE0_MASK (0xFFU)
#define DDRPHY_DTDR0_DTBYTE0_SHIFT (0U)
#define DDRPHY_DTDR0_DTBYTE0_SET(x) (((uint32_t)(x) << DDRPHY_DTDR0_DTBYTE0_SHIFT) & DDRPHY_DTDR0_DTBYTE0_MASK)
#define DDRPHY_DTDR0_DTBYTE0_GET(x) (((uint32_t)(x) & DDRPHY_DTDR0_DTBYTE0_MASK) >> DDRPHY_DTDR0_DTBYTE0_SHIFT)

/* Bitfield definition for register: DTDR1 */
/*
 * DTBYTE7 (R/W)
 *
 */
#define DDRPHY_DTDR1_DTBYTE7_MASK (0xFF000000UL)
#define DDRPHY_DTDR1_DTBYTE7_SHIFT (24U)
#define DDRPHY_DTDR1_DTBYTE7_SET(x) (((uint32_t)(x) << DDRPHY_DTDR1_DTBYTE7_SHIFT) & DDRPHY_DTDR1_DTBYTE7_MASK)
#define DDRPHY_DTDR1_DTBYTE7_GET(x) (((uint32_t)(x) & DDRPHY_DTDR1_DTBYTE7_MASK) >> DDRPHY_DTDR1_DTBYTE7_SHIFT)

/*
 * DTBYTE6 (R/W)
 *
 */
#define DDRPHY_DTDR1_DTBYTE6_MASK (0xFF0000UL)
#define DDRPHY_DTDR1_DTBYTE6_SHIFT (16U)
#define DDRPHY_DTDR1_DTBYTE6_SET(x) (((uint32_t)(x) << DDRPHY_DTDR1_DTBYTE6_SHIFT) & DDRPHY_DTDR1_DTBYTE6_MASK)
#define DDRPHY_DTDR1_DTBYTE6_GET(x) (((uint32_t)(x) & DDRPHY_DTDR1_DTBYTE6_MASK) >> DDRPHY_DTDR1_DTBYTE6_SHIFT)

/*
 * DTBYTE5 (R/W)
 *
 */
#define DDRPHY_DTDR1_DTBYTE5_MASK (0xFF00U)
#define DDRPHY_DTDR1_DTBYTE5_SHIFT (8U)
#define DDRPHY_DTDR1_DTBYTE5_SET(x) (((uint32_t)(x) << DDRPHY_DTDR1_DTBYTE5_SHIFT) & DDRPHY_DTDR1_DTBYTE5_MASK)
#define DDRPHY_DTDR1_DTBYTE5_GET(x) (((uint32_t)(x) & DDRPHY_DTDR1_DTBYTE5_MASK) >> DDRPHY_DTDR1_DTBYTE5_SHIFT)

