RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DTBYTE4 (R/W)
 *
 * Data Training Data: The second 4 bytes of data used during data training. This same data byte is used for each Byte Lane. Default sequence is a walking 1 while toggling data every data cycle.
 */
#define DDRPHY_DTDR1_DTBYTE4_MASK (0xFFU)
#define DDRPHY_DTDR1_DTBYTE4_SHIFT (0U)
#define DDRPHY_DTDR1_DTBYTE4_SET(x) (((uint32_t)(x) << DDRPHY_DTDR1_DTBYTE4_SHIFT) & DDRPHY_DTDR1_DTBYTE4_MASK)
#define DDRPHY_DTDR1_DTBYTE4_GET(x) (((uint32_t)(x) & DDRPHY_DTDR1_DTBYTE4_MASK) >> DDRPHY_DTDR1_DTBYTE4_SHIFT)

/* Bitfield definition for register: DTEDR0 */
/*
 * DTWBMX (R)
 *
 * Data Training Write BDL Shift Maximum.
 */
#define DDRPHY_DTEDR0_DTWBMX_MASK (0xFF000000UL)
#define DDRPHY_DTEDR0_DTWBMX_SHIFT (24U)
#define DDRPHY_DTEDR0_DTWBMX_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR0_DTWBMX_MASK) >> DDRPHY_DTEDR0_DTWBMX_SHIFT)

/*
 * DTWBMN (R)
 *
 * Data Training Write BDL Shift Minimum.
 */
#define DDRPHY_DTEDR0_DTWBMN_MASK (0xFF0000UL)
#define DDRPHY_DTEDR0_DTWBMN_SHIFT (16U)
#define DDRPHY_DTEDR0_DTWBMN_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR0_DTWBMN_MASK) >> DDRPHY_DTEDR0_DTWBMN_SHIFT)

/*
 * DTWLMX (R)
 *
 * Data Training WDQ LCDL Maximum.
 */
#define DDRPHY_DTEDR0_DTWLMX_MASK (0xFF00U)
#define DDRPHY_DTEDR0_DTWLMX_SHIFT (8U)
#define DDRPHY_DTEDR0_DTWLMX_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR0_DTWLMX_MASK) >> DDRPHY_DTEDR0_DTWLMX_SHIFT)

/*
 * DTWLMN (R)
 *
 * Data Training WDQ LCDL Minimum.
 */
#define DDRPHY_DTEDR0_DTWLMN_MASK (0xFFU)
#define DDRPHY_DTEDR0_DTWLMN_SHIFT (0U)
#define DDRPHY_DTEDR0_DTWLMN_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR0_DTWLMN_MASK) >> DDRPHY_DTEDR0_DTWLMN_SHIFT)

/* Bitfield definition for register: DTEDR1 */
/*
 * DTRBMX (R)
 *
 * Data Training Read BDL Shift Maximum.
 */
#define DDRPHY_DTEDR1_DTRBMX_MASK (0xFF000000UL)
#define DDRPHY_DTEDR1_DTRBMX_SHIFT (24U)
#define DDRPHY_DTEDR1_DTRBMX_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR1_DTRBMX_MASK) >> DDRPHY_DTEDR1_DTRBMX_SHIFT)

/*
 * DTRBMN (R)
 *
 * Data Training Read BDL Shift Minimum.
 */
#define DDRPHY_DTEDR1_DTRBMN_MASK (0xFF0000UL)
#define DDRPHY_DTEDR1_DTRBMN_SHIFT (16U)
#define DDRPHY_DTEDR1_DTRBMN_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR1_DTRBMN_MASK) >> DDRPHY_DTEDR1_DTRBMN_SHIFT)

/*
 * DTRLMX (R)
 *
 * Data Training RDQS LCDL Maximum.
 */
#define DDRPHY_DTEDR1_DTRLMX_MASK (0xFF00U)
#define DDRPHY_DTEDR1_DTRLMX_SHIFT (8U)
#define DDRPHY_DTEDR1_DTRLMX_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR1_DTRLMX_MASK) >> DDRPHY_DTEDR1_DTRLMX_SHIFT)

/*
 * DTRLMN (R)
 *
 * Data Training RDQS LCDL Minimum.
 */
#define DDRPHY_DTEDR1_DTRLMN_MASK (0xFFU)
#define DDRPHY_DTEDR1_DTRLMN_SHIFT (0U)
#define DDRPHY_DTEDR1_DTRLMN_GET(x) (((uint32_t)(x) & DDRPHY_DTEDR1_DTRLMN_MASK) >> DDRPHY_DTEDR1_DTRLMN_SHIFT)

/* Bitfield definition for register: PGCR2 */
/*
 * DYNACPDD1 (R/W)
 *
 * Dynamic AC Power Down Driver: Powers down, when set, the output driver on I/O for ADDR and BA. This bit is ORed with bit ACIOCR[3] (ACPDD).
 */
#define DDRPHY_PGCR2_DYNACPDD1_MASK (0x80000000UL)
#define DDRPHY_PGCR2_DYNACPDD1_SHIFT (31U)
#define DDRPHY_PGCR2_DYNACPDD1_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_DYNACPDD1_SHIFT) & DDRPHY_PGCR2_DYNACPDD1_MASK)
#define DDRPHY_PGCR2_DYNACPDD1_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_DYNACPDD1_MASK) >> DDRPHY_PGCR2_DYNACPDD1_SHIFT)

/*
 * LPMSTRC0 (R/W)
 *
 * Low-Power Master Channel 0: set to 1 to have channel 0 act as master to drive channel 1 low-power functions simultaneously. Only valid in shared-AC mode.
 */
#define DDRPHY_PGCR2_LPMSTRC0_MASK (0x40000000UL)
#define DDRPHY_PGCR2_LPMSTRC0_SHIFT (30U)
#define DDRPHY_PGCR2_LPMSTRC0_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_LPMSTRC0_SHIFT) & DDRPHY_PGCR2_LPMSTRC0_MASK)
#define DDRPHY_PGCR2_LPMSTRC0_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_LPMSTRC0_MASK) >> DDRPHY_PGCR2_LPMSTRC0_SHIFT)

/*
 * ACPDDC (R/W)
 *
 * AC Power-Down with Dual Channels: Set to 1 to power-down address/command lane when both data channels are powered-down. Only valid in shared-AC mode.
 */
#define DDRPHY_PGCR2_ACPDDC_MASK (0x20000000UL)
#define DDRPHY_PGCR2_ACPDDC_SHIFT (29U)
#define DDRPHY_PGCR2_ACPDDC_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_ACPDDC_SHIFT) & DDRPHY_PGCR2_ACPDDC_MASK)
#define DDRPHY_PGCR2_ACPDDC_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_ACPDDC_MASK) >> DDRPHY_PGCR2_ACPDDC_SHIFT)

/*
 * SHRAC (R/W)
 *
 * Shared-AC mode: set to 1 to enable shared address/command mode with two independent data channels – available only if shared address/command mode support is compiled in.
 */
#define DDRPHY_PGCR2_SHRAC_MASK (0x10000000UL)
#define DDRPHY_PGCR2_SHRAC_SHIFT (28U)
#define DDRPHY_PGCR2_SHRAC_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_SHRAC_SHIFT) & DDRPHY_PGCR2_SHRAC_MASK)
#define DDRPHY_PGCR2_SHRAC_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_SHRAC_MASK) >> DDRPHY_PGCR2_SHRAC_SHIFT)

/*
 * DTPMXTMR (R/W)
 *
 * Data Training PUB Mode Timer Exit: Specifies the number of controller clocks to wait when entering and exiting pub mode data training. The default value ensures controller refreshes do not cause memory model errors when entering and exiting data training. The value should be increased if controller initiated SDRAM ZQ short or long operation may occur just before or just after the execution of data training.
 */
#define DDRPHY_PGCR2_DTPMXTMR_MASK (0xFF00000UL)
#define DDRPHY_PGCR2_DTPMXTMR_SHIFT (20U)
#define DDRPHY_PGCR2_DTPMXTMR_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_DTPMXTMR_SHIFT) & DDRPHY_PGCR2_DTPMXTMR_MASK)
#define DDRPHY_PGCR2_DTPMXTMR_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_DTPMXTMR_MASK) >> DDRPHY_PGCR2_DTPMXTMR_SHIFT)

/*
 * FXDLAT (R/W)
 *
 * Fixed Latency: Specified whether all reads should be returned to the controller with a fixed read latency. Enabling fixed read latency increases the read latency. Valid values are:
 * 0 = Disable fixed read latency 1 = Enable fixed read latency
 * Fixed read latency is calculated as (12 + (maximum DXnGTR.RxDGSL)/2) HDR clock cycles
 */
#define DDRPHY_PGCR2_FXDLAT_MASK (0x80000UL)
#define DDRPHY_PGCR2_FXDLAT_SHIFT (19U)
#define DDRPHY_PGCR2_FXDLAT_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_FXDLAT_SHIFT) & DDRPHY_PGCR2_FXDLAT_MASK)
#define DDRPHY_PGCR2_FXDLAT_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_FXDLAT_MASK) >> DDRPHY_PGCR2_FXDLAT_SHIFT)

