RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * NOBUB (R/W)
 *
 * No Bubbles: Specified whether reads should be returned to the controller with no bubbles. Enabling no-bubble reads increases the read latency. Valid values are: 0 = Bubbles are allowed during reads
 * 1 = Bubbles are not allowed during reads
 */
#define DDRPHY_PGCR2_NOBUB_MASK (0x40000UL)
#define DDRPHY_PGCR2_NOBUB_SHIFT (18U)
#define DDRPHY_PGCR2_NOBUB_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_NOBUB_SHIFT) & DDRPHY_PGCR2_NOBUB_MASK)
#define DDRPHY_PGCR2_NOBUB_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_NOBUB_MASK) >> DDRPHY_PGCR2_NOBUB_SHIFT)

/*
 * TREFPRD (R/W)
 *
 * Refresh Period: Indicates the period, after which the PUB has to issue a refresh command to the SDRAM. This is derived from the maximum refresh interval from the datasheet, tRFC(max) or REFI, divided by the clock cycle time. A further 400 clocks must be subtracted from the derived number to account for command flow and missed slots of refreshes in the internal PUB blocks. The default corresponds to DDR3 9*7.8us at 1066MHz when a burst of 9 refreshes are issued at every refresh interval.
 */
#define DDRPHY_PGCR2_TREFPRD_MASK (0x3FFFFUL)
#define DDRPHY_PGCR2_TREFPRD_SHIFT (0U)
#define DDRPHY_PGCR2_TREFPRD_SET(x) (((uint32_t)(x) << DDRPHY_PGCR2_TREFPRD_SHIFT) & DDRPHY_PGCR2_TREFPRD_MASK)
#define DDRPHY_PGCR2_TREFPRD_GET(x) (((uint32_t)(x) & DDRPHY_PGCR2_TREFPRD_MASK) >> DDRPHY_PGCR2_TREFPRD_SHIFT)

/* Bitfield definition for register: RDIMMGCR0 */
/*
 * MIRROR (R)
 *
 * RDIMM Mirror: Selects between two different ballouts of the RDIMM buffer chip for front or back operation. This register bit controls the buffer chip MIRROR signal.
 */
#define DDRPHY_RDIMMGCR0_MIRROR_MASK (0x80000000UL)
#define DDRPHY_RDIMMGCR0_MIRROR_SHIFT (31U)
#define DDRPHY_RDIMMGCR0_MIRROR_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_MIRROR_MASK) >> DDRPHY_RDIMMGCR0_MIRROR_SHIFT)

/*
 * QCSEN (R)
 *
 * RDMIMM Quad CS Enable: Enables, if set, the Quad CS mode for the RDIMM registering buffer chip. This register bit controls the buffer chip QCSEN# signal.
 */
#define DDRPHY_RDIMMGCR0_QCSEN_MASK (0x40000000UL)
#define DDRPHY_RDIMMGCR0_QCSEN_SHIFT (30U)
#define DDRPHY_RDIMMGCR0_QCSEN_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_QCSEN_MASK) >> DDRPHY_RDIMMGCR0_QCSEN_SHIFT)

/*
 * MIRROROE (R)
 *
 * MIRROR Output Enable: Enables, when set, the output driver on the I/O for MIRROR pin.
 */
#define DDRPHY_RDIMMGCR0_MIRROROE_MASK (0x20000000UL)
#define DDRPHY_RDIMMGCR0_MIRROROE_SHIFT (29U)
#define DDRPHY_RDIMMGCR0_MIRROROE_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_MIRROROE_MASK) >> DDRPHY_RDIMMGCR0_MIRROROE_SHIFT)

/*
 * QCSENOE (R)
 *
 * QCSEN# Output Enable: Enables, when set, the output driver on the I/O for QCSEN# pin.
 */
#define DDRPHY_RDIMMGCR0_QCSENOE_MASK (0x10000000UL)
#define DDRPHY_RDIMMGCR0_QCSENOE_SHIFT (28U)
#define DDRPHY_RDIMMGCR0_QCSENOE_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_QCSENOE_MASK) >> DDRPHY_RDIMMGCR0_QCSENOE_SHIFT)

/*
 * RDIMMIOM (R)
 *
 * RDIMM Outputs I/O Mode: Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for QCSEN# and MIRROR pins.
 */
#define DDRPHY_RDIMMGCR0_RDIMMIOM_MASK (0x8000000UL)
#define DDRPHY_RDIMMGCR0_RDIMMIOM_SHIFT (27U)
#define DDRPHY_RDIMMGCR0_RDIMMIOM_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_RDIMMIOM_MASK) >> DDRPHY_RDIMMGCR0_RDIMMIOM_SHIFT)

/*
 * RDIMMPDR (R)
 *
 * RDIMM Outputs Power Down Receiver: Powers down, when set, the input receiver on the I/O for QCSEN# and MIRROR pins.
 */
#define DDRPHY_RDIMMGCR0_RDIMMPDR_MASK (0x4000000UL)
#define DDRPHY_RDIMMGCR0_RDIMMPDR_SHIFT (26U)
#define DDRPHY_RDIMMGCR0_RDIMMPDR_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_RDIMMPDR_MASK) >> DDRPHY_RDIMMGCR0_RDIMMPDR_SHIFT)

/*
 * RDIMMPDD (R)
 *
 * RDIMM Outputs Power Down Driver: Powers down, when set, the output driver on the I/O for QCSEN# and MIRROR pins.
 */
#define DDRPHY_RDIMMGCR0_RDIMMPDD_MASK (0x2000000UL)
#define DDRPHY_RDIMMGCR0_RDIMMPDD_SHIFT (25U)
#define DDRPHY_RDIMMGCR0_RDIMMPDD_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_RDIMMPDD_MASK) >> DDRPHY_RDIMMGCR0_RDIMMPDD_SHIFT)

/*
 * RDIMMODT (R)
 *
 * RDIMM Outputs On-Die Termination: Enables, when set, the on-die termination on the I/O for QCSEN# and MIRROR pins.
 */
#define DDRPHY_RDIMMGCR0_RDIMMODT_MASK (0x1000000UL)
#define DDRPHY_RDIMMGCR0_RDIMMODT_SHIFT (24U)
#define DDRPHY_RDIMMGCR0_RDIMMODT_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_RDIMMODT_MASK) >> DDRPHY_RDIMMGCR0_RDIMMODT_SHIFT)

/*
 * ERROUTOE (R)
 *
 * ERROUT# Output Enable: Enables, when set, the output driver on the I/O for ERROUT# pin.
 */
#define DDRPHY_RDIMMGCR0_ERROUTOE_MASK (0x800000UL)
#define DDRPHY_RDIMMGCR0_ERROUTOE_SHIFT (23U)
#define DDRPHY_RDIMMGCR0_ERROUTOE_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_ERROUTOE_MASK) >> DDRPHY_RDIMMGCR0_ERROUTOE_SHIFT)

/*
 * ERROUTIOM (R)
 *
 * ERROUT# I/O Mode: Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for ERROUT# pin.
 */
#define DDRPHY_RDIMMGCR0_ERROUTIOM_MASK (0x400000UL)
#define DDRPHY_RDIMMGCR0_ERROUTIOM_SHIFT (22U)
#define DDRPHY_RDIMMGCR0_ERROUTIOM_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_ERROUTIOM_MASK) >> DDRPHY_RDIMMGCR0_ERROUTIOM_SHIFT)

/*
 * ERROUTPDR (R)
 *
 * ERROUT# Power Down Receiver: Powers down, when set, the input receiver on the I/O for ERROUT# pin.
 */
#define DDRPHY_RDIMMGCR0_ERROUTPDR_MASK (0x200000UL)
#define DDRPHY_RDIMMGCR0_ERROUTPDR_SHIFT (21U)
#define DDRPHY_RDIMMGCR0_ERROUTPDR_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_ERROUTPDR_MASK) >> DDRPHY_RDIMMGCR0_ERROUTPDR_SHIFT)

/*
 * ERROUTPDD (R)
 *
 * ERROUT# Power Down Driver: Powers down, when set, the output driver on the I/O for ERROUT# pin.
 */
#define DDRPHY_RDIMMGCR0_ERROUTPDD_MASK (0x100000UL)
#define DDRPHY_RDIMMGCR0_ERROUTPDD_SHIFT (20U)
#define DDRPHY_RDIMMGCR0_ERROUTPDD_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_ERROUTPDD_MASK) >> DDRPHY_RDIMMGCR0_ERROUTPDD_SHIFT)

/*
 * ERROUTODT (R)
 *
 * ERROUT# On-Die Termination: Enables, when set, the on-die termination on the I/O for ERROUT# pin.
 */
#define DDRPHY_RDIMMGCR0_ERROUTODT_MASK (0x80000UL)
#define DDRPHY_RDIMMGCR0_ERROUTODT_SHIFT (19U)
#define DDRPHY_RDIMMGCR0_ERROUTODT_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_ERROUTODT_MASK) >> DDRPHY_RDIMMGCR0_ERROUTODT_SHIFT)

