RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * PARINOE (R)
 *
 * PAR_IN Output Enable: Enables, when set, the output driver on the I/O for PAR_IN pin.
 */
#define DDRPHY_RDIMMGCR0_PARINOE_MASK (0x40000UL)
#define DDRPHY_RDIMMGCR0_PARINOE_SHIFT (18U)
#define DDRPHY_RDIMMGCR0_PARINOE_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_PARINOE_MASK) >> DDRPHY_RDIMMGCR0_PARINOE_SHIFT)

/*
 * PARINIOM (R)
 *
 * PAR_IN I/O Mode: Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for PAR_IN pin.
 */
#define DDRPHY_RDIMMGCR0_PARINIOM_MASK (0x20000UL)
#define DDRPHY_RDIMMGCR0_PARINIOM_SHIFT (17U)
#define DDRPHY_RDIMMGCR0_PARINIOM_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_PARINIOM_MASK) >> DDRPHY_RDIMMGCR0_PARINIOM_SHIFT)

/*
 * PARINPDR (R)
 *
 * PAR_IN Power Down Receiver: Powers down, when set, the input receiver on the I/O for PAR_IN pin.
 */
#define DDRPHY_RDIMMGCR0_PARINPDR_MASK (0x10000UL)
#define DDRPHY_RDIMMGCR0_PARINPDR_SHIFT (16U)
#define DDRPHY_RDIMMGCR0_PARINPDR_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_PARINPDR_MASK) >> DDRPHY_RDIMMGCR0_PARINPDR_SHIFT)

/*
 * PARINPDD (R)
 *
 * PAR_IN Power Down Driver: Powers down, when set, the output driver on the I/O for PAR_IN pin.
 */
#define DDRPHY_RDIMMGCR0_PARINPDD_MASK (0x8000U)
#define DDRPHY_RDIMMGCR0_PARINPDD_SHIFT (15U)
#define DDRPHY_RDIMMGCR0_PARINPDD_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_PARINPDD_MASK) >> DDRPHY_RDIMMGCR0_PARINPDD_SHIFT)

/*
 * PARINODT (R)
 *
 * PAR_IN On-Die Termination: Enables, when set, the on-die termination on the I/O for PAR_IN pin.
 */
#define DDRPHY_RDIMMGCR0_PARINODT_MASK (0x4000U)
#define DDRPHY_RDIMMGCR0_PARINODT_SHIFT (14U)
#define DDRPHY_RDIMMGCR0_PARINODT_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_PARINODT_MASK) >> DDRPHY_RDIMMGCR0_PARINODT_SHIFT)

/*
 * SOPERR (R)
 *
 * Stop On Parity Error: Indicates, if set, that the PUB is to stop driving commands to the DRAM upon encountering a parity error. Transactions can resume only after status is cleared via PIR.CLRSR.
 */
#define DDRPHY_RDIMMGCR0_SOPERR_MASK (0x4U)
#define DDRPHY_RDIMMGCR0_SOPERR_SHIFT (2U)
#define DDRPHY_RDIMMGCR0_SOPERR_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_SOPERR_MASK) >> DDRPHY_RDIMMGCR0_SOPERR_SHIFT)

/*
 * ERRNOREG (R)
 *
 * Parity Error No Registering: Indicates, if set, that parity error signal from the RDIMM should be passed to the DFI controller without any synchronization or registering. Otherwise, the error signal is synchronized as shown in Figure 4-30 on page 262.
 */
#define DDRPHY_RDIMMGCR0_ERRNOREG_MASK (0x2U)
#define DDRPHY_RDIMMGCR0_ERRNOREG_SHIFT (1U)
#define DDRPHY_RDIMMGCR0_ERRNOREG_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_ERRNOREG_MASK) >> DDRPHY_RDIMMGCR0_ERRNOREG_SHIFT)

/*
 * RDIMM (R)
 *
 * Registered DIMM: Indicates, if set, that a registered DIMM is used. In this case, the PUB increases the SDRAM write and read latencies (WL/RL) by 1 and also enforces that accesses adhere to RDIMM buffer chip. This only applies to PUB internal SDRAM transactions. Transactions generated by the controller must make its own adjustments to WL/RL when using a registered DIMM. The DCR.NOSRA register bit must be set to ‘1’ if using the standard RDIMM buffer chip so that normal DRAM accesses do not assert multiple chip select bits at the same time.
 */
#define DDRPHY_RDIMMGCR0_RDIMM_MASK (0x1U)
#define DDRPHY_RDIMMGCR0_RDIMM_SHIFT (0U)
#define DDRPHY_RDIMMGCR0_RDIMM_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR0_RDIMM_MASK) >> DDRPHY_RDIMMGCR0_RDIMM_SHIFT)

/* Bitfield definition for register: RDIMMGCR1 */
/*
 * CRINIT (R)
 *
 * Control Registers Initialization Enable: Indicates which RDIMM buffer chip control registers (RC0 to RC15) should be initialized (written) when the PUB is triggered to initialize the buffer chip. A setting of ‘1’ on CRINIT[n] bit means that CRn should be written during initialization.
 */
#define DDRPHY_RDIMMGCR1_CRINIT_MASK (0xFFFF0000UL)
#define DDRPHY_RDIMMGCR1_CRINIT_SHIFT (16U)
#define DDRPHY_RDIMMGCR1_CRINIT_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR1_CRINIT_MASK) >> DDRPHY_RDIMMGCR1_CRINIT_SHIFT)

/*
 * TBCMRD (R)
 *
 * Command word to command word programming delay: Number of DRAM clock cycles between two RDIMM buffer chip command programming accesses. The value used for tBCMRD is 8 plus the value programmed in these bits, i.e. tBCMRD value ranges from 8 to 15. This parameter corresponds to the buffer chip tMRD parameter.
 */
#define DDRPHY_RDIMMGCR1_TBCMRD_MASK (0x7000U)
#define DDRPHY_RDIMMGCR1_TBCMRD_SHIFT (12U)
#define DDRPHY_RDIMMGCR1_TBCMRD_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR1_TBCMRD_MASK) >> DDRPHY_RDIMMGCR1_TBCMRD_SHIFT)

/*
 * TBCSTAB (R)
 *
 * Stabilization time: Number of DRAM clock cycles for the RDIMM buffer chip to stabilize. This parameter corresponds to the buffer chip tSTAB parameter. Default value is in decimal format and corresponds to 6us at 533MHz.
 */
#define DDRPHY_RDIMMGCR1_TBCSTAB_MASK (0xFFFU)
#define DDRPHY_RDIMMGCR1_TBCSTAB_SHIFT (0U)
#define DDRPHY_RDIMMGCR1_TBCSTAB_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMGCR1_TBCSTAB_MASK) >> DDRPHY_RDIMMGCR1_TBCSTAB_SHIFT)

/* Bitfield definition for register: RDIMMCR0 */
/*
 * RC7 (R)
 *
 * Control Word 7: Reserved, free to use by vendor.
 */
#define DDRPHY_RDIMMCR0_RC7_MASK (0xF0000000UL)
#define DDRPHY_RDIMMCR0_RC7_SHIFT (28U)
#define DDRPHY_RDIMMCR0_RC7_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC7_MASK) >> DDRPHY_RDIMMCR0_RC7_SHIFT)

/*
 * RC6 (R)
 *
 * Control Word 6: Reserved, free to use by vendor.
 */
#define DDRPHY_RDIMMCR0_RC6_MASK (0xF000000UL)
#define DDRPHY_RDIMMCR0_RC6_SHIFT (24U)
#define DDRPHY_RDIMMCR0_RC6_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC6_MASK) >> DDRPHY_RDIMMCR0_RC6_SHIFT)

/*
 * RC5 (R)
 *
 * Control Word 5 (CK Driver Characteristics Control Word): RC5[1:0] is driver settings for clock Y1, Y1#, Y3, and Y3# outputs, and RC5[3:2] is driver settings for clock Y0, Y0#, Y2, and Y2# outputs. Bit definitions are:
 * 00 = Light drive (4 or 5 DRAM loads)
 * 01 = Moderate drive (8 or 10 DRAM loads)
 * 10 = Strong drive (16 or 20 DRAM loads)
 * 11 = Reserved
 */
#define DDRPHY_RDIMMCR0_RC5_MASK (0xF00000UL)
#define DDRPHY_RDIMMCR0_RC5_SHIFT (20U)
#define DDRPHY_RDIMMCR0_RC5_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC5_MASK) >> DDRPHY_RDIMMCR0_RC5_SHIFT)

