RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * RC4 (R)
 *
 * Control Word 4 (Control Signals Driver Characteristics Control Word): RC4[1:0] is driver settings for control A outputs, and RC4[3:2] is driver settings for control B outputs. Bit definitions are:
 * 00 = Light drive (4 or 5 DRAM loads)
 * 01 = Moderate drive (8 or 10 DRAM loads)
 * 10 = Reserved
 * 11 = Reserved
 */
#define DDRPHY_RDIMMCR0_RC4_MASK (0xF0000UL)
#define DDRPHY_RDIMMCR0_RC4_SHIFT (16U)
#define DDRPHY_RDIMMCR0_RC4_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC4_MASK) >> DDRPHY_RDIMMCR0_RC4_SHIFT)

/*
 * RC3 (R)
 *
 * Control Word 3 (Command/Address Signals Driver Characteristics Control Word): RC3[1:0] is driver settings for command/address A outputs, and RC3[3:2] is driver settings for command/address B outputs. Bit definitions are:
 * 00 = Light drive (4 or 5 DRAM loads)
 * 01 = Moderate drive (8 or 10 DRAM loads)
 * 10 = Strong drive (16 or 20 DRAM loads)
 * 11 = Reserved
 */
#define DDRPHY_RDIMMCR0_RC3_MASK (0xF000U)
#define DDRPHY_RDIMMCR0_RC3_SHIFT (12U)
#define DDRPHY_RDIMMCR0_RC3_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC3_MASK) >> DDRPHY_RDIMMCR0_RC3_SHIFT)

/*
 * RC2 (R)
 *
 * Control Word 2 (Timing Control Word): Bit definitions are:
 * RC2[0]: 0 = Standard (1/2 clock) pre-launch, 1 = Prelaunch controlled by RC12. RC2[1]: 0 = Reserved.
 * RC2[2]: 0 = 100 Ohm input bus termination, 1 = 150 Ohm input bus termination. RC2[3]: 0 = Operation frequency band 1, 1 = Test mode frequency band 2.
 */
#define DDRPHY_RDIMMCR0_RC2_MASK (0xF00U)
#define DDRPHY_RDIMMCR0_RC2_SHIFT (8U)
#define DDRPHY_RDIMMCR0_RC2_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC2_MASK) >> DDRPHY_RDIMMCR0_RC2_SHIFT)

/*
 * RC1 (R)
 *
 * Control Word 1 (Clock Driver Enable Control Word): Bit definitions are: RC1[0]: 0 = Y0/Y0# clock enabled, 1 = Y0/Y0# clock disabled.
 * RC1[1]: 0 = Y1/Y1# clock enabled, 1 = Y1/Y1# clock disabled. RC1[2]: 0 = Y2/Y2# clock enabled, 1 = Y2/Y2# clock disabled. RC1[3]: 0 = Y3/Y3# clock enabled, 1 = Y3/Y3# clock disabled.
 */
#define DDRPHY_RDIMMCR0_RC1_MASK (0xF0U)
#define DDRPHY_RDIMMCR0_RC1_SHIFT (4U)
#define DDRPHY_RDIMMCR0_RC1_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC1_MASK) >> DDRPHY_RDIMMCR0_RC1_SHIFT)

/*
 * RC0 (R)
 *
 * Control Word 0 (Global Features Control Word): Bit definitions are: RC0[0]: 0 = Output inversion enabled, 1 = Output inversion disabled. RC0[1]: 0 = Floating outputs disabled, 1 = Floating outputs enabled. RC0[2]: 0 = A outputs enabled, 1 = A outputs disabled.
 * RC0[3]: 0 = B outputs enabled, 1 = B outputs disabled.
 */
#define DDRPHY_RDIMMCR0_RC0_MASK (0xFU)
#define DDRPHY_RDIMMCR0_RC0_SHIFT (0U)
#define DDRPHY_RDIMMCR0_RC0_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR0_RC0_MASK) >> DDRPHY_RDIMMCR0_RC0_SHIFT)

/* Bitfield definition for register: RDIMMCR1 */
/*
 * RC15 (R)
 *
 * Control Word 15: Reserved for future use.
 */
#define DDRPHY_RDIMMCR1_RC15_MASK (0xF0000000UL)
#define DDRPHY_RDIMMCR1_RC15_SHIFT (28U)
#define DDRPHY_RDIMMCR1_RC15_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC15_MASK) >> DDRPHY_RDIMMCR1_RC15_SHIFT)

/*
 * RC14 (R)
 *
 * Control Word 14: Reserved for future use.
 */
#define DDRPHY_RDIMMCR1_RC14_MASK (0xF000000UL)
#define DDRPHY_RDIMMCR1_RC14_SHIFT (24U)
#define DDRPHY_RDIMMCR1_RC14_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC14_MASK) >> DDRPHY_RDIMMCR1_RC14_SHIFT)

/*
 * RC13 (R)
 *
 * Control Word 13: Reserved for future use.
 */
#define DDRPHY_RDIMMCR1_RC13_MASK (0xF00000UL)
#define DDRPHY_RDIMMCR1_RC13_SHIFT (20U)
#define DDRPHY_RDIMMCR1_RC13_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC13_MASK) >> DDRPHY_RDIMMCR1_RC13_SHIFT)

/*
 * RC12 (R)
 *
 * Control Word 12: Reserved for future use.
 */
#define DDRPHY_RDIMMCR1_RC12_MASK (0xF0000UL)
#define DDRPHY_RDIMMCR1_RC12_SHIFT (16U)
#define DDRPHY_RDIMMCR1_RC12_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC12_MASK) >> DDRPHY_RDIMMCR1_RC12_SHIFT)

/*
 * RC11 (R)
 *
 * Control Word 11 (Operating Voltage VDD Control Word): RC10[1:0] is VDD operating voltage setting as follows: 00 = DDR3 1.5V mode
 * 01 = DDR3L 1.35V mode
 * 10 = Reserved
 * 11 = Reserved RC10[3:2]: Reserved.
 */
#define DDRPHY_RDIMMCR1_RC11_MASK (0xF000U)
#define DDRPHY_RDIMMCR1_RC11_SHIFT (12U)
#define DDRPHY_RDIMMCR1_RC11_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC11_MASK) >> DDRPHY_RDIMMCR1_RC11_SHIFT)

/*
 * RC10 (R)
 *
 * Control Word 10 (RDIMM Operating Speed Control Word): RC10[2:0] is RDIMM operating speed setting as follows: 000 = DDR3/DDR3L-800
 * 001 = DDR3/DDR3L-1066
 * 010 = DDR3/DDR3L-1333
 * 011 = DDR3/DDR3L-1600
 * 100 = Reserved
 * 101 = Reserved
 * 110 = Reserved
 * 111 = Reserved RC10[3]: Don’t care.
 */
#define DDRPHY_RDIMMCR1_RC10_MASK (0xF00U)
#define DDRPHY_RDIMMCR1_RC10_SHIFT (8U)
#define DDRPHY_RDIMMCR1_RC10_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC10_MASK) >> DDRPHY_RDIMMCR1_RC10_SHIFT)

/*
 * RC9 (R)
 *
 * Control Word 9 (Power Saving Settings Control Word): Bit definitions are: RC9[0]: 0 = Floating outputs as defined in RC0, 1 = Weak drive enabled. RC9[1]: 0 = Reserved.
 * RC9[2]: 0 = CKE power down with IBT ON, QxODT is a function of DxODT, 1 = CKE power down with IBT off, QxODT held LOW. RC9[2] is valid only when RC9[3] is 1.
 * RC9[3]: 0 = CKE power down mode disabled, 1 = CKE power down mode enabled.
 */
#define DDRPHY_RDIMMCR1_RC9_MASK (0xF0U)
#define DDRPHY_RDIMMCR1_RC9_SHIFT (4U)
#define DDRPHY_RDIMMCR1_RC9_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC9_MASK) >> DDRPHY_RDIMMCR1_RC9_SHIFT)

/*
 * RC8 (R)
 *
 * Control Word 8 (Additional Input Bus Termination Setting Control Word): RC8[2:0] is Input Bus Termination (IBT) setting as follows:
 * 000 = IBT as defined in RC2. 001 = Reserved
 * 010 = 200 Ohm
 * 011 = Reserved
 * 100 = 300 Ohm
 * 101 = Reserved
 * 110 = Reserved
 * 111 = Off
 * RC8[3]: 0 = IBT off when MIRROR is HIGH, 1 = IBT on when MIRROR is high
 */
#define DDRPHY_RDIMMCR1_RC8_MASK (0xFU)
#define DDRPHY_RDIMMCR1_RC8_SHIFT (0U)
#define DDRPHY_RDIMMCR1_RC8_GET(x) (((uint32_t)(x) & DDRPHY_RDIMMCR1_RC8_MASK) >> DDRPHY_RDIMMCR1_RC8_SHIFT)

/* Bitfield definition for register: DCUAR */
/*
 * ATYPE (R/W)
 *
 * Access Type: Specifies the type of access to be performed using this address. Valid values are:
 * 0 = Write access 1 = Read access
 */
#define DDRPHY_DCUAR_ATYPE_MASK (0x800U)
#define DDRPHY_DCUAR_ATYPE_SHIFT (11U)
#define DDRPHY_DCUAR_ATYPE_SET(x) (((uint32_t)(x) << DDRPHY_DCUAR_ATYPE_SHIFT) & DDRPHY_DCUAR_ATYPE_MASK)
#define DDRPHY_DCUAR_ATYPE_GET(x) (((uint32_t)(x) & DDRPHY_DCUAR_ATYPE_MASK) >> DDRPHY_DCUAR_ATYPE_SHIFT)

