RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * INCA (R/W)
 *
 * Increment Address: Specifies, if set, that the cache address specified in WADDR and SADDR should be automatically incremented after each access of the cache. The increment happens in such a way that all the slices of a selected word are first accessed before going to the next word.
 */
#define DDRPHY_DCUAR_INCA_MASK (0x400U)
#define DDRPHY_DCUAR_INCA_SHIFT (10U)
#define DDRPHY_DCUAR_INCA_SET(x) (((uint32_t)(x) << DDRPHY_DCUAR_INCA_SHIFT) & DDRPHY_DCUAR_INCA_MASK)
#define DDRPHY_DCUAR_INCA_GET(x) (((uint32_t)(x) & DDRPHY_DCUAR_INCA_MASK) >> DDRPHY_DCUAR_INCA_SHIFT)

/*
 * CSEL (R/W)
 *
 * Cache Select: Selects the cache to be accessed. Valid values are: 00 = Command cache
 * 01 = Expected data cache 10 = Read data cache
 * 11 = Reserved
 */
#define DDRPHY_DCUAR_CSEL_MASK (0x300U)
#define DDRPHY_DCUAR_CSEL_SHIFT (8U)
#define DDRPHY_DCUAR_CSEL_SET(x) (((uint32_t)(x) << DDRPHY_DCUAR_CSEL_SHIFT) & DDRPHY_DCUAR_CSEL_MASK)
#define DDRPHY_DCUAR_CSEL_GET(x) (((uint32_t)(x) & DDRPHY_DCUAR_CSEL_MASK) >> DDRPHY_DCUAR_CSEL_SHIFT)

/*
 * CSADDR (R/W)
 *
 * Cache Slice Address: Address of the cache slice to be accessed.
 */
#define DDRPHY_DCUAR_CSADDR_MASK (0xF0U)
#define DDRPHY_DCUAR_CSADDR_SHIFT (4U)
#define DDRPHY_DCUAR_CSADDR_SET(x) (((uint32_t)(x) << DDRPHY_DCUAR_CSADDR_SHIFT) & DDRPHY_DCUAR_CSADDR_MASK)
#define DDRPHY_DCUAR_CSADDR_GET(x) (((uint32_t)(x) & DDRPHY_DCUAR_CSADDR_MASK) >> DDRPHY_DCUAR_CSADDR_SHIFT)

/*
 * CWADDR (R/W)
 *
 * Cache Word Address: Address of the cache word to be accessed.
 */
#define DDRPHY_DCUAR_CWADDR_MASK (0xFU)
#define DDRPHY_DCUAR_CWADDR_SHIFT (0U)
#define DDRPHY_DCUAR_CWADDR_SET(x) (((uint32_t)(x) << DDRPHY_DCUAR_CWADDR_SHIFT) & DDRPHY_DCUAR_CWADDR_MASK)
#define DDRPHY_DCUAR_CWADDR_GET(x) (((uint32_t)(x) & DDRPHY_DCUAR_CWADDR_MASK) >> DDRPHY_DCUAR_CWADDR_SHIFT)

/* Bitfield definition for register: DCUDR */
/*
 * CDATA (R/W)
 *
 * Cache Data: Data to be written to or read from a cache. This data corresponds to the cache word slice specified by the DCU Address Register.
 */
#define DDRPHY_DCUDR_CDATA_MASK (0xFFFFFFFFUL)
#define DDRPHY_DCUDR_CDATA_SHIFT (0U)
#define DDRPHY_DCUDR_CDATA_SET(x) (((uint32_t)(x) << DDRPHY_DCUDR_CDATA_SHIFT) & DDRPHY_DCUDR_CDATA_MASK)
#define DDRPHY_DCUDR_CDATA_GET(x) (((uint32_t)(x) & DDRPHY_DCUDR_CDATA_MASK) >> DDRPHY_DCUDR_CDATA_SHIFT)

/* Bitfield definition for register: DCURR */
/*
 * XCEN (R/W)
 *
 * Expected Compare Enable: Indicates, if set, that read data coming back from the SDRAM should be should be compared with the expected data.
 */
#define DDRPHY_DCURR_XCEN_MASK (0x800000UL)
#define DDRPHY_DCURR_XCEN_SHIFT (23U)
#define DDRPHY_DCURR_XCEN_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_XCEN_SHIFT) & DDRPHY_DCURR_XCEN_MASK)
#define DDRPHY_DCURR_XCEN_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_XCEN_MASK) >> DDRPHY_DCURR_XCEN_SHIFT)

/*
 * RCEN (R/W)
 *
 * Read Capture Enable: Indicates, if set, that read data coming back from the SDRAM should be captured into the read data cache.
 */
#define DDRPHY_DCURR_RCEN_MASK (0x400000UL)
#define DDRPHY_DCURR_RCEN_SHIFT (22U)
#define DDRPHY_DCURR_RCEN_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_RCEN_SHIFT) & DDRPHY_DCURR_RCEN_MASK)
#define DDRPHY_DCURR_RCEN_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_RCEN_MASK) >> DDRPHY_DCURR_RCEN_SHIFT)

/*
 * SCOF (R/W)
 *
 * Stop Capture On Full: Specifies, if set, that the capture of read data should stop when the capture cache is full.
 */
#define DDRPHY_DCURR_SCOF_MASK (0x200000UL)
#define DDRPHY_DCURR_SCOF_SHIFT (21U)
#define DDRPHY_DCURR_SCOF_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_SCOF_SHIFT) & DDRPHY_DCURR_SCOF_MASK)
#define DDRPHY_DCURR_SCOF_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_SCOF_MASK) >> DDRPHY_DCURR_SCOF_SHIFT)

/*
 * SONF (R/W)
 *
 * Stop On Nth Fail: Specifies, if set, that the execution of commands and the capture of read data should stop when there are N read data failures. The number of failures is specified by NFAIL. Otherwise commands execute until the end of the program or until manually stopped using a STOP command.
 */
#define DDRPHY_DCURR_SONF_MASK (0x100000UL)
#define DDRPHY_DCURR_SONF_SHIFT (20U)
#define DDRPHY_DCURR_SONF_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_SONF_SHIFT) & DDRPHY_DCURR_SONF_MASK)
#define DDRPHY_DCURR_SONF_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_SONF_MASK) >> DDRPHY_DCURR_SONF_SHIFT)

/*
 * NFAIL (R/W)
 *
 * Number of Failures: Specifies the number of failures after which the execution of commands and the capture of read data should stop if SONF bit of this register is set. Execution of commands and the capture of read data will stop after (NFAIL+1) failures if SONF is set.
 * Valid values are from 0 to 254.
 */
#define DDRPHY_DCURR_NFAIL_MASK (0xFF000UL)
#define DDRPHY_DCURR_NFAIL_SHIFT (12U)
#define DDRPHY_DCURR_NFAIL_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_NFAIL_SHIFT) & DDRPHY_DCURR_NFAIL_MASK)
#define DDRPHY_DCURR_NFAIL_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_NFAIL_MASK) >> DDRPHY_DCURR_NFAIL_SHIFT)

/*
 * EADDR (R/W)
 *
 * End Address: Cache word address where the execution of command should end.
 */
#define DDRPHY_DCURR_EADDR_MASK (0xF00U)
#define DDRPHY_DCURR_EADDR_SHIFT (8U)
#define DDRPHY_DCURR_EADDR_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_EADDR_SHIFT) & DDRPHY_DCURR_EADDR_MASK)
#define DDRPHY_DCURR_EADDR_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_EADDR_MASK) >> DDRPHY_DCURR_EADDR_SHIFT)

/*
 * SADDR (R/W)
 *
 * Start Address: Cache word address where the execution of commands should begin.
 */
#define DDRPHY_DCURR_SADDR_MASK (0xF0U)
#define DDRPHY_DCURR_SADDR_SHIFT (4U)
#define DDRPHY_DCURR_SADDR_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_SADDR_SHIFT) & DDRPHY_DCURR_SADDR_MASK)
#define DDRPHY_DCURR_SADDR_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_SADDR_MASK) >> DDRPHY_DCURR_SADDR_SHIFT)

/*
 * DINST (R/W)
 *
 * DCU Instruction: Selects the DCU command to be executed: Valid values are: 0000 = NOP: No operation
 * 0001 = Run: Triggers the execution of commands in the command cache. 0010 = Stop: Stops the execution of commands in the command cache.
 * 0011 = Stop Loop: Stops the execution of an infinite loop in the command cache. 0100 = Reset: Resets all DCU run time registers. See “DCU Status” on page 255 for details.
 * 0101 – 1111 Reserved
 */
#define DDRPHY_DCURR_DINST_MASK (0xFU)
#define DDRPHY_DCURR_DINST_SHIFT (0U)
#define DDRPHY_DCURR_DINST_SET(x) (((uint32_t)(x) << DDRPHY_DCURR_DINST_SHIFT) & DDRPHY_DCURR_DINST_MASK)
#define DDRPHY_DCURR_DINST_GET(x) (((uint32_t)(x) & DDRPHY_DCURR_DINST_MASK) >> DDRPHY_DCURR_DINST_SHIFT)

