RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/* Bitfield definition for register: DCULR */
/*
 * XLEADDR (R/W)
 *
 * Expected Data Loop End Address: The last expected data cache word address that contains valid expected data. Expected data should looped between 0 and this address.
 * XLEADDR field uses only the following bits based on the cache depth:
 * DCU expected data cache = 4, XLEADDR[1:0]
 * DCU expected data cache = 8, XLEADDR[2:0]
 * DCU expected data cache = 16, XLEADDR[3:0]
 */
#define DDRPHY_DCULR_XLEADDR_MASK (0xF0000000UL)
#define DDRPHY_DCULR_XLEADDR_SHIFT (28U)
#define DDRPHY_DCULR_XLEADDR_SET(x) (((uint32_t)(x) << DDRPHY_DCULR_XLEADDR_SHIFT) & DDRPHY_DCULR_XLEADDR_MASK)
#define DDRPHY_DCULR_XLEADDR_GET(x) (((uint32_t)(x) & DDRPHY_DCULR_XLEADDR_MASK) >> DDRPHY_DCULR_XLEADDR_SHIFT)

/*
 * IDA (R/W)
 *
 * Increment DRAM Address: Indicates, if set, that DRAM addresses should be incremented every time a DRAM read/write command inside the loop is executed.
 */
#define DDRPHY_DCULR_IDA_MASK (0x20000UL)
#define DDRPHY_DCULR_IDA_SHIFT (17U)
#define DDRPHY_DCULR_IDA_SET(x) (((uint32_t)(x) << DDRPHY_DCULR_IDA_SHIFT) & DDRPHY_DCULR_IDA_MASK)
#define DDRPHY_DCULR_IDA_GET(x) (((uint32_t)(x) & DDRPHY_DCULR_IDA_MASK) >> DDRPHY_DCULR_IDA_SHIFT)

/*
 * LINF (R/W)
 *
 * Loop Infinite: Indicates, if set, that the loop should be executed indefinitely until stopped by the STOP command. Otherwise the loop is execute LCNT times.
 */
#define DDRPHY_DCULR_LINF_MASK (0x10000UL)
#define DDRPHY_DCULR_LINF_SHIFT (16U)
#define DDRPHY_DCULR_LINF_SET(x) (((uint32_t)(x) << DDRPHY_DCULR_LINF_SHIFT) & DDRPHY_DCULR_LINF_MASK)
#define DDRPHY_DCULR_LINF_GET(x) (((uint32_t)(x) & DDRPHY_DCULR_LINF_MASK) >> DDRPHY_DCULR_LINF_SHIFT)

/*
 * LCNT (R/W)
 *
 * Loop Count: The number of times that the loop should be executed if LINF is not set.
 */
#define DDRPHY_DCULR_LCNT_MASK (0xFF00U)
#define DDRPHY_DCULR_LCNT_SHIFT (8U)
#define DDRPHY_DCULR_LCNT_SET(x) (((uint32_t)(x) << DDRPHY_DCULR_LCNT_SHIFT) & DDRPHY_DCULR_LCNT_MASK)
#define DDRPHY_DCULR_LCNT_GET(x) (((uint32_t)(x) & DDRPHY_DCULR_LCNT_MASK) >> DDRPHY_DCULR_LCNT_SHIFT)

/*
 * LEADDR (R/W)
 *
 * Loop End Address: Command cache word address where the loop should end.
 */
#define DDRPHY_DCULR_LEADDR_MASK (0xF0U)
#define DDRPHY_DCULR_LEADDR_SHIFT (4U)
#define DDRPHY_DCULR_LEADDR_SET(x) (((uint32_t)(x) << DDRPHY_DCULR_LEADDR_SHIFT) & DDRPHY_DCULR_LEADDR_MASK)
#define DDRPHY_DCULR_LEADDR_GET(x) (((uint32_t)(x) & DDRPHY_DCULR_LEADDR_MASK) >> DDRPHY_DCULR_LEADDR_SHIFT)

/*
 * LSADDR (R/W)
 *
 * Loop Start Address: Command cache word address where the loop should start.
 */
#define DDRPHY_DCULR_LSADDR_MASK (0xFU)
#define DDRPHY_DCULR_LSADDR_SHIFT (0U)
#define DDRPHY_DCULR_LSADDR_SET(x) (((uint32_t)(x) << DDRPHY_DCULR_LSADDR_SHIFT) & DDRPHY_DCULR_LSADDR_MASK)
#define DDRPHY_DCULR_LSADDR_GET(x) (((uint32_t)(x) & DDRPHY_DCULR_LSADDR_MASK) >> DDRPHY_DCULR_LSADDR_SHIFT)

/* Bitfield definition for register: DCUGCR */
/*
 * RCSW (R/W)
 *
 * Read Capture Start Word: The capture and compare of read data should start after Nth word. For example setting this value to 12 will skip the first 12 read data.
 */
#define DDRPHY_DCUGCR_RCSW_MASK (0xFFFFU)
#define DDRPHY_DCUGCR_RCSW_SHIFT (0U)
#define DDRPHY_DCUGCR_RCSW_SET(x) (((uint32_t)(x) << DDRPHY_DCUGCR_RCSW_SHIFT) & DDRPHY_DCUGCR_RCSW_MASK)
#define DDRPHY_DCUGCR_RCSW_GET(x) (((uint32_t)(x) & DDRPHY_DCUGCR_RCSW_MASK) >> DDRPHY_DCUGCR_RCSW_SHIFT)

/* Bitfield definition for register: DCUTPR */
/*
 * TDCUT3 (R/W)
 *
 * DCU Generic Timing Parameter 3
 */
#define DDRPHY_DCUTPR_TDCUT3_MASK (0xFF000000UL)
#define DDRPHY_DCUTPR_TDCUT3_SHIFT (24U)
#define DDRPHY_DCUTPR_TDCUT3_SET(x) (((uint32_t)(x) << DDRPHY_DCUTPR_TDCUT3_SHIFT) & DDRPHY_DCUTPR_TDCUT3_MASK)
#define DDRPHY_DCUTPR_TDCUT3_GET(x) (((uint32_t)(x) & DDRPHY_DCUTPR_TDCUT3_MASK) >> DDRPHY_DCUTPR_TDCUT3_SHIFT)

/*
 * TDCUT2 (R/W)
 *
 * DCU Generic Timing Parameter 2
 */
#define DDRPHY_DCUTPR_TDCUT2_MASK (0xFF0000UL)
#define DDRPHY_DCUTPR_TDCUT2_SHIFT (16U)
#define DDRPHY_DCUTPR_TDCUT2_SET(x) (((uint32_t)(x) << DDRPHY_DCUTPR_TDCUT2_SHIFT) & DDRPHY_DCUTPR_TDCUT2_MASK)
#define DDRPHY_DCUTPR_TDCUT2_GET(x) (((uint32_t)(x) & DDRPHY_DCUTPR_TDCUT2_MASK) >> DDRPHY_DCUTPR_TDCUT2_SHIFT)

/*
 * TDCUT1 (R/W)
 *
 * DCU Generic Timing Parameter 1
 */
#define DDRPHY_DCUTPR_TDCUT1_MASK (0xFF00U)
#define DDRPHY_DCUTPR_TDCUT1_SHIFT (8U)
#define DDRPHY_DCUTPR_TDCUT1_SET(x) (((uint32_t)(x) << DDRPHY_DCUTPR_TDCUT1_SHIFT) & DDRPHY_DCUTPR_TDCUT1_MASK)
#define DDRPHY_DCUTPR_TDCUT1_GET(x) (((uint32_t)(x) & DDRPHY_DCUTPR_TDCUT1_MASK) >> DDRPHY_DCUTPR_TDCUT1_SHIFT)

/*
 * TDCUT0 (R/W)
 *
 * DCU Generic Timing Parameter 0
 */
#define DDRPHY_DCUTPR_TDCUT0_MASK (0xFFU)
#define DDRPHY_DCUTPR_TDCUT0_SHIFT (0U)
#define DDRPHY_DCUTPR_TDCUT0_SET(x) (((uint32_t)(x) << DDRPHY_DCUTPR_TDCUT0_SHIFT) & DDRPHY_DCUTPR_TDCUT0_MASK)
#define DDRPHY_DCUTPR_TDCUT0_GET(x) (((uint32_t)(x) & DDRPHY_DCUTPR_TDCUT0_MASK) >> DDRPHY_DCUTPR_TDCUT0_SHIFT)

/* Bitfield definition for register: DCUSR0 */
/*
 * CFULL (R)
 *
 * Capture Full: Indicates, if set, that the capture cache is full.
 */
#define DDRPHY_DCUSR0_CFULL_MASK (0x4U)
#define DDRPHY_DCUSR0_CFULL_SHIFT (2U)
#define DDRPHY_DCUSR0_CFULL_GET(x) (((uint32_t)(x) & DDRPHY_DCUSR0_CFULL_MASK) >> DDRPHY_DCUSR0_CFULL_SHIFT)

/*
 * CFAIL (R)
 *
 * Capture Fail: Indicates, if set, that at least one read data word has failed.
 */
#define DDRPHY_DCUSR0_CFAIL_MASK (0x2U)
#define DDRPHY_DCUSR0_CFAIL_SHIFT (1U)
#define DDRPHY_DCUSR0_CFAIL_GET(x) (((uint32_t)(x) & DDRPHY_DCUSR0_CFAIL_MASK) >> DDRPHY_DCUSR0_CFAIL_SHIFT)

/*
 * RDONE (R)
 *
 * Run Done: Indicates, if set, that the DCU has finished executing the commands in the command cache. This bit is also set to indicate that a STOP command has successfully been executed and command execution has stopped.
 */
#define DDRPHY_DCUSR0_RDONE_MASK (0x1U)
#define DDRPHY_DCUSR0_RDONE_SHIFT (0U)
#define DDRPHY_DCUSR0_RDONE_GET(x) (((uint32_t)(x) & DDRPHY_DCUSR0_RDONE_MASK) >> DDRPHY_DCUSR0_RDONE_SHIFT)

/* Bitfield definition for register: DCUSR1 */
/*
 * LPCNT (R)
 *
 * Loop Count: Indicates the value of the loop count. This is useful when the program has stopped because of failures to assess how many reads were executed before first fail.
 */
#define DDRPHY_DCUSR1_LPCNT_MASK (0xFF000000UL)
#define DDRPHY_DCUSR1_LPCNT_SHIFT (24U)
#define DDRPHY_DCUSR1_LPCNT_GET(x) (((uint32_t)(x) & DDRPHY_DCUSR1_LPCNT_MASK) >> DDRPHY_DCUSR1_LPCNT_SHIFT)

