RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * FLCNT (R)
 *
 * Fail Count: Number of read words that have failed.
 */
#define DDRPHY_DCUSR1_FLCNT_MASK (0xFF0000UL)
#define DDRPHY_DCUSR1_FLCNT_SHIFT (16U)
#define DDRPHY_DCUSR1_FLCNT_GET(x) (((uint32_t)(x) & DDRPHY_DCUSR1_FLCNT_MASK) >> DDRPHY_DCUSR1_FLCNT_SHIFT)

/*
 * RDCNT (R)
 *
 * Read Count: Number of read words returned from the SDRAM.
 */
#define DDRPHY_DCUSR1_RDCNT_MASK (0xFFFFU)
#define DDRPHY_DCUSR1_RDCNT_SHIFT (0U)
#define DDRPHY_DCUSR1_RDCNT_GET(x) (((uint32_t)(x) & DDRPHY_DCUSR1_RDCNT_MASK) >> DDRPHY_DCUSR1_RDCNT_SHIFT)

/* Bitfield definition for register: BISTRR */
/*
 * BCCSEL (R/W)
 *
 * BIST Clock Cycle Select: Selects the clock numbers on which the AC loopback data is written into the FIFO. Data is written into the loopback FIFO once every four clock cycles. Valid values are:
 * 00 = Clock cycle 0, 4, 8, 12, etc.
 * 01 = Clock cycle 1, 5, 9, 13, etc.
 * 10 = Clock cycle 2, 6, 10, 14, etc.
 * 11 = Clock cycle 3, 7, 11, 15, etc.
 */
#define DDRPHY_BISTRR_BCCSEL_MASK (0x6000000UL)
#define DDRPHY_BISTRR_BCCSEL_SHIFT (25U)
#define DDRPHY_BISTRR_BCCSEL_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BCCSEL_SHIFT) & DDRPHY_BISTRR_BCCSEL_MASK)
#define DDRPHY_BISTRR_BCCSEL_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BCCSEL_MASK) >> DDRPHY_BISTRR_BCCSEL_SHIFT)

/*
 * BCKSEL (R/W)
 *
 * BIST CK Select: Selects the CK that should be used to register the AC loopback signals from the I/Os. Valid values are:
 * 00 = CK[0]
 * 01 = CK[1]
 * 10 = CK[2]
 * 11 = Reserved
 */
#define DDRPHY_BISTRR_BCKSEL_MASK (0x1800000UL)
#define DDRPHY_BISTRR_BCKSEL_SHIFT (23U)
#define DDRPHY_BISTRR_BCKSEL_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BCKSEL_SHIFT) & DDRPHY_BISTRR_BCKSEL_MASK)
#define DDRPHY_BISTRR_BCKSEL_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BCKSEL_MASK) >> DDRPHY_BISTRR_BCKSEL_SHIFT)

/*
 * BDXSEL (R/W)
 *
 * BIST DATX8 Select: Select the byte lane for comparison of loopback/read data. Valid values are 0 to 8.
 */
#define DDRPHY_BISTRR_BDXSEL_MASK (0x780000UL)
#define DDRPHY_BISTRR_BDXSEL_SHIFT (19U)
#define DDRPHY_BISTRR_BDXSEL_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BDXSEL_SHIFT) & DDRPHY_BISTRR_BDXSEL_MASK)
#define DDRPHY_BISTRR_BDXSEL_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BDXSEL_MASK) >> DDRPHY_BISTRR_BDXSEL_SHIFT)

/*
 * BDPAT (R/W)
 *
 * BIST Data Pattern: Selects the data pattern used during BIST. Valid values are: 00 = Walking 0
 * 01 = Walking 1
 * 10 = LFSR-based pseudo-random
 * 11 = User programmable (Not valid for AC loopback).
 */
#define DDRPHY_BISTRR_BDPAT_MASK (0x60000UL)
#define DDRPHY_BISTRR_BDPAT_SHIFT (17U)
#define DDRPHY_BISTRR_BDPAT_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BDPAT_SHIFT) & DDRPHY_BISTRR_BDPAT_MASK)
#define DDRPHY_BISTRR_BDPAT_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BDPAT_MASK) >> DDRPHY_BISTRR_BDPAT_SHIFT)

/*
 * BDMEN (R/W)
 *
 * BIST Data Mask Enable: Enables, if set, that the data mask BIST should be included in the BIST run, i.e. data pattern generated and loopback data compared. This is valid only for loopback mode.
 */
#define DDRPHY_BISTRR_BDMEN_MASK (0x10000UL)
#define DDRPHY_BISTRR_BDMEN_SHIFT (16U)
#define DDRPHY_BISTRR_BDMEN_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BDMEN_SHIFT) & DDRPHY_BISTRR_BDMEN_MASK)
#define DDRPHY_BISTRR_BDMEN_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BDMEN_MASK) >> DDRPHY_BISTRR_BDMEN_SHIFT)

/*
 * BACEN (R/W)
 *
 * BIST AC Enable: Enables the running of BIST on the address/command lane PHY. This bit is exclusive with BDXEN, i.e. both cannot be set to ‘1’ at the same time.
 */
#define DDRPHY_BISTRR_BACEN_MASK (0x8000U)
#define DDRPHY_BISTRR_BACEN_SHIFT (15U)
#define DDRPHY_BISTRR_BACEN_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BACEN_SHIFT) & DDRPHY_BISTRR_BACEN_MASK)
#define DDRPHY_BISTRR_BACEN_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BACEN_MASK) >> DDRPHY_BISTRR_BACEN_SHIFT)

/*
 * BDXEN (R/W)
 *
 * BIST DATX8 Enable: Enables the running of BIST on the data byte lane PHYs. This bit is exclusive with BACEN, i.e. both cannot be set to ‘1’ at the same time.
 */
#define DDRPHY_BISTRR_BDXEN_MASK (0x4000U)
#define DDRPHY_BISTRR_BDXEN_SHIFT (14U)
#define DDRPHY_BISTRR_BDXEN_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BDXEN_SHIFT) & DDRPHY_BISTRR_BDXEN_MASK)
#define DDRPHY_BISTRR_BDXEN_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BDXEN_MASK) >> DDRPHY_BISTRR_BDXEN_SHIFT)

/*
 * BSONF (R/W)
 *
 * BIST Stop On Nth Fail: Specifies, if set, that the BIST should stop when an nth data word or address/command comparison error has been encountered.
 */
#define DDRPHY_BISTRR_BSONF_MASK (0x2000U)
#define DDRPHY_BISTRR_BSONF_SHIFT (13U)
#define DDRPHY_BISTRR_BSONF_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BSONF_SHIFT) & DDRPHY_BISTRR_BSONF_MASK)
#define DDRPHY_BISTRR_BSONF_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BSONF_MASK) >> DDRPHY_BISTRR_BSONF_SHIFT)

/*
 * NFAIL (R/W)
 *
 * Number of Failures: Specifies the number of failures after which the execution of commands and the capture of read data should stop if BSONF bit of this register is set. Execution of commands and the capture of read data will stop after (NFAIL+1) failures if BSONF is set.
 */
#define DDRPHY_BISTRR_NFAIL_MASK (0x1FE0U)
#define DDRPHY_BISTRR_NFAIL_SHIFT (5U)
#define DDRPHY_BISTRR_NFAIL_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_NFAIL_SHIFT) & DDRPHY_BISTRR_NFAIL_MASK)
#define DDRPHY_BISTRR_NFAIL_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_NFAIL_MASK) >> DDRPHY_BISTRR_NFAIL_SHIFT)

/*
 * BINF (R/W)
 *
 * BIST Infinite Run: Specifies, if set, that the BIST should be run indefinitely until when it is either stopped or a failure has been encountered. Otherwise BIST is run until number of BIST words specified in the BISTWCR register has been generated.
 */
#define DDRPHY_BISTRR_BINF_MASK (0x10U)
#define DDRPHY_BISTRR_BINF_SHIFT (4U)
#define DDRPHY_BISTRR_BINF_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BINF_SHIFT) & DDRPHY_BISTRR_BINF_MASK)
#define DDRPHY_BISTRR_BINF_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BINF_MASK) >> DDRPHY_BISTRR_BINF_SHIFT)

/*
 * BMODE (R/W)
 *
 * BIST Mode: Selects the mode in which BIST is run. Valid values are:
 * 0 = Loopback mode: Address, commands and data loop back at the PHY I/Os.
 * 1 = DRAM mode: Address, commands and data go to DRAM for normal memory accesses.
 */
#define DDRPHY_BISTRR_BMODE_MASK (0x8U)
#define DDRPHY_BISTRR_BMODE_SHIFT (3U)
#define DDRPHY_BISTRR_BMODE_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BMODE_SHIFT) & DDRPHY_BISTRR_BMODE_MASK)
#define DDRPHY_BISTRR_BMODE_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BMODE_MASK) >> DDRPHY_BISTRR_BMODE_SHIFT)

