RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * BINST (R/W)
 *
 * BIST Instruction: Selects the BIST instruction to be executed: Valid values are: 000 = NOP: No operation
 * 001 = Run: Triggers the running of the BIST. 010 = Stop: Stops the running of the BIST.
 * 011 = Reset: Resets all BIST run-time registers, such as error counters. 100 – 111 Reserved
 */
#define DDRPHY_BISTRR_BINST_MASK (0x7U)
#define DDRPHY_BISTRR_BINST_SHIFT (0U)
#define DDRPHY_BISTRR_BINST_SET(x) (((uint32_t)(x) << DDRPHY_BISTRR_BINST_SHIFT) & DDRPHY_BISTRR_BINST_MASK)
#define DDRPHY_BISTRR_BINST_GET(x) (((uint32_t)(x) & DDRPHY_BISTRR_BINST_MASK) >> DDRPHY_BISTRR_BINST_SHIFT)

/* Bitfield definition for register: BISTWCR */
/*
 * BWCNT (R/W)
 *
 * BIST Word Count: Indicates the number of words to generate during BIST. This must be a multiple of DRAM burst length (BL) divided by 2, e.g. for BL=8, valid values are 4, 8, 12, 16, and so on.
 */
#define DDRPHY_BISTWCR_BWCNT_MASK (0xFFFFU)
#define DDRPHY_BISTWCR_BWCNT_SHIFT (0U)
#define DDRPHY_BISTWCR_BWCNT_SET(x) (((uint32_t)(x) << DDRPHY_BISTWCR_BWCNT_SHIFT) & DDRPHY_BISTWCR_BWCNT_MASK)
#define DDRPHY_BISTWCR_BWCNT_GET(x) (((uint32_t)(x) & DDRPHY_BISTWCR_BWCNT_MASK) >> DDRPHY_BISTWCR_BWCNT_SHIFT)

/* Bitfield definition for register: BISTMSKR0 */
/*
 * ODTMSK (R/W)
 *
 * Mask bit for each of the up to 4 ODT bits.
 */
#define DDRPHY_BISTMSKR0_ODTMSK_MASK (0xF0000000UL)
#define DDRPHY_BISTMSKR0_ODTMSK_SHIFT (28U)
#define DDRPHY_BISTMSKR0_ODTMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR0_ODTMSK_SHIFT) & DDRPHY_BISTMSKR0_ODTMSK_MASK)
#define DDRPHY_BISTMSKR0_ODTMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR0_ODTMSK_MASK) >> DDRPHY_BISTMSKR0_ODTMSK_SHIFT)

/*
 * CSMSK (R/W)
 *
 * Mask bit for each of the up to 4 CS# bits.
 */
#define DDRPHY_BISTMSKR0_CSMSK_MASK (0xF000000UL)
#define DDRPHY_BISTMSKR0_CSMSK_SHIFT (24U)
#define DDRPHY_BISTMSKR0_CSMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR0_CSMSK_SHIFT) & DDRPHY_BISTMSKR0_CSMSK_MASK)
#define DDRPHY_BISTMSKR0_CSMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR0_CSMSK_MASK) >> DDRPHY_BISTMSKR0_CSMSK_SHIFT)

/*
 * CKEMSK (R/W)
 *
 * Mask bit for each of the up to 4 CKE bits.
 */
#define DDRPHY_BISTMSKR0_CKEMSK_MASK (0xF00000UL)
#define DDRPHY_BISTMSKR0_CKEMSK_SHIFT (20U)
#define DDRPHY_BISTMSKR0_CKEMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR0_CKEMSK_SHIFT) & DDRPHY_BISTMSKR0_CKEMSK_MASK)
#define DDRPHY_BISTMSKR0_CKEMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR0_CKEMSK_MASK) >> DDRPHY_BISTMSKR0_CKEMSK_SHIFT)

/*
 * WEMSK (R/W)
 *
 * Mask bit for the WE#.
 */
#define DDRPHY_BISTMSKR0_WEMSK_MASK (0x80000UL)
#define DDRPHY_BISTMSKR0_WEMSK_SHIFT (19U)
#define DDRPHY_BISTMSKR0_WEMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR0_WEMSK_SHIFT) & DDRPHY_BISTMSKR0_WEMSK_MASK)
#define DDRPHY_BISTMSKR0_WEMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR0_WEMSK_MASK) >> DDRPHY_BISTMSKR0_WEMSK_SHIFT)

/*
 * BAMSK (R/W)
 *
 * Mask bit for each of the up to 3 bank address bits.
 */
#define DDRPHY_BISTMSKR0_BAMSK_MASK (0x70000UL)
#define DDRPHY_BISTMSKR0_BAMSK_SHIFT (16U)
#define DDRPHY_BISTMSKR0_BAMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR0_BAMSK_SHIFT) & DDRPHY_BISTMSKR0_BAMSK_MASK)
#define DDRPHY_BISTMSKR0_BAMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR0_BAMSK_MASK) >> DDRPHY_BISTMSKR0_BAMSK_SHIFT)

/*
 * AMSK (R/W)
 *
 * Mask bit for each of the up to 16 address bits.
 */
#define DDRPHY_BISTMSKR0_AMSK_MASK (0xFFFFU)
#define DDRPHY_BISTMSKR0_AMSK_SHIFT (0U)
#define DDRPHY_BISTMSKR0_AMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR0_AMSK_SHIFT) & DDRPHY_BISTMSKR0_AMSK_MASK)
#define DDRPHY_BISTMSKR0_AMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR0_AMSK_MASK) >> DDRPHY_BISTMSKR0_AMSK_SHIFT)

/* Bitfield definition for register: BISTMSKR1 */
/*
 * DMMSK (R/W)
 *
 * Mask bit for the data mask (DM) bit.
 */
#define DDRPHY_BISTMSKR1_DMMSK_MASK (0xF0000000UL)
#define DDRPHY_BISTMSKR1_DMMSK_SHIFT (28U)
#define DDRPHY_BISTMSKR1_DMMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR1_DMMSK_SHIFT) & DDRPHY_BISTMSKR1_DMMSK_MASK)
#define DDRPHY_BISTMSKR1_DMMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR1_DMMSK_MASK) >> DDRPHY_BISTMSKR1_DMMSK_SHIFT)

/*
 * PARMSK (R/W)
 *
 * Mask bit for the PAR_IN. Only for DIMM parity support and only if the design is compiled for less than 3 ranks.
 */
#define DDRPHY_BISTMSKR1_PARMSK_MASK (0x8000000UL)
#define DDRPHY_BISTMSKR1_PARMSK_SHIFT (27U)
#define DDRPHY_BISTMSKR1_PARMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR1_PARMSK_SHIFT) & DDRPHY_BISTMSKR1_PARMSK_MASK)
#define DDRPHY_BISTMSKR1_PARMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR1_PARMSK_MASK) >> DDRPHY_BISTMSKR1_PARMSK_SHIFT)

/*
 * CASMSK (R/W)
 *
 * Mask bit for the CAS.
 */
#define DDRPHY_BISTMSKR1_CASMSK_MASK (0x2U)
#define DDRPHY_BISTMSKR1_CASMSK_SHIFT (1U)
#define DDRPHY_BISTMSKR1_CASMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR1_CASMSK_SHIFT) & DDRPHY_BISTMSKR1_CASMSK_MASK)
#define DDRPHY_BISTMSKR1_CASMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR1_CASMSK_MASK) >> DDRPHY_BISTMSKR1_CASMSK_SHIFT)

/*
 * RASMSK (R/W)
 *
 * Mask bit for the RAS.
 */
#define DDRPHY_BISTMSKR1_RASMSK_MASK (0x1U)
#define DDRPHY_BISTMSKR1_RASMSK_SHIFT (0U)
#define DDRPHY_BISTMSKR1_RASMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR1_RASMSK_SHIFT) & DDRPHY_BISTMSKR1_RASMSK_MASK)
#define DDRPHY_BISTMSKR1_RASMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR1_RASMSK_MASK) >> DDRPHY_BISTMSKR1_RASMSK_SHIFT)

/* Bitfield definition for register: BISTMSKR2 */
/*
 * DQMSK (R/W)
 *
 * Mask bit for each of the 8 data (DQ) bits.
 */
#define DDRPHY_BISTMSKR2_DQMSK_MASK (0xFFFFFFFFUL)
#define DDRPHY_BISTMSKR2_DQMSK_SHIFT (0U)
#define DDRPHY_BISTMSKR2_DQMSK_SET(x) (((uint32_t)(x) << DDRPHY_BISTMSKR2_DQMSK_SHIFT) & DDRPHY_BISTMSKR2_DQMSK_MASK)
#define DDRPHY_BISTMSKR2_DQMSK_GET(x) (((uint32_t)(x) & DDRPHY_BISTMSKR2_DQMSK_MASK) >> DDRPHY_BISTMSKR2_DQMSK_SHIFT)

/* Bitfield definition for register: BISTLSR */
/*
 * SEED (R/W)
 *
 * LFSR seed for pseudo-random BIST patterns.
 */
#define DDRPHY_BISTLSR_SEED_MASK (0xFFFFFFFFUL)
#define DDRPHY_BISTLSR_SEED_SHIFT (0U)
#define DDRPHY_BISTLSR_SEED_SET(x) (((uint32_t)(x) << DDRPHY_BISTLSR_SEED_SHIFT) & DDRPHY_BISTLSR_SEED_MASK)
#define DDRPHY_BISTLSR_SEED_GET(x) (((uint32_t)(x) & DDRPHY_BISTLSR_SEED_MASK) >> DDRPHY_BISTLSR_SEED_SHIFT)

