RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/* Bitfield definition for register: BISTAR0 */
/*
 * BBANK (R/W)
 *
 * BIST Bank Address: Selects the SDRAM bank address to be used during BIST.
 */
#define DDRPHY_BISTAR0_BBANK_MASK (0x70000000UL)
#define DDRPHY_BISTAR0_BBANK_SHIFT (28U)
#define DDRPHY_BISTAR0_BBANK_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR0_BBANK_SHIFT) & DDRPHY_BISTAR0_BBANK_MASK)
#define DDRPHY_BISTAR0_BBANK_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR0_BBANK_MASK) >> DDRPHY_BISTAR0_BBANK_SHIFT)

/*
 * BROW (R/W)
 *
 * BIST Row Address: Selects the SDRAM row address to be used during BIST.
 */
#define DDRPHY_BISTAR0_BROW_MASK (0xFFFF000UL)
#define DDRPHY_BISTAR0_BROW_SHIFT (12U)
#define DDRPHY_BISTAR0_BROW_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR0_BROW_SHIFT) & DDRPHY_BISTAR0_BROW_MASK)
#define DDRPHY_BISTAR0_BROW_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR0_BROW_MASK) >> DDRPHY_BISTAR0_BROW_SHIFT)

/*
 * BCOL (R/W)
 *
 * BIST Column Address: Selects the SDRAM column address to be used during BIST. The lower bits of this address must be “0000” for BL16, “000” for BL8, “00” for BL4 and “0” for BL2.
 */
#define DDRPHY_BISTAR0_BCOL_MASK (0xFFFU)
#define DDRPHY_BISTAR0_BCOL_SHIFT (0U)
#define DDRPHY_BISTAR0_BCOL_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR0_BCOL_SHIFT) & DDRPHY_BISTAR0_BCOL_MASK)
#define DDRPHY_BISTAR0_BCOL_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR0_BCOL_MASK) >> DDRPHY_BISTAR0_BCOL_SHIFT)

/* Bitfield definition for register: BISTAR1 */
/*
 * BAINC (R/W)
 *
 * BIST Address Increment: Selects the value by which the SDRAM address is incremented for each write/read access. This value must be at the beginning of a burst boundary, i.e. the lower bits must be “0000” for BL16, “000” for BL8, “00” for BL4 and “0” for BL2.
 */
#define DDRPHY_BISTAR1_BAINC_MASK (0xFFF0U)
#define DDRPHY_BISTAR1_BAINC_SHIFT (4U)
#define DDRPHY_BISTAR1_BAINC_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR1_BAINC_SHIFT) & DDRPHY_BISTAR1_BAINC_MASK)
#define DDRPHY_BISTAR1_BAINC_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR1_BAINC_MASK) >> DDRPHY_BISTAR1_BAINC_SHIFT)

/*
 * BMRANK (R/W)
 *
 * BIST Maximum Rank: Specifies the maximum SDRAM rank to be used during BIST. The default value is set to maximum ranks minus 1. Example default shown here is for a 4-rank system
 */
#define DDRPHY_BISTAR1_BMRANK_MASK (0xCU)
#define DDRPHY_BISTAR1_BMRANK_SHIFT (2U)
#define DDRPHY_BISTAR1_BMRANK_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR1_BMRANK_SHIFT) & DDRPHY_BISTAR1_BMRANK_MASK)
#define DDRPHY_BISTAR1_BMRANK_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR1_BMRANK_MASK) >> DDRPHY_BISTAR1_BMRANK_SHIFT)

/*
 * BRANK (R/W)
 *
 * BIST Rank: Selects the SDRAM rank to be used during BIST. Valid values range from 0 to maximum ranks minus 1.
 */
#define DDRPHY_BISTAR1_BRANK_MASK (0x3U)
#define DDRPHY_BISTAR1_BRANK_SHIFT (0U)
#define DDRPHY_BISTAR1_BRANK_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR1_BRANK_SHIFT) & DDRPHY_BISTAR1_BRANK_MASK)
#define DDRPHY_BISTAR1_BRANK_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR1_BRANK_MASK) >> DDRPHY_BISTAR1_BRANK_SHIFT)

/* Bitfield definition for register: BISTAR2 */
/*
 * BMBANK (R/W)
 *
 * BIST Maximum Bank Address: Specifies the maximum SDRAM bank address to be used during BIST before the address increments to the next rank.
 */
#define DDRPHY_BISTAR2_BMBANK_MASK (0x70000000UL)
#define DDRPHY_BISTAR2_BMBANK_SHIFT (28U)
#define DDRPHY_BISTAR2_BMBANK_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR2_BMBANK_SHIFT) & DDRPHY_BISTAR2_BMBANK_MASK)
#define DDRPHY_BISTAR2_BMBANK_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR2_BMBANK_MASK) >> DDRPHY_BISTAR2_BMBANK_SHIFT)

/*
 * BMROW (R/W)
 *
 * BIST Maximum Row Address: Specifies the maximum SDRAM row address to be used during BIST before the address increments to the next bank.
 */
#define DDRPHY_BISTAR2_BMROW_MASK (0xFFFF000UL)
#define DDRPHY_BISTAR2_BMROW_SHIFT (12U)
#define DDRPHY_BISTAR2_BMROW_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR2_BMROW_SHIFT) & DDRPHY_BISTAR2_BMROW_MASK)
#define DDRPHY_BISTAR2_BMROW_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR2_BMROW_MASK) >> DDRPHY_BISTAR2_BMROW_SHIFT)

/*
 * BMCOL (R/W)
 *
 * BIST Maximum Column Address: Specifies the maximum SDRAM column address to be used during BIST before the address increments to the next row.
 */
#define DDRPHY_BISTAR2_BMCOL_MASK (0xFFFU)
#define DDRPHY_BISTAR2_BMCOL_SHIFT (0U)
#define DDRPHY_BISTAR2_BMCOL_SET(x) (((uint32_t)(x) << DDRPHY_BISTAR2_BMCOL_SHIFT) & DDRPHY_BISTAR2_BMCOL_MASK)
#define DDRPHY_BISTAR2_BMCOL_GET(x) (((uint32_t)(x) & DDRPHY_BISTAR2_BMCOL_MASK) >> DDRPHY_BISTAR2_BMCOL_SHIFT)

/* Bitfield definition for register: BISTUDPR */
/*
 * BUDP1 (R/W)
 *
 * BIST User Data Pattern 1: Data to be applied on odd DQ pins during BIST.
 */
#define DDRPHY_BISTUDPR_BUDP1_MASK (0xFFFF0000UL)
#define DDRPHY_BISTUDPR_BUDP1_SHIFT (16U)
#define DDRPHY_BISTUDPR_BUDP1_SET(x) (((uint32_t)(x) << DDRPHY_BISTUDPR_BUDP1_SHIFT) & DDRPHY_BISTUDPR_BUDP1_MASK)
#define DDRPHY_BISTUDPR_BUDP1_GET(x) (((uint32_t)(x) & DDRPHY_BISTUDPR_BUDP1_MASK) >> DDRPHY_BISTUDPR_BUDP1_SHIFT)

/*
 * BUDP0 (R/W)
 *
 * BIST User Data Pattern 0: Data to be applied on even DQ pins during BIST.
 */
#define DDRPHY_BISTUDPR_BUDP0_MASK (0xFFFFU)
#define DDRPHY_BISTUDPR_BUDP0_SHIFT (0U)
#define DDRPHY_BISTUDPR_BUDP0_SET(x) (((uint32_t)(x) << DDRPHY_BISTUDPR_BUDP0_SHIFT) & DDRPHY_BISTUDPR_BUDP0_MASK)
#define DDRPHY_BISTUDPR_BUDP0_GET(x) (((uint32_t)(x) & DDRPHY_BISTUDPR_BUDP0_MASK) >> DDRPHY_BISTUDPR_BUDP0_SHIFT)

/* Bitfield definition for register: BISTGSR */
/*
 * CASBER (R)
 *
 * CAS Bit Error: Indicates the number of bit errors on CAS.
 */
#define DDRPHY_BISTGSR_CASBER_MASK (0xC0000000UL)
#define DDRPHY_BISTGSR_CASBER_SHIFT (30U)
#define DDRPHY_BISTGSR_CASBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTGSR_CASBER_MASK) >> DDRPHY_BISTGSR_CASBER_SHIFT)

/*
 * RASBER (R)
 *
 * RAS Bit Error: Indicates the number of bit errors on RAS.
 */
#define DDRPHY_BISTGSR_RASBER_MASK (0x30000000UL)
#define DDRPHY_BISTGSR_RASBER_SHIFT (28U)
#define DDRPHY_BISTGSR_RASBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTGSR_RASBER_MASK) >> DDRPHY_BISTGSR_RASBER_SHIFT)

