RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DMBER (R)
 *
 * DM Bit Error: Indicates the number of bit errors on data mask (DM) bit. DMBER[1:0] are for even DQS cycles first DM beat, and DMBER[3:2] are for even DQS cycles second DM beat. Similarly, DMBER[5:4] are for odd DQS cycles first DM beat, and DMBER[7:6] are for odd DQS cycles second DM beat.
 */
#define DDRPHY_BISTGSR_DMBER_MASK (0xFF00000UL)
#define DDRPHY_BISTGSR_DMBER_SHIFT (20U)
#define DDRPHY_BISTGSR_DMBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTGSR_DMBER_MASK) >> DDRPHY_BISTGSR_DMBER_SHIFT)

/*
 * PARBER (R)
 *
 * PAR_IN Bit Error (DIMM Only): Indicates the number of bit errors on PAR_IN
 */
#define DDRPHY_BISTGSR_PARBER_MASK (0x30000UL)
#define DDRPHY_BISTGSR_PARBER_SHIFT (16U)
#define DDRPHY_BISTGSR_PARBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTGSR_PARBER_MASK) >> DDRPHY_BISTGSR_PARBER_SHIFT)

/*
 * BDXERR (R)
 *
 * BIST Data Error: indicates, if set, that there is a data comparison error in the byte lane.
 */
#define DDRPHY_BISTGSR_BDXERR_MASK (0x4U)
#define DDRPHY_BISTGSR_BDXERR_SHIFT (2U)
#define DDRPHY_BISTGSR_BDXERR_GET(x) (((uint32_t)(x) & DDRPHY_BISTGSR_BDXERR_MASK) >> DDRPHY_BISTGSR_BDXERR_SHIFT)

/*
 * BACERR (R)
 *
 * BIST Address/Command Error: indicates, if set, that there is a data comparison error in the address/command lane.
 */
#define DDRPHY_BISTGSR_BACERR_MASK (0x2U)
#define DDRPHY_BISTGSR_BACERR_SHIFT (1U)
#define DDRPHY_BISTGSR_BACERR_GET(x) (((uint32_t)(x) & DDRPHY_BISTGSR_BACERR_MASK) >> DDRPHY_BISTGSR_BACERR_SHIFT)

/*
 * BDONE (R)
 *
 * BIST Done: Indicates, if set, that the BIST has finished executing. This bit is reset to zero when BIST is triggered.
 */
#define DDRPHY_BISTGSR_BDONE_MASK (0x1U)
#define DDRPHY_BISTGSR_BDONE_SHIFT (0U)
#define DDRPHY_BISTGSR_BDONE_GET(x) (((uint32_t)(x) & DDRPHY_BISTGSR_BDONE_MASK) >> DDRPHY_BISTGSR_BDONE_SHIFT)

/* Bitfield definition for register: BISTWER */
/*
 * DXWER (R)
 *
 * Byte Word Error: Indicates the number of word errors on the byte lane. An error on any bit of the data bus including the data mask bit increments the error count.
 */
#define DDRPHY_BISTWER_DXWER_MASK (0xFFFF0000UL)
#define DDRPHY_BISTWER_DXWER_SHIFT (16U)
#define DDRPHY_BISTWER_DXWER_GET(x) (((uint32_t)(x) & DDRPHY_BISTWER_DXWER_MASK) >> DDRPHY_BISTWER_DXWER_SHIFT)

/*
 * ACWER (R)
 *
 * Address/Command Word Error: Indicates the number of word errors on the address/command lane. An error on any bit of the address/command bus increments the error count.
 */
#define DDRPHY_BISTWER_ACWER_MASK (0xFFFFU)
#define DDRPHY_BISTWER_ACWER_SHIFT (0U)
#define DDRPHY_BISTWER_ACWER_GET(x) (((uint32_t)(x) & DDRPHY_BISTWER_ACWER_MASK) >> DDRPHY_BISTWER_ACWER_SHIFT)

/* Bitfield definition for register: BISTBER0 */
/*
 * ABER (R)
 *
 * Address Bit Error: Each group of two bits indicate the bit error count on each of the
 */
#define DDRPHY_BISTBER0_ABER_MASK (0xFFFFFFFFUL)
#define DDRPHY_BISTBER0_ABER_SHIFT (0U)
#define DDRPHY_BISTBER0_ABER_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER0_ABER_MASK) >> DDRPHY_BISTBER0_ABER_SHIFT)

/* Bitfield definition for register: BISTBER1 */
/*
 * ODTBER (R)
 *
 * ODT Bit Error: Each group of two bits indicates the bit error count on each of the up to 4 ODT bits. [1:0] is the error count for ODT[0], [3:2] for ODT[1], and so on.
 */
#define DDRPHY_BISTBER1_ODTBER_MASK (0xFF000000UL)
#define DDRPHY_BISTBER1_ODTBER_SHIFT (24U)
#define DDRPHY_BISTBER1_ODTBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER1_ODTBER_MASK) >> DDRPHY_BISTBER1_ODTBER_SHIFT)

/*
 * CSBER (R)
 *
 * CS# Bit Error: Each group of two bits indicate the bit error count on each of the up to 4 CS# bits. [1:0] is the error count for CS#[0], [3:2] for CS#[1], and so on.
 */
#define DDRPHY_BISTBER1_CSBER_MASK (0xFF0000UL)
#define DDRPHY_BISTBER1_CSBER_SHIFT (16U)
#define DDRPHY_BISTBER1_CSBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER1_CSBER_MASK) >> DDRPHY_BISTBER1_CSBER_SHIFT)

/*
 * CKEBER (R)
 *
 * CKE Bit Error: Each group of two bits indicate the bit error count on each of the up to 4 CKE bits. [1:0] is the error count for CKE[0], [3:2] for CKE[1], and so on.
 */
#define DDRPHY_BISTBER1_CKEBER_MASK (0xFF00U)
#define DDRPHY_BISTBER1_CKEBER_SHIFT (8U)
#define DDRPHY_BISTBER1_CKEBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER1_CKEBER_MASK) >> DDRPHY_BISTBER1_CKEBER_SHIFT)

/*
 * WEBER (R)
 *
 * WE# Bit Error: Indicates the number of bit errors on WE#.
 */
#define DDRPHY_BISTBER1_WEBER_MASK (0xC0U)
#define DDRPHY_BISTBER1_WEBER_SHIFT (6U)
#define DDRPHY_BISTBER1_WEBER_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER1_WEBER_MASK) >> DDRPHY_BISTBER1_WEBER_SHIFT)

/*
 * BABER (R)
 *
 * Bank Address Bit Error: Each group of two bits indicate the bit error count on each of the up to 3 bank address bits. [1:0] is the error count for BA[0], [3:2] for BA[1], and so on.
 */
#define DDRPHY_BISTBER1_BABER_MASK (0x3FU)
#define DDRPHY_BISTBER1_BABER_SHIFT (0U)
#define DDRPHY_BISTBER1_BABER_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER1_BABER_MASK) >> DDRPHY_BISTBER1_BABER_SHIFT)

/* Bitfield definition for register: BISTBER2 */
/*
 * DQBER0 (R)
 *
 * Data Bit Error: The error count for even DQS cycles. The first 16 bits indicate the error count for the first data beat (i.e. the data driven out on DQ[7:0] on the rising edge of DQS). The second 16 bits indicate the error on the second data beat (i.e. the error count of the data driven out on DQ[7:0] on the falling edge of DQS). For each of the 16-bit group, the first 2 bits are for DQ[0], the second for DQ[1], and so on.
 */
#define DDRPHY_BISTBER2_DQBER0_MASK (0xFFFFFFFFUL)
#define DDRPHY_BISTBER2_DQBER0_SHIFT (0U)
#define DDRPHY_BISTBER2_DQBER0_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER2_DQBER0_MASK) >> DDRPHY_BISTBER2_DQBER0_SHIFT)

/* Bitfield definition for register: BISTBER3 */
/*
 * DQBER1 (R)
 *
 * Data Bit Error: The error count for odd DQS cycles. The first 16 bits indicate the error count for the first data beat (i.e. the data driven out on DQ[7:0] on the rising edge of DQS). The second 16 bits indicate the error on the second data beat (i.e. the error count of the data driven out on DQ[7:0] on the falling edge of DQS). For each of the 16-bit group, the first 2 bits are for DQ[0], the second for DQ[1], and so on.
 */
#define DDRPHY_BISTBER3_DQBER1_MASK (0xFFFFFFFFUL)
#define DDRPHY_BISTBER3_DQBER1_SHIFT (0U)
#define DDRPHY_BISTBER3_DQBER1_GET(x) (((uint32_t)(x) & DDRPHY_BISTBER3_DQBER1_MASK) >> DDRPHY_BISTBER3_DQBER1_SHIFT)

/* Bitfield definition for register: BISTWCSR */
/*
 * DXWCNT (R)
 *
 * Byte Word Count: Indicates the number of words received from the byte lane.
 */
#define DDRPHY_BISTWCSR_DXWCNT_MASK (0xFFFF0000UL)
#define DDRPHY_BISTWCSR_DXWCNT_SHIFT (16U)
#define DDRPHY_BISTWCSR_DXWCNT_GET(x) (((uint32_t)(x) & DDRPHY_BISTWCSR_DXWCNT_MASK) >> DDRPHY_BISTWCSR_DXWCNT_SHIFT)

