RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * ACWCNT (R)
 *
 * Address/Command Word Count: Indicates the number of words received from the address/command lane.
 */
#define DDRPHY_BISTWCSR_ACWCNT_MASK (0xFFFFU)
#define DDRPHY_BISTWCSR_ACWCNT_SHIFT (0U)
#define DDRPHY_BISTWCSR_ACWCNT_GET(x) (((uint32_t)(x) & DDRPHY_BISTWCSR_ACWCNT_MASK) >> DDRPHY_BISTWCSR_ACWCNT_SHIFT)

/* Bitfield definition for register: BISTFWR0 */
/*
 * ODTWEBS (R)
 *
 * Bit status during a word error for each of the up to 4 ODT bits.
 */
#define DDRPHY_BISTFWR0_ODTWEBS_MASK (0xF0000000UL)
#define DDRPHY_BISTFWR0_ODTWEBS_SHIFT (28U)
#define DDRPHY_BISTFWR0_ODTWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR0_ODTWEBS_MASK) >> DDRPHY_BISTFWR0_ODTWEBS_SHIFT)

/*
 * CSWEBS (R)
 *
 * Bit status during a word error for each of the up to 4 CS# bits.
 */
#define DDRPHY_BISTFWR0_CSWEBS_MASK (0xF000000UL)
#define DDRPHY_BISTFWR0_CSWEBS_SHIFT (24U)
#define DDRPHY_BISTFWR0_CSWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR0_CSWEBS_MASK) >> DDRPHY_BISTFWR0_CSWEBS_SHIFT)

/*
 * CKEWEBS (R)
 *
 * Bit status during a word error for each of the up to 4 CKE bits.
 */
#define DDRPHY_BISTFWR0_CKEWEBS_MASK (0xF00000UL)
#define DDRPHY_BISTFWR0_CKEWEBS_SHIFT (20U)
#define DDRPHY_BISTFWR0_CKEWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR0_CKEWEBS_MASK) >> DDRPHY_BISTFWR0_CKEWEBS_SHIFT)

/*
 * WEWEBS (R)
 *
 * Bit status during a word error for the WE#.
 */
#define DDRPHY_BISTFWR0_WEWEBS_MASK (0x80000UL)
#define DDRPHY_BISTFWR0_WEWEBS_SHIFT (19U)
#define DDRPHY_BISTFWR0_WEWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR0_WEWEBS_MASK) >> DDRPHY_BISTFWR0_WEWEBS_SHIFT)

/*
 * BAWEBS (R)
 *
 * Bit status during a word error for each of the up to 3 bank address bits.
 */
#define DDRPHY_BISTFWR0_BAWEBS_MASK (0x70000UL)
#define DDRPHY_BISTFWR0_BAWEBS_SHIFT (16U)
#define DDRPHY_BISTFWR0_BAWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR0_BAWEBS_MASK) >> DDRPHY_BISTFWR0_BAWEBS_SHIFT)

/*
 * AWEBS (R)
 *
 * Bit status during a word error for each of the up to 16 address bits.
 */
#define DDRPHY_BISTFWR0_AWEBS_MASK (0xFFFFU)
#define DDRPHY_BISTFWR0_AWEBS_SHIFT (0U)
#define DDRPHY_BISTFWR0_AWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR0_AWEBS_MASK) >> DDRPHY_BISTFWR0_AWEBS_SHIFT)

/* Bitfield definition for register: BISTFWR1 */
/*
 * DMWEBS (R)
 *
 * Bit status during a word error for the data mask (DM) bit. DMWEBS [0] is for the first DM beat, DMWEBS [1] is for the second DM beat, and so on.
 */
#define DDRPHY_BISTFWR1_DMWEBS_MASK (0xF0000000UL)
#define DDRPHY_BISTFWR1_DMWEBS_SHIFT (28U)
#define DDRPHY_BISTFWR1_DMWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR1_DMWEBS_MASK) >> DDRPHY_BISTFWR1_DMWEBS_SHIFT)

/*
 * PARWEBS (R)
 *
 * Bit status during a word error for the PAR_IN. Only for DIMM parity support
 */
#define DDRPHY_BISTFWR1_PARWEBS_MASK (0x4000000UL)
#define DDRPHY_BISTFWR1_PARWEBS_SHIFT (26U)
#define DDRPHY_BISTFWR1_PARWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR1_PARWEBS_MASK) >> DDRPHY_BISTFWR1_PARWEBS_SHIFT)

/*
 * CASWEBS (R)
 *
 * Bit status during a word error for the CAS.
 */
#define DDRPHY_BISTFWR1_CASWEBS_MASK (0x2U)
#define DDRPHY_BISTFWR1_CASWEBS_SHIFT (1U)
#define DDRPHY_BISTFWR1_CASWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR1_CASWEBS_MASK) >> DDRPHY_BISTFWR1_CASWEBS_SHIFT)

/*
 * RASWEBS (R)
 *
 * Bit status during a word error for the RAS.
 */
#define DDRPHY_BISTFWR1_RASWEBS_MASK (0x1U)
#define DDRPHY_BISTFWR1_RASWEBS_SHIFT (0U)
#define DDRPHY_BISTFWR1_RASWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR1_RASWEBS_MASK) >> DDRPHY_BISTFWR1_RASWEBS_SHIFT)

/* Bitfield definition for register: BISTFWR2 */
/*
 * DQWEBS (R)
 *
 * Bit status during a word error for each of the 8 data (DQ) bits. The first 8 bits indicate the status of the first data beat (i.e. the status of the data driven out on DQ[7:0] on the rising edge of DQS). The second 8 bits indicate the status of the second data beat (i.e. the status of the data driven out on DQ[7:0] on the falling edge of DQS), and so on. For each of the 8-bit group, the first bit is for DQ[0], the second bit is for DQ[1], and so on.
 */
#define DDRPHY_BISTFWR2_DQWEBS_MASK (0xFFFFFFFFUL)
#define DDRPHY_BISTFWR2_DQWEBS_SHIFT (0U)
#define DDRPHY_BISTFWR2_DQWEBS_GET(x) (((uint32_t)(x) & DDRPHY_BISTFWR2_DQWEBS_MASK) >> DDRPHY_BISTFWR2_DQWEBS_SHIFT)

/* Bitfield definition for register: AACR */
/*
 * AAOENC (R/W)
 *
 * Anti-Aging PAD Output Enable Control: Enables, if set, anti-aging toggling on the pad output enable signal “ctl_oe_n” going into the DATX8s. This will increase power consumption for the anti-aging feature.
 */
#define DDRPHY_AACR_AAOENC_MASK (0x80000000UL)
#define DDRPHY_AACR_AAOENC_SHIFT (31U)
#define DDRPHY_AACR_AAOENC_SET(x) (((uint32_t)(x) << DDRPHY_AACR_AAOENC_SHIFT) & DDRPHY_AACR_AAOENC_MASK)
#define DDRPHY_AACR_AAOENC_GET(x) (((uint32_t)(x) & DDRPHY_AACR_AAOENC_MASK) >> DDRPHY_AACR_AAOENC_SHIFT)

/*
 * AAENC (R/W)
 *
 * Anti-Aging Enable Control: Enables, if set, the automatic toggling of the data going to the DATX8 when the data channel from the controller/PUB to DATX8 is idle for programmable number of clock cycles.
 */
#define DDRPHY_AACR_AAENC_MASK (0x40000000UL)
#define DDRPHY_AACR_AAENC_SHIFT (30U)
#define DDRPHY_AACR_AAENC_SET(x) (((uint32_t)(x) << DDRPHY_AACR_AAENC_SHIFT) & DDRPHY_AACR_AAENC_MASK)
#define DDRPHY_AACR_AAENC_GET(x) (((uint32_t)(x) & DDRPHY_AACR_AAENC_MASK) >> DDRPHY_AACR_AAENC_SHIFT)

/*
 * AATR (R/W)
 *
 * Anti-Aging Toggle Rate: Defines the number of controller clock (ctl_clk) cycles after which the PUB will toggle the data going to DATX8 if the data channel between the controller/PUB and DATX8 has been idle for this long.
 * The default value correspond to a toggling count of 4096 ctl_clk cycles. For a ctl_clk running at 533MHz the toggle rate will be approximately 7.68us.
 * The default value may also be overridden by the macro DWC_AACR_AATR_DFLT.
 */
#define DDRPHY_AACR_AATR_MASK (0x3FFFFFFFUL)
#define DDRPHY_AACR_AATR_SHIFT (0U)
#define DDRPHY_AACR_AATR_SET(x) (((uint32_t)(x) << DDRPHY_AACR_AATR_SHIFT) & DDRPHY_AACR_AATR_MASK)
#define DDRPHY_AACR_AATR_GET(x) (((uint32_t)(x) & DDRPHY_AACR_AATR_MASK) >> DDRPHY_AACR_AATR_SHIFT)

