RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/* Bitfield definition for register: GPR0 */
/*
 * GPR0 (R/W)
 *
 * General Purpose Register 0: General purpose register bits.
 */
#define DDRPHY_GPR0_GPR0_MASK (0xFFFFFFFFUL)
#define DDRPHY_GPR0_GPR0_SHIFT (0U)
#define DDRPHY_GPR0_GPR0_SET(x) (((uint32_t)(x) << DDRPHY_GPR0_GPR0_SHIFT) & DDRPHY_GPR0_GPR0_MASK)
#define DDRPHY_GPR0_GPR0_GET(x) (((uint32_t)(x) & DDRPHY_GPR0_GPR0_MASK) >> DDRPHY_GPR0_GPR0_SHIFT)

/* Bitfield definition for register: GPR1 */
/*
 * GPR1 (R/W)
 *
 * General Purpose Register 1: General purpose register bits.
 */
#define DDRPHY_GPR1_GPR1_MASK (0xFFFFFFFFUL)
#define DDRPHY_GPR1_GPR1_SHIFT (0U)
#define DDRPHY_GPR1_GPR1_SET(x) (((uint32_t)(x) << DDRPHY_GPR1_GPR1_SHIFT) & DDRPHY_GPR1_GPR1_MASK)
#define DDRPHY_GPR1_GPR1_GET(x) (((uint32_t)(x) & DDRPHY_GPR1_GPR1_MASK) >> DDRPHY_GPR1_GPR1_SHIFT)

/* Bitfield definition for register of struct array ZQ: CR0 */
/*
 * ZQPD (R/W)
 *
 * ZQ Power Down: Powers down, if set, the PZQ cell.
 */
#define DDRPHY_ZQ_CR0_ZQPD_MASK (0x80000000UL)
#define DDRPHY_ZQ_CR0_ZQPD_SHIFT (31U)
#define DDRPHY_ZQ_CR0_ZQPD_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR0_ZQPD_SHIFT) & DDRPHY_ZQ_CR0_ZQPD_MASK)
#define DDRPHY_ZQ_CR0_ZQPD_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR0_ZQPD_MASK) >> DDRPHY_ZQ_CR0_ZQPD_SHIFT)

/*
 * ZCALEN (R/W)
 *
 * Impedance Calibration Enable: Enables, if set, the impedance calibration of this ZQ control block when impedance calibration is triggered using either the ZCAL bit of PIR register or the DFI update interface.
 */
#define DDRPHY_ZQ_CR0_ZCALEN_MASK (0x40000000UL)
#define DDRPHY_ZQ_CR0_ZCALEN_SHIFT (30U)
#define DDRPHY_ZQ_CR0_ZCALEN_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR0_ZCALEN_SHIFT) & DDRPHY_ZQ_CR0_ZCALEN_MASK)
#define DDRPHY_ZQ_CR0_ZCALEN_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR0_ZCALEN_MASK) >> DDRPHY_ZQ_CR0_ZCALEN_SHIFT)

/*
 * ZCALBYP (R/W)
 *
 * Impedance Calibration Bypass: Bypasses, if set, impedance calibration of this ZQ control block when impedance calibration is already in progress. Impedance calibration can be disabled prior to trigger by using the ZCALEN bit.
 */
#define DDRPHY_ZQ_CR0_ZCALBYP_MASK (0x20000000UL)
#define DDRPHY_ZQ_CR0_ZCALBYP_SHIFT (29U)
#define DDRPHY_ZQ_CR0_ZCALBYP_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR0_ZCALBYP_SHIFT) & DDRPHY_ZQ_CR0_ZCALBYP_MASK)
#define DDRPHY_ZQ_CR0_ZCALBYP_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR0_ZCALBYP_MASK) >> DDRPHY_ZQ_CR0_ZCALBYP_SHIFT)

/*
 * ZDEN (R/W)
 *
 * Impedance Over-ride Enable: When this bit is set, it allows users to directly drive the impedance control using the data programmed in the ZDATA field. Otherwise, the control is generated automatically by the impedance control logic.
 */
#define DDRPHY_ZQ_CR0_ZDEN_MASK (0x10000000UL)
#define DDRPHY_ZQ_CR0_ZDEN_SHIFT (28U)
#define DDRPHY_ZQ_CR0_ZDEN_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR0_ZDEN_SHIFT) & DDRPHY_ZQ_CR0_ZDEN_MASK)
#define DDRPHY_ZQ_CR0_ZDEN_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR0_ZDEN_MASK) >> DDRPHY_ZQ_CR0_ZDEN_SHIFT)

/*
 * ZDATA (R/W)
 *
 * Impedance Over-Ride Data: Data used to directly drive the impedance control.
 * ZDATA field mapping for D3F I/Os is as follows:
 * ZDATA[27:21] is used to select the pull-up on-die termination impedance ZDATA[20:14] is used to select the pull-down on-die termination impedance ZDATA[13:7] is used to select the pull-up output impedance
 * ZDATA[6:0] is used to select the pull-down output impedance
 * ZDATA field mapping for D3A/B/R I/Os is as follows: ZDATA[27:20] is reserved and returns zeros on reads
 * ZDATA[19:15] is used to select the pull-up on-die termination impedance ZDATA[14:10] is used to select the pull-down on-die termination impedance ZDATA[9:5] is used to select the pull-up output impedance
 * ZDATA[4:0] is used to select the pull-down output impedance
 * The default value is 0x000014A for I/O type D3C/R and 0x0001830 for I/O type D3F.
 */
#define DDRPHY_ZQ_CR0_ZDATA_MASK (0xFFFFFFFUL)
#define DDRPHY_ZQ_CR0_ZDATA_SHIFT (0U)
#define DDRPHY_ZQ_CR0_ZDATA_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR0_ZDATA_SHIFT) & DDRPHY_ZQ_CR0_ZDATA_MASK)
#define DDRPHY_ZQ_CR0_ZDATA_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR0_ZDATA_MASK) >> DDRPHY_ZQ_CR0_ZDATA_SHIFT)

/* Bitfield definition for register of struct array ZQ: CR1 */
/*
 * DFIPU1 (R/W)
 *
 * DFI Update Interface 1: Sets this impedance controller to be enabled for calibration when the DFI PHY update interface 1 (channel 1) requests an update. Only valid in shared-AC mode.
 */
#define DDRPHY_ZQ_CR1_DFIPU1_MASK (0x20000UL)
#define DDRPHY_ZQ_CR1_DFIPU1_SHIFT (17U)
#define DDRPHY_ZQ_CR1_DFIPU1_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR1_DFIPU1_SHIFT) & DDRPHY_ZQ_CR1_DFIPU1_MASK)
#define DDRPHY_ZQ_CR1_DFIPU1_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR1_DFIPU1_MASK) >> DDRPHY_ZQ_CR1_DFIPU1_SHIFT)

/*
 * DFIPU0 (R/W)
 *
 * DFI Update Interface 0: Sets this impedance controller to be enabled for calibration when the DFI PHY update interface 0 (channel 0) requests an update.
 */
#define DDRPHY_ZQ_CR1_DFIPU0_MASK (0x10000UL)
#define DDRPHY_ZQ_CR1_DFIPU0_SHIFT (16U)
#define DDRPHY_ZQ_CR1_DFIPU0_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR1_DFIPU0_SHIFT) & DDRPHY_ZQ_CR1_DFIPU0_MASK)
#define DDRPHY_ZQ_CR1_DFIPU0_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR1_DFIPU0_MASK) >> DDRPHY_ZQ_CR1_DFIPU0_SHIFT)

/*
 * DFICCU (R/W)
 *
 * DFI Concurrent Controller Update Interface: Sets this impedance controller to be enabled for calibration when both of the DFI controller update interfaces request an update on the same clock. This provides the ability to enable impedance calibration updates for the Address/Command lane. Only valid in shared-AC mode.
 */
#define DDRPHY_ZQ_CR1_DFICCU_MASK (0x4000U)
#define DDRPHY_ZQ_CR1_DFICCU_SHIFT (14U)
#define DDRPHY_ZQ_CR1_DFICCU_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR1_DFICCU_SHIFT) & DDRPHY_ZQ_CR1_DFICCU_MASK)
#define DDRPHY_ZQ_CR1_DFICCU_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR1_DFICCU_MASK) >> DDRPHY_ZQ_CR1_DFICCU_SHIFT)

/*
 * DFICU1 (R/W)
 *
 * DFI Controller Update Interface 1: Sets this impedance controller to be enabled for calibration when the DFI controller update interface 1 (channel 1) requests an update. Only valid in shared-AC mode.
 */
#define DDRPHY_ZQ_CR1_DFICU1_MASK (0x2000U)
#define DDRPHY_ZQ_CR1_DFICU1_SHIFT (13U)
#define DDRPHY_ZQ_CR1_DFICU1_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR1_DFICU1_SHIFT) & DDRPHY_ZQ_CR1_DFICU1_MASK)
#define DDRPHY_ZQ_CR1_DFICU1_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR1_DFICU1_MASK) >> DDRPHY_ZQ_CR1_DFICU1_SHIFT)

