RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DFICU0 (R/W)
 *
 * DFI Controller Update Interface 0: Sets this impedance controller to be enabled for calibration when the DFI controller update interface 0 (channel 0) requests an update.
 */
#define DDRPHY_ZQ_CR1_DFICU0_MASK (0x1000U)
#define DDRPHY_ZQ_CR1_DFICU0_SHIFT (12U)
#define DDRPHY_ZQ_CR1_DFICU0_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR1_DFICU0_SHIFT) & DDRPHY_ZQ_CR1_DFICU0_MASK)
#define DDRPHY_ZQ_CR1_DFICU0_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR1_DFICU0_MASK) >> DDRPHY_ZQ_CR1_DFICU0_SHIFT)

/*
 * ZPROG (R/W)
 *
 * Impedance Divide Ratio: Selects the external resistor divide ratio to be used to set the output impedance and the on-die termination as follows:
 * ZPROG[7:4] = On-die termination divide select ZPROG[3:0] = Output impedance divide select
 */
#define DDRPHY_ZQ_CR1_ZPROG_MASK (0xFFU)
#define DDRPHY_ZQ_CR1_ZPROG_SHIFT (0U)
#define DDRPHY_ZQ_CR1_ZPROG_SET(x) (((uint32_t)(x) << DDRPHY_ZQ_CR1_ZPROG_SHIFT) & DDRPHY_ZQ_CR1_ZPROG_MASK)
#define DDRPHY_ZQ_CR1_ZPROG_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_CR1_ZPROG_MASK) >> DDRPHY_ZQ_CR1_ZPROG_SHIFT)

/* Bitfield definition for register of struct array ZQ: SR0 */
/*
 * ZDONE (R)
 *
 * Impedance Calibration Done: Indicates that impedance calibration has completed.
 */
#define DDRPHY_ZQ_SR0_ZDONE_MASK (0x80000000UL)
#define DDRPHY_ZQ_SR0_ZDONE_SHIFT (31U)
#define DDRPHY_ZQ_SR0_ZDONE_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_SR0_ZDONE_MASK) >> DDRPHY_ZQ_SR0_ZDONE_SHIFT)

/*
 * ZERR (R)
 *
 * Impedance Calibration Error: If set, indicates that there was an error during impedance calibration.
 */
#define DDRPHY_ZQ_SR0_ZERR_MASK (0x40000000UL)
#define DDRPHY_ZQ_SR0_ZERR_SHIFT (30U)
#define DDRPHY_ZQ_SR0_ZERR_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_SR0_ZERR_MASK) >> DDRPHY_ZQ_SR0_ZERR_SHIFT)

/*
 * ZCTRL (R)
 *
 * Impedance Control: Current value of impedance control. ZCTRL field mapping for D3F I/Os is as follows:
 * ZCTRL[27:21] is used to select the pull-up on-die termination impedance ZCTRL[20:14] is used to select the pull-down on-die termination impedance ZCTRL[13:7] is used to select the pull-up output impedance
 * ZCTRL[6:0] is used to select the pull-down output impedance
 * ZCTRL field mapping for D3A/B/R I/Os is as follows: ZCTRL[27:20] is reserved and returns zeros on reads
 * ZCTRL[19:15] is used to select the pull-up on-die termination impedance ZCTRL[14:10] is used to select the pull-down on-die termination impedance ZCTRL[9:5] is used to select the pull-up output impedance
 * ZCTRL[4:0] is used to select the pull-down output impedance
 * Note: The default value is 0x000014A for I/O type D3C/D3R and 0x0001839 for I/O type D3F.
 */
#define DDRPHY_ZQ_SR0_ZCTRL_MASK (0xFFFFFFFUL)
#define DDRPHY_ZQ_SR0_ZCTRL_SHIFT (0U)
#define DDRPHY_ZQ_SR0_ZCTRL_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_SR0_ZCTRL_MASK) >> DDRPHY_ZQ_SR0_ZCTRL_SHIFT)

/* Bitfield definition for register of struct array ZQ: SR1 */
/*
 * OPU (R)
 *
 * On-die termination (ODT) pull-up calibration status. Similar status encodings as ZPD.
 */
#define DDRPHY_ZQ_SR1_OPU_MASK (0xC0U)
#define DDRPHY_ZQ_SR1_OPU_SHIFT (6U)
#define DDRPHY_ZQ_SR1_OPU_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_SR1_OPU_MASK) >> DDRPHY_ZQ_SR1_OPU_SHIFT)

/*
 * OPD (R)
 *
 * On-die termination (ODT) pull-down calibration status. Similar status encodings as ZPD.
 */
#define DDRPHY_ZQ_SR1_OPD_MASK (0x30U)
#define DDRPHY_ZQ_SR1_OPD_SHIFT (4U)
#define DDRPHY_ZQ_SR1_OPD_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_SR1_OPD_MASK) >> DDRPHY_ZQ_SR1_OPD_SHIFT)

/*
 * ZPU (R)
 *
 * Output impedance pull-up calibration status. Similar status encodings as ZPD.
 */
#define DDRPHY_ZQ_SR1_ZPU_MASK (0xCU)
#define DDRPHY_ZQ_SR1_ZPU_SHIFT (2U)
#define DDRPHY_ZQ_SR1_ZPU_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_SR1_ZPU_MASK) >> DDRPHY_ZQ_SR1_ZPU_SHIFT)

/*
 * ZPD (R)
 *
 * Output impedance pull-down calibration status. Valid status encodings are: 00 = Completed with no errors
 * 01 = Overflow error 10 = Underflow error
 * 11 = Calibration in progress
 */
#define DDRPHY_ZQ_SR1_ZPD_MASK (0x3U)
#define DDRPHY_ZQ_SR1_ZPD_SHIFT (0U)
#define DDRPHY_ZQ_SR1_ZPD_GET(x) (((uint32_t)(x) & DDRPHY_ZQ_SR1_ZPD_MASK) >> DDRPHY_ZQ_SR1_ZPD_SHIFT)

/* Bitfield definition for register of struct array DX: GCR */
/*
 * CALBYP (R/W)
 *
 * Calibration Bypass: Prevents, if set, period measurement calibration from automatically triggering after PHY initialization.
 */
#define DDRPHY_DX_GCR_CALBYP_MASK (0x80000000UL)
#define DDRPHY_DX_GCR_CALBYP_SHIFT (31U)
#define DDRPHY_DX_GCR_CALBYP_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_CALBYP_SHIFT) & DDRPHY_DX_GCR_CALBYP_MASK)
#define DDRPHY_DX_GCR_CALBYP_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_CALBYP_MASK) >> DDRPHY_DX_GCR_CALBYP_SHIFT)

/*
 * MDLEN (R/W)
 *
 * Master Delay Line Enable: Enables, if set, the DATX8 master delay line calibration to perform subsequent period measurements following the initial period measurements that are performed after reset or when calibration is manually triggered. These additional measurements are accumulated and filtered as long as this bit remains high. This bit is ANDed with the common DATX8 MDL enable bit.
 */
#define DDRPHY_DX_GCR_MDLEN_MASK (0x40000000UL)
#define DDRPHY_DX_GCR_MDLEN_SHIFT (30U)
#define DDRPHY_DX_GCR_MDLEN_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_MDLEN_SHIFT) & DDRPHY_DX_GCR_MDLEN_MASK)
#define DDRPHY_DX_GCR_MDLEN_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_MDLEN_MASK) >> DDRPHY_DX_GCR_MDLEN_SHIFT)

/*
 * WLRKEN (R/W)
 *
 * Write Level Rank Enable: Specifies the ranks that should be write leveled for this byte. Write leveling responses from ranks that are not enabled for write leveling for a particular byte are ignored and write leveling is flagged as done for these ranks.
 * WLRKEN[0] enables rank 0, [1] enables rank 1, [2] enables rank 2, and [3] enables
 * rank 3.
 */
#define DDRPHY_DX_GCR_WLRKEN_MASK (0x3C000000UL)
#define DDRPHY_DX_GCR_WLRKEN_SHIFT (26U)
#define DDRPHY_DX_GCR_WLRKEN_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_WLRKEN_SHIFT) & DDRPHY_DX_GCR_WLRKEN_MASK)
#define DDRPHY_DX_GCR_WLRKEN_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_WLRKEN_MASK) >> DDRPHY_DX_GCR_WLRKEN_SHIFT)

