RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DQSRPD (R/W)
 *
 * DQSR Power Down: Powers down, if set, the PDQSR cell. This bit is ORed with the common PDR configuration bit (see “DATX8 Common Configuration Register (DXCCR)” on page 99)
 */
#define DDRPHY_DX_GCR_DQSRPD_MASK (0x40U)
#define DDRPHY_DX_GCR_DQSRPD_SHIFT (6U)
#define DDRPHY_DX_GCR_DQSRPD_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_DQSRPD_SHIFT) & DDRPHY_DX_GCR_DQSRPD_MASK)
#define DDRPHY_DX_GCR_DQSRPD_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_DQSRPD_MASK) >> DDRPHY_DX_GCR_DQSRPD_SHIFT)

/*
 * DXPDR (R/W)
 *
 * Data Power Down Receiver: Powers down, when set, the input receiver on I/O for DQ, DM, and DQS/DQS# pins of the byte. This bit is ORed with the common PDR configuration bit (see “DATX8 Common Configuration Register (DXCCR)” on page 99).
 */
#define DDRPHY_DX_GCR_DXPDR_MASK (0x20U)
#define DDRPHY_DX_GCR_DXPDR_SHIFT (5U)
#define DDRPHY_DX_GCR_DXPDR_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_DXPDR_SHIFT) & DDRPHY_DX_GCR_DXPDR_MASK)
#define DDRPHY_DX_GCR_DXPDR_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_DXPDR_MASK) >> DDRPHY_DX_GCR_DXPDR_SHIFT)

/*
 * DXPDD1 (R/W)
 *
 * Data Power Down Driver: Powers down, when set, the output driver on I/O for DQ, DM, and DQS/DQS# pins of the byte. This bit is ORed with the common PDD configuration bit (see “DATX8 Common Configuration Register (DXCCR)” on page 99).
 */
#define DDRPHY_DX_GCR_DXPDD1_MASK (0x10U)
#define DDRPHY_DX_GCR_DXPDD1_SHIFT (4U)
#define DDRPHY_DX_GCR_DXPDD1_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_DXPDD1_SHIFT) & DDRPHY_DX_GCR_DXPDD1_MASK)
#define DDRPHY_DX_GCR_DXPDD1_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_DXPDD1_MASK) >> DDRPHY_DX_GCR_DXPDD1_SHIFT)

/*
 * DXIOM (R/W)
 *
 * Data I/O Mode: Selects SSTL mode (when set to 0) or CMOS mode (when set to 1) of the I/O for DQ, DM, and DQS/DQS# pins of the byte. This bit is ORed with the IOM configuration bit of the individual DATX8(see “DATX8 Common Configuration Register (DXCCR)” on page 99).
 */
#define DDRPHY_DX_GCR_DXIOM_MASK (0x8U)
#define DDRPHY_DX_GCR_DXIOM_SHIFT (3U)
#define DDRPHY_DX_GCR_DXIOM_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_DXIOM_SHIFT) & DDRPHY_DX_GCR_DXIOM_MASK)
#define DDRPHY_DX_GCR_DXIOM_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_DXIOM_MASK) >> DDRPHY_DX_GCR_DXIOM_SHIFT)

/*
 * DQODT (R/W)
 *
 * Data On-Die Termination: Enables, when set, the on-die termination on the I/O for DQ and DM pins of the byte. This bit is ORed with the common DATX8 ODT configuration bit (see “DATX8 Common Configuration Register (DXCCR)” on page 99).
 * Note: This bit is only valid when DXnGCR0[10] is '0'.
 */
#define DDRPHY_DX_GCR_DQODT_MASK (0x4U)
#define DDRPHY_DX_GCR_DQODT_SHIFT (2U)
#define DDRPHY_DX_GCR_DQODT_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_DQODT_SHIFT) & DDRPHY_DX_GCR_DQODT_MASK)
#define DDRPHY_DX_GCR_DQODT_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_DQODT_MASK) >> DDRPHY_DX_GCR_DQODT_SHIFT)

/*
 * DQSODT (R/W)
 *
 * DQS On-Die Termination: Enables, when set, the on-die termination on the I/O for DQS/DQS# pin of the byte. This bit is ORed with the common DATX8 ODT configuration bit (see “DATX8 Common Configuration Register (DXCCR)” on page 99).
 * Note: This bit is only valid when DXnGCR0[9] is '0'.
 */
#define DDRPHY_DX_GCR_DQSODT_MASK (0x2U)
#define DDRPHY_DX_GCR_DQSODT_SHIFT (1U)
#define DDRPHY_DX_GCR_DQSODT_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_DQSODT_SHIFT) & DDRPHY_DX_GCR_DQSODT_MASK)
#define DDRPHY_DX_GCR_DQSODT_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_DQSODT_MASK) >> DDRPHY_DX_GCR_DQSODT_SHIFT)

/*
 * DXEN (R/W)
 *
 * Data Byte Enable: Enables, if set, the data byte. Setting this bit to '0' disables the byte, i.e. the byte is not used in PHY initialization or training and is ignored during SDRAM read/write operations.
 */
#define DDRPHY_DX_GCR_DXEN_MASK (0x1U)
#define DDRPHY_DX_GCR_DXEN_SHIFT (0U)
#define DDRPHY_DX_GCR_DXEN_SET(x) (((uint32_t)(x) << DDRPHY_DX_GCR_DXEN_SHIFT) & DDRPHY_DX_GCR_DXEN_MASK)
#define DDRPHY_DX_GCR_DXEN_GET(x) (((uint32_t)(x) & DDRPHY_DX_GCR_DXEN_MASK) >> DDRPHY_DX_GCR_DXEN_SHIFT)

/* Bitfield definition for register of struct array DX: GSR0 */
/*
 * WLDQ (R)
 *
 * Write Leveling DQ Status: Captures the write leveling DQ status from the DRAM during software write leveling.
 */
#define DDRPHY_DX_GSR0_WLDQ_MASK (0x10000000UL)
#define DDRPHY_DX_GSR0_WLDQ_SHIFT (28U)
#define DDRPHY_DX_GSR0_WLDQ_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_WLDQ_MASK) >> DDRPHY_DX_GSR0_WLDQ_SHIFT)

/*
 * QSGERR (R)
 *
 * DQS Gate Training Error: Indicates, if set, that there is an error in DQS gate training. One bit for each of the up to 4 ranks.
 */
#define DDRPHY_DX_GSR0_QSGERR_MASK (0xF000000UL)
#define DDRPHY_DX_GSR0_QSGERR_SHIFT (24U)
#define DDRPHY_DX_GSR0_QSGERR_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_QSGERR_MASK) >> DDRPHY_DX_GSR0_QSGERR_SHIFT)

/*
 * GDQSPRD (R)
 *
 * Read DQS gating Period: Returns the DDR clock period measured by the read DQS gating LCDL during calibration. This value is PVT compensated.
 */
#define DDRPHY_DX_GSR0_GDQSPRD_MASK (0xFF0000UL)
#define DDRPHY_DX_GSR0_GDQSPRD_SHIFT (16U)
#define DDRPHY_DX_GSR0_GDQSPRD_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_GDQSPRD_MASK) >> DDRPHY_DX_GSR0_GDQSPRD_SHIFT)

/*
 * DPLOCK (R)
 *
 * DATX8 PLL Lock: Indicates, if set, that the DATX8 PLL has locked. This is a direct status of the DATX8 PLL lock pin.
 */
#define DDRPHY_DX_GSR0_DPLOCK_MASK (0x8000U)
#define DDRPHY_DX_GSR0_DPLOCK_SHIFT (15U)
#define DDRPHY_DX_GSR0_DPLOCK_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_DPLOCK_MASK) >> DDRPHY_DX_GSR0_DPLOCK_SHIFT)

/*
 * WLPRD (R)
 *
 * Write Leveling Period: Returns the DDR clock period measured by the write leveling LCDL during calibration. The measured period is used to generate the control of the write leveling pipeline which is a function of the write-leveling delay and the clock period. This value is PVT compensated.
 */
#define DDRPHY_DX_GSR0_WLPRD_MASK (0x7F80U)
#define DDRPHY_DX_GSR0_WLPRD_SHIFT (7U)
#define DDRPHY_DX_GSR0_WLPRD_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_WLPRD_MASK) >> DDRPHY_DX_GSR0_WLPRD_SHIFT)

/*
 * WLERR (R)
 *
 * Write Leveling Error: Indicates, if set, that there is a write leveling error in the DATX8.
 */
#define DDRPHY_DX_GSR0_WLERR_MASK (0x40U)
#define DDRPHY_DX_GSR0_WLERR_SHIFT (6U)
#define DDRPHY_DX_GSR0_WLERR_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_WLERR_MASK) >> DDRPHY_DX_GSR0_WLERR_SHIFT)

