RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * WLDONE (R)
 *
 * Write Leveling Done: Indicates, if set, that the DATX8 has completed write leveling.
 */
#define DDRPHY_DX_GSR0_WLDONE_MASK (0x20U)
#define DDRPHY_DX_GSR0_WLDONE_SHIFT (5U)
#define DDRPHY_DX_GSR0_WLDONE_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_WLDONE_MASK) >> DDRPHY_DX_GSR0_WLDONE_SHIFT)

/*
 * WLCAL (R)
 *
 * Write Leveling Calibration: Indicates, if set, that the DATX8 has finished doing period measurement calibration for the write leveling slave delay line.
 */
#define DDRPHY_DX_GSR0_WLCAL_MASK (0x10U)
#define DDRPHY_DX_GSR0_WLCAL_SHIFT (4U)
#define DDRPHY_DX_GSR0_WLCAL_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_WLCAL_MASK) >> DDRPHY_DX_GSR0_WLCAL_SHIFT)

/*
 * GDQSCAL (R)
 *
 * Read DQS gating Calibration: Indicates, if set, that the DATX8 has finished doing period measurement calibration for the read DQS gating LCDL.
 */
#define DDRPHY_DX_GSR0_GDQSCAL_MASK (0x8U)
#define DDRPHY_DX_GSR0_GDQSCAL_SHIFT (3U)
#define DDRPHY_DX_GSR0_GDQSCAL_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_GDQSCAL_MASK) >> DDRPHY_DX_GSR0_GDQSCAL_SHIFT)

/*
 * RDQSNCAL (R)
 *
 * Read DQS# Calibration (Type B/B1 PHY Only): Indicates, if set, that the DATX8 has finished doing period measurement calibration for the read DQS# LCDL.
 */
#define DDRPHY_DX_GSR0_RDQSNCAL_MASK (0x4U)
#define DDRPHY_DX_GSR0_RDQSNCAL_SHIFT (2U)
#define DDRPHY_DX_GSR0_RDQSNCAL_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_RDQSNCAL_MASK) >> DDRPHY_DX_GSR0_RDQSNCAL_SHIFT)

/*
 * RDQSCAL (R)
 *
 * Read DQS Calibration: Indicates, if set, that the DATX8 has finished doing period measurement calibration for the read DQS LCDL.
 */
#define DDRPHY_DX_GSR0_RDQSCAL_MASK (0x2U)
#define DDRPHY_DX_GSR0_RDQSCAL_SHIFT (1U)
#define DDRPHY_DX_GSR0_RDQSCAL_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_RDQSCAL_MASK) >> DDRPHY_DX_GSR0_RDQSCAL_SHIFT)

/*
 * WDQCAL (R)
 *
 * Write DQ Calibration: Indicates, if set, that the DATX8 has finished doing period measurement calibration for the write DQ LCDL.
 */
#define DDRPHY_DX_GSR0_WDQCAL_MASK (0x1U)
#define DDRPHY_DX_GSR0_WDQCAL_SHIFT (0U)
#define DDRPHY_DX_GSR0_WDQCAL_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR0_WDQCAL_MASK) >> DDRPHY_DX_GSR0_WDQCAL_SHIFT)

/* Bitfield definition for register of struct array DX: GSR1 */
/*
 * DLTCODE (R)
 *
 * Delay Line Test Code: Returns the code measured by the PHY control block that corresponds to the period of the DATX8 delay line digital test output.
 */
#define DDRPHY_DX_GSR1_DLTCODE_MASK (0x1FFFFFEUL)
#define DDRPHY_DX_GSR1_DLTCODE_SHIFT (1U)
#define DDRPHY_DX_GSR1_DLTCODE_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR1_DLTCODE_MASK) >> DDRPHY_DX_GSR1_DLTCODE_SHIFT)

/*
 * DLTDONE (R)
 *
 * Delay Line Test Done: Indicates, if set, that the PHY control block has finished doing period measurement of the DATX8 delay line digital test output.
 */
#define DDRPHY_DX_GSR1_DLTDONE_MASK (0x1U)
#define DDRPHY_DX_GSR1_DLTDONE_SHIFT (0U)
#define DDRPHY_DX_GSR1_DLTDONE_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR1_DLTDONE_MASK) >> DDRPHY_DX_GSR1_DLTDONE_SHIFT)

/* Bitfield definition for register of struct array DX: BDLR0 */
/*
 * DQ4WBD (R/W)
 *
 * DQ4 Write Bit Delay: Delay select for the BDL on DQ4 write path.
 */
#define DDRPHY_DX_BDLR0_DQ4WBD_MASK (0x3F000000UL)
#define DDRPHY_DX_BDLR0_DQ4WBD_SHIFT (24U)
#define DDRPHY_DX_BDLR0_DQ4WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR0_DQ4WBD_SHIFT) & DDRPHY_DX_BDLR0_DQ4WBD_MASK)
#define DDRPHY_DX_BDLR0_DQ4WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR0_DQ4WBD_MASK) >> DDRPHY_DX_BDLR0_DQ4WBD_SHIFT)

/*
 * DQ3WBD (R/W)
 *
 * DQ3 Write Bit Delay: Delay select for the BDL on DQ3 write path
 */
#define DDRPHY_DX_BDLR0_DQ3WBD_MASK (0xFC0000UL)
#define DDRPHY_DX_BDLR0_DQ3WBD_SHIFT (18U)
#define DDRPHY_DX_BDLR0_DQ3WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR0_DQ3WBD_SHIFT) & DDRPHY_DX_BDLR0_DQ3WBD_MASK)
#define DDRPHY_DX_BDLR0_DQ3WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR0_DQ3WBD_MASK) >> DDRPHY_DX_BDLR0_DQ3WBD_SHIFT)

/*
 * DQ2WBD (R/W)
 *
 * DQ2 Write Bit Delay: Delay select for the BDL on DQ2 write path.
 */
#define DDRPHY_DX_BDLR0_DQ2WBD_MASK (0x3F000UL)
#define DDRPHY_DX_BDLR0_DQ2WBD_SHIFT (12U)
#define DDRPHY_DX_BDLR0_DQ2WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR0_DQ2WBD_SHIFT) & DDRPHY_DX_BDLR0_DQ2WBD_MASK)
#define DDRPHY_DX_BDLR0_DQ2WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR0_DQ2WBD_MASK) >> DDRPHY_DX_BDLR0_DQ2WBD_SHIFT)

/*
 * DQ1WBD (R/W)
 *
 * DQ1 Write Bit Delay: Delay select for the BDL on DQ1 write path.
 */
#define DDRPHY_DX_BDLR0_DQ1WBD_MASK (0xFC0U)
#define DDRPHY_DX_BDLR0_DQ1WBD_SHIFT (6U)
#define DDRPHY_DX_BDLR0_DQ1WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR0_DQ1WBD_SHIFT) & DDRPHY_DX_BDLR0_DQ1WBD_MASK)
#define DDRPHY_DX_BDLR0_DQ1WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR0_DQ1WBD_MASK) >> DDRPHY_DX_BDLR0_DQ1WBD_SHIFT)

/*
 * DQ0WBD (R/W)
 *
 * DQ0 Write Bit Delay: Delay select for the BDL on DQ0 write path.
 */
#define DDRPHY_DX_BDLR0_DQ0WBD_MASK (0x3FU)
#define DDRPHY_DX_BDLR0_DQ0WBD_SHIFT (0U)
#define DDRPHY_DX_BDLR0_DQ0WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR0_DQ0WBD_SHIFT) & DDRPHY_DX_BDLR0_DQ0WBD_MASK)
#define DDRPHY_DX_BDLR0_DQ0WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR0_DQ0WBD_MASK) >> DDRPHY_DX_BDLR0_DQ0WBD_SHIFT)

/* Bitfield definition for register of struct array DX: BDLR1 */
/*
 * DSWBD (R/W)
 *
 * DQS Write Bit Delay: Delay select for the BDL on DQS write path
 */
#define DDRPHY_DX_BDLR1_DSWBD_MASK (0x3F000000UL)
#define DDRPHY_DX_BDLR1_DSWBD_SHIFT (24U)
#define DDRPHY_DX_BDLR1_DSWBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR1_DSWBD_SHIFT) & DDRPHY_DX_BDLR1_DSWBD_MASK)
#define DDRPHY_DX_BDLR1_DSWBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR1_DSWBD_MASK) >> DDRPHY_DX_BDLR1_DSWBD_SHIFT)

/*
 * DMWBD (R/W)
 *
 * DM Write Bit Delay: Delay select for the BDL on DM write path.
 */
#define DDRPHY_DX_BDLR1_DMWBD_MASK (0xFC0000UL)
#define DDRPHY_DX_BDLR1_DMWBD_SHIFT (18U)
#define DDRPHY_DX_BDLR1_DMWBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR1_DMWBD_SHIFT) & DDRPHY_DX_BDLR1_DMWBD_MASK)
#define DDRPHY_DX_BDLR1_DMWBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR1_DMWBD_MASK) >> DDRPHY_DX_BDLR1_DMWBD_SHIFT)

