RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DQ7WBD (R/W)
 *
 * DQ7 Write Bit Delay: Delay select for the BDL on DQ7 write path.
 */
#define DDRPHY_DX_BDLR1_DQ7WBD_MASK (0x3F000UL)
#define DDRPHY_DX_BDLR1_DQ7WBD_SHIFT (12U)
#define DDRPHY_DX_BDLR1_DQ7WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR1_DQ7WBD_SHIFT) & DDRPHY_DX_BDLR1_DQ7WBD_MASK)
#define DDRPHY_DX_BDLR1_DQ7WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR1_DQ7WBD_MASK) >> DDRPHY_DX_BDLR1_DQ7WBD_SHIFT)

/*
 * DQ6WBD (R/W)
 *
 * DQ6 Write Bit Delay: Delay select for the BDL on DQ6 write path.
 */
#define DDRPHY_DX_BDLR1_DQ6WBD_MASK (0xFC0U)
#define DDRPHY_DX_BDLR1_DQ6WBD_SHIFT (6U)
#define DDRPHY_DX_BDLR1_DQ6WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR1_DQ6WBD_SHIFT) & DDRPHY_DX_BDLR1_DQ6WBD_MASK)
#define DDRPHY_DX_BDLR1_DQ6WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR1_DQ6WBD_MASK) >> DDRPHY_DX_BDLR1_DQ6WBD_SHIFT)

/*
 * DQ5WBD (R/W)
 *
 * DQ5 Write Bit Delay: Delay select for the BDL on DQ5 write path.
 */
#define DDRPHY_DX_BDLR1_DQ5WBD_MASK (0x3FU)
#define DDRPHY_DX_BDLR1_DQ5WBD_SHIFT (0U)
#define DDRPHY_DX_BDLR1_DQ5WBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR1_DQ5WBD_SHIFT) & DDRPHY_DX_BDLR1_DQ5WBD_MASK)
#define DDRPHY_DX_BDLR1_DQ5WBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR1_DQ5WBD_MASK) >> DDRPHY_DX_BDLR1_DQ5WBD_SHIFT)

/* Bitfield definition for register of struct array DX: BDLR2 */
/*
 * DSNRBD (R/W)
 *
 * DQSN Read Bit Delay (Type B/B1 PHY Only): Delay select for the BDL on DQSN read path
 */
#define DDRPHY_DX_BDLR2_DSNRBD_MASK (0xFC0000UL)
#define DDRPHY_DX_BDLR2_DSNRBD_SHIFT (18U)
#define DDRPHY_DX_BDLR2_DSNRBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR2_DSNRBD_SHIFT) & DDRPHY_DX_BDLR2_DSNRBD_MASK)
#define DDRPHY_DX_BDLR2_DSNRBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR2_DSNRBD_MASK) >> DDRPHY_DX_BDLR2_DSNRBD_SHIFT)

/*
 * DSRBD (R/W)
 *
 * DQS Read Bit Delay: Delay select for the BDL on DQS read path
 */
#define DDRPHY_DX_BDLR2_DSRBD_MASK (0x3F000UL)
#define DDRPHY_DX_BDLR2_DSRBD_SHIFT (12U)
#define DDRPHY_DX_BDLR2_DSRBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR2_DSRBD_SHIFT) & DDRPHY_DX_BDLR2_DSRBD_MASK)
#define DDRPHY_DX_BDLR2_DSRBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR2_DSRBD_MASK) >> DDRPHY_DX_BDLR2_DSRBD_SHIFT)

/*
 * DQOEBD (R/W)
 *
 * DQ Output Enable Bit Delay: Delay select for the BDL on DQ/DM output enable path.
 */
#define DDRPHY_DX_BDLR2_DQOEBD_MASK (0xFC0U)
#define DDRPHY_DX_BDLR2_DQOEBD_SHIFT (6U)
#define DDRPHY_DX_BDLR2_DQOEBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR2_DQOEBD_SHIFT) & DDRPHY_DX_BDLR2_DQOEBD_MASK)
#define DDRPHY_DX_BDLR2_DQOEBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR2_DQOEBD_MASK) >> DDRPHY_DX_BDLR2_DQOEBD_SHIFT)

/*
 * DSOEBD (R/W)
 *
 * DQS Output Enable Bit Delay: Delay select for the BDL on DQS output enable path
 */
#define DDRPHY_DX_BDLR2_DSOEBD_MASK (0x3FU)
#define DDRPHY_DX_BDLR2_DSOEBD_SHIFT (0U)
#define DDRPHY_DX_BDLR2_DSOEBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR2_DSOEBD_SHIFT) & DDRPHY_DX_BDLR2_DSOEBD_MASK)
#define DDRPHY_DX_BDLR2_DSOEBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR2_DSOEBD_MASK) >> DDRPHY_DX_BDLR2_DSOEBD_SHIFT)

/* Bitfield definition for register of struct array DX: BDLR3 */
/*
 * DQ4RBD (R/W)
 *
 * DQ4 Read Bit Delay: Delay select for the BDL on DQ4 read path.
 */
#define DDRPHY_DX_BDLR3_DQ4RBD_MASK (0x3F000000UL)
#define DDRPHY_DX_BDLR3_DQ4RBD_SHIFT (24U)
#define DDRPHY_DX_BDLR3_DQ4RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR3_DQ4RBD_SHIFT) & DDRPHY_DX_BDLR3_DQ4RBD_MASK)
#define DDRPHY_DX_BDLR3_DQ4RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR3_DQ4RBD_MASK) >> DDRPHY_DX_BDLR3_DQ4RBD_SHIFT)

/*
 * DQ3RBD (R/W)
 *
 * DQ3 Read Bit Delay: Delay select for the BDL on DQ3 read path
 */
#define DDRPHY_DX_BDLR3_DQ3RBD_MASK (0xFC0000UL)
#define DDRPHY_DX_BDLR3_DQ3RBD_SHIFT (18U)
#define DDRPHY_DX_BDLR3_DQ3RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR3_DQ3RBD_SHIFT) & DDRPHY_DX_BDLR3_DQ3RBD_MASK)
#define DDRPHY_DX_BDLR3_DQ3RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR3_DQ3RBD_MASK) >> DDRPHY_DX_BDLR3_DQ3RBD_SHIFT)

/*
 * DQ2RBD (R/W)
 *
 * DQ2 Read Bit Delay: Delay select for the BDL on DQ2 read path.
 */
#define DDRPHY_DX_BDLR3_DQ2RBD_MASK (0x3F000UL)
#define DDRPHY_DX_BDLR3_DQ2RBD_SHIFT (12U)
#define DDRPHY_DX_BDLR3_DQ2RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR3_DQ2RBD_SHIFT) & DDRPHY_DX_BDLR3_DQ2RBD_MASK)
#define DDRPHY_DX_BDLR3_DQ2RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR3_DQ2RBD_MASK) >> DDRPHY_DX_BDLR3_DQ2RBD_SHIFT)

/*
 * DQ1RBD (R/W)
 *
 * DQ1 Read Bit Delay: Delay select for the BDL on DQ1 read path.
 */
#define DDRPHY_DX_BDLR3_DQ1RBD_MASK (0xFC0U)
#define DDRPHY_DX_BDLR3_DQ1RBD_SHIFT (6U)
#define DDRPHY_DX_BDLR3_DQ1RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR3_DQ1RBD_SHIFT) & DDRPHY_DX_BDLR3_DQ1RBD_MASK)
#define DDRPHY_DX_BDLR3_DQ1RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR3_DQ1RBD_MASK) >> DDRPHY_DX_BDLR3_DQ1RBD_SHIFT)

/*
 * DQ0RBD (R/W)
 *
 * DQ0 Read Bit Delay: Delay select for the BDL on DQ0 read path.
 */
#define DDRPHY_DX_BDLR3_DQ0RBD_MASK (0x3FU)
#define DDRPHY_DX_BDLR3_DQ0RBD_SHIFT (0U)
#define DDRPHY_DX_BDLR3_DQ0RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR3_DQ0RBD_SHIFT) & DDRPHY_DX_BDLR3_DQ0RBD_MASK)
#define DDRPHY_DX_BDLR3_DQ0RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR3_DQ0RBD_MASK) >> DDRPHY_DX_BDLR3_DQ0RBD_SHIFT)

/* Bitfield definition for register of struct array DX: BDLR4 */
/*
 * DMRBD (R/W)
 *
 * DM Read Bit Delay: Delay select for the BDL on DM read path.
 */
#define DDRPHY_DX_BDLR4_DMRBD_MASK (0xFC0000UL)
#define DDRPHY_DX_BDLR4_DMRBD_SHIFT (18U)
#define DDRPHY_DX_BDLR4_DMRBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR4_DMRBD_SHIFT) & DDRPHY_DX_BDLR4_DMRBD_MASK)
#define DDRPHY_DX_BDLR4_DMRBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR4_DMRBD_MASK) >> DDRPHY_DX_BDLR4_DMRBD_SHIFT)

/*
 * DQ7RBD (R/W)
 *
 * DQ7 Read Bit Delay: Delay select for the BDL on DQ7 read path.
 */
#define DDRPHY_DX_BDLR4_DQ7RBD_MASK (0x3F000UL)
#define DDRPHY_DX_BDLR4_DQ7RBD_SHIFT (12U)
#define DDRPHY_DX_BDLR4_DQ7RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR4_DQ7RBD_SHIFT) & DDRPHY_DX_BDLR4_DQ7RBD_MASK)
#define DDRPHY_DX_BDLR4_DQ7RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR4_DQ7RBD_MASK) >> DDRPHY_DX_BDLR4_DQ7RBD_SHIFT)

