RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * DQ6RBD (R/W)
 *
 * DQ6 Read Bit Delay: Delay select for the BDL on DQ6 read path.
 */
#define DDRPHY_DX_BDLR4_DQ6RBD_MASK (0xFC0U)
#define DDRPHY_DX_BDLR4_DQ6RBD_SHIFT (6U)
#define DDRPHY_DX_BDLR4_DQ6RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR4_DQ6RBD_SHIFT) & DDRPHY_DX_BDLR4_DQ6RBD_MASK)
#define DDRPHY_DX_BDLR4_DQ6RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR4_DQ6RBD_MASK) >> DDRPHY_DX_BDLR4_DQ6RBD_SHIFT)

/*
 * DQ5RBD (R/W)
 *
 * DQ5 Read Bit Delay: Delay select for the BDL on DQ5 read path.
 */
#define DDRPHY_DX_BDLR4_DQ5RBD_MASK (0x3FU)
#define DDRPHY_DX_BDLR4_DQ5RBD_SHIFT (0U)
#define DDRPHY_DX_BDLR4_DQ5RBD_SET(x) (((uint32_t)(x) << DDRPHY_DX_BDLR4_DQ5RBD_SHIFT) & DDRPHY_DX_BDLR4_DQ5RBD_MASK)
#define DDRPHY_DX_BDLR4_DQ5RBD_GET(x) (((uint32_t)(x) & DDRPHY_DX_BDLR4_DQ5RBD_MASK) >> DDRPHY_DX_BDLR4_DQ5RBD_SHIFT)

/* Bitfield definition for register of struct array DX: LCDLR0 */
/*
 * R3WLD (R/W)
 *
 * Rank 3 Write Leveling Delay: Rank 3 delay select for the write leveling (WL) LCDL
 */
#define DDRPHY_DX_LCDLR0_R3WLD_MASK (0xFF000000UL)
#define DDRPHY_DX_LCDLR0_R3WLD_SHIFT (24U)
#define DDRPHY_DX_LCDLR0_R3WLD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR0_R3WLD_SHIFT) & DDRPHY_DX_LCDLR0_R3WLD_MASK)
#define DDRPHY_DX_LCDLR0_R3WLD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR0_R3WLD_MASK) >> DDRPHY_DX_LCDLR0_R3WLD_SHIFT)

/*
 * R2WLD (R/W)
 *
 * Rank 2 Write Leveling Delay: Rank 2 delay select for the write leveling (WL) LCDL
 */
#define DDRPHY_DX_LCDLR0_R2WLD_MASK (0xFF0000UL)
#define DDRPHY_DX_LCDLR0_R2WLD_SHIFT (16U)
#define DDRPHY_DX_LCDLR0_R2WLD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR0_R2WLD_SHIFT) & DDRPHY_DX_LCDLR0_R2WLD_MASK)
#define DDRPHY_DX_LCDLR0_R2WLD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR0_R2WLD_MASK) >> DDRPHY_DX_LCDLR0_R2WLD_SHIFT)

/*
 * R1WLD (R/W)
 *
 * Rank 1 Write Leveling Delay: Rank 1 delay select for the write leveling (WL) LCDL
 */
#define DDRPHY_DX_LCDLR0_R1WLD_MASK (0xFF00U)
#define DDRPHY_DX_LCDLR0_R1WLD_SHIFT (8U)
#define DDRPHY_DX_LCDLR0_R1WLD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR0_R1WLD_SHIFT) & DDRPHY_DX_LCDLR0_R1WLD_MASK)
#define DDRPHY_DX_LCDLR0_R1WLD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR0_R1WLD_MASK) >> DDRPHY_DX_LCDLR0_R1WLD_SHIFT)

/*
 * R0WLD (R/W)
 *
 * Rank 0 Write Leveling Delay: Rank 0 delay select for the write leveling (WL) LCDL
 */
#define DDRPHY_DX_LCDLR0_R0WLD_MASK (0xFFU)
#define DDRPHY_DX_LCDLR0_R0WLD_SHIFT (0U)
#define DDRPHY_DX_LCDLR0_R0WLD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR0_R0WLD_SHIFT) & DDRPHY_DX_LCDLR0_R0WLD_MASK)
#define DDRPHY_DX_LCDLR0_R0WLD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR0_R0WLD_MASK) >> DDRPHY_DX_LCDLR0_R0WLD_SHIFT)

/* Bitfield definition for register of struct array DX: LCDLR1 */
/*
 * RDQSND (R/W)
 *
 * Read DQSN Delay (Type B/B1 PHY Only): Delay select for the read DQSN (RDQS) LCDL
 */
#define DDRPHY_DX_LCDLR1_RDQSND_MASK (0xFF0000UL)
#define DDRPHY_DX_LCDLR1_RDQSND_SHIFT (16U)
#define DDRPHY_DX_LCDLR1_RDQSND_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR1_RDQSND_SHIFT) & DDRPHY_DX_LCDLR1_RDQSND_MASK)
#define DDRPHY_DX_LCDLR1_RDQSND_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR1_RDQSND_MASK) >> DDRPHY_DX_LCDLR1_RDQSND_SHIFT)

/*
 * RDQSD (R/W)
 *
 * Read DQS Delay: Delay select for the read DQS (RDQS) LCDL
 */
#define DDRPHY_DX_LCDLR1_RDQSD_MASK (0xFF00U)
#define DDRPHY_DX_LCDLR1_RDQSD_SHIFT (8U)
#define DDRPHY_DX_LCDLR1_RDQSD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR1_RDQSD_SHIFT) & DDRPHY_DX_LCDLR1_RDQSD_MASK)
#define DDRPHY_DX_LCDLR1_RDQSD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR1_RDQSD_MASK) >> DDRPHY_DX_LCDLR1_RDQSD_SHIFT)

/*
 * WDQD (R/W)
 *
 * Write Data Delay: Delay select for the write data (WDQ) LCDL
 */
#define DDRPHY_DX_LCDLR1_WDQD_MASK (0xFFU)
#define DDRPHY_DX_LCDLR1_WDQD_SHIFT (0U)
#define DDRPHY_DX_LCDLR1_WDQD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR1_WDQD_SHIFT) & DDRPHY_DX_LCDLR1_WDQD_MASK)
#define DDRPHY_DX_LCDLR1_WDQD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR1_WDQD_MASK) >> DDRPHY_DX_LCDLR1_WDQD_SHIFT)

/* Bitfield definition for register of struct array DX: LCDLR2 */
/*
 * R3DQSGD (R/W)
 *
 * Rank 3 Read DQS Gating Delay: Rank 3 delay select for the read DQS gating (DQSG) LCDL
 */
#define DDRPHY_DX_LCDLR2_R3DQSGD_MASK (0xFF000000UL)
#define DDRPHY_DX_LCDLR2_R3DQSGD_SHIFT (24U)
#define DDRPHY_DX_LCDLR2_R3DQSGD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR2_R3DQSGD_SHIFT) & DDRPHY_DX_LCDLR2_R3DQSGD_MASK)
#define DDRPHY_DX_LCDLR2_R3DQSGD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR2_R3DQSGD_MASK) >> DDRPHY_DX_LCDLR2_R3DQSGD_SHIFT)

/*
 * R2DQSGD (R/W)
 *
 * Rank 2 Read DQS Gating Delay: Rank 2 delay select for the read DQS gating (DQSG) LCDL
 */
#define DDRPHY_DX_LCDLR2_R2DQSGD_MASK (0xFF0000UL)
#define DDRPHY_DX_LCDLR2_R2DQSGD_SHIFT (16U)
#define DDRPHY_DX_LCDLR2_R2DQSGD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR2_R2DQSGD_SHIFT) & DDRPHY_DX_LCDLR2_R2DQSGD_MASK)
#define DDRPHY_DX_LCDLR2_R2DQSGD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR2_R2DQSGD_MASK) >> DDRPHY_DX_LCDLR2_R2DQSGD_SHIFT)

/*
 * R1DQSGD (R/W)
 *
 * Rank 1 Read DQS Gating Delay: Rank 1 delay select for the read DQS gating (DQSG) LCDL
 */
#define DDRPHY_DX_LCDLR2_R1DQSGD_MASK (0xFF00U)
#define DDRPHY_DX_LCDLR2_R1DQSGD_SHIFT (8U)
#define DDRPHY_DX_LCDLR2_R1DQSGD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR2_R1DQSGD_SHIFT) & DDRPHY_DX_LCDLR2_R1DQSGD_MASK)
#define DDRPHY_DX_LCDLR2_R1DQSGD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR2_R1DQSGD_MASK) >> DDRPHY_DX_LCDLR2_R1DQSGD_SHIFT)

/*
 * R0DQSGD (R/W)
 *
 * Rank 0 Read DQS Gating Delay: Rank 0 delay select for the read DQS gating (DQSG) LCDL
 */
#define DDRPHY_DX_LCDLR2_R0DQSGD_MASK (0xFFU)
#define DDRPHY_DX_LCDLR2_R0DQSGD_SHIFT (0U)
#define DDRPHY_DX_LCDLR2_R0DQSGD_SET(x) (((uint32_t)(x) << DDRPHY_DX_LCDLR2_R0DQSGD_SHIFT) & DDRPHY_DX_LCDLR2_R0DQSGD_MASK)
#define DDRPHY_DX_LCDLR2_R0DQSGD_GET(x) (((uint32_t)(x) & DDRPHY_DX_LCDLR2_R0DQSGD_MASK) >> DDRPHY_DX_LCDLR2_R0DQSGD_SHIFT)

/* Bitfield definition for register of struct array DX: MDLR */
/*
 * MDLD (R/W)
 *
 * MDL Delay: Delay select for the LCDL for the Master Delay Line.
 */
#define DDRPHY_DX_MDLR_MDLD_MASK (0xFF0000UL)
#define DDRPHY_DX_MDLR_MDLD_SHIFT (16U)
#define DDRPHY_DX_MDLR_MDLD_SET(x) (((uint32_t)(x) << DDRPHY_DX_MDLR_MDLD_SHIFT) & DDRPHY_DX_MDLR_MDLD_MASK)
#define DDRPHY_DX_MDLR_MDLD_GET(x) (((uint32_t)(x) & DDRPHY_DX_MDLR_MDLD_MASK) >> DDRPHY_DX_MDLR_MDLD_SHIFT)

