RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_ddrphy_regs.h
/*
 * WEERR (R/W)
 *
 * Write Data Eye Training Error: Indicates, if set, that the DATX8 has encountered an error during execution of the write data eye training.
 */
#define DDRPHY_DX_GSR2_WEERR_MASK (0x40U)
#define DDRPHY_DX_GSR2_WEERR_SHIFT (6U)
#define DDRPHY_DX_GSR2_WEERR_SET(x) (((uint32_t)(x) << DDRPHY_DX_GSR2_WEERR_SHIFT) & DDRPHY_DX_GSR2_WEERR_MASK)
#define DDRPHY_DX_GSR2_WEERR_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR2_WEERR_MASK) >> DDRPHY_DX_GSR2_WEERR_SHIFT)

/*
 * REWN (R/W)
 *
 * Read Data Eye Training Warning: Indicates, if set, that the DATX8 has encountered a warning during execution of the read data eye training.
 */
#define DDRPHY_DX_GSR2_REWN_MASK (0x20U)
#define DDRPHY_DX_GSR2_REWN_SHIFT (5U)
#define DDRPHY_DX_GSR2_REWN_SET(x) (((uint32_t)(x) << DDRPHY_DX_GSR2_REWN_SHIFT) & DDRPHY_DX_GSR2_REWN_MASK)
#define DDRPHY_DX_GSR2_REWN_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR2_REWN_MASK) >> DDRPHY_DX_GSR2_REWN_SHIFT)

/*
 * REERR (R/W)
 *
 * Read Data Eye Training Error: Indicates, if set, that the DATX8 has encountered an error during execution of the read data eye training.
 */
#define DDRPHY_DX_GSR2_REERR_MASK (0x10U)
#define DDRPHY_DX_GSR2_REERR_SHIFT (4U)
#define DDRPHY_DX_GSR2_REERR_SET(x) (((uint32_t)(x) << DDRPHY_DX_GSR2_REERR_SHIFT) & DDRPHY_DX_GSR2_REERR_MASK)
#define DDRPHY_DX_GSR2_REERR_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR2_REERR_MASK) >> DDRPHY_DX_GSR2_REERR_SHIFT)

/*
 * WDWN (R/W)
 *
 * Write Bit Deskew Warning: Indicates, if set, that the DATX8 has encountered a warning during execution of the write bit deskew training.
 */
#define DDRPHY_DX_GSR2_WDWN_MASK (0x8U)
#define DDRPHY_DX_GSR2_WDWN_SHIFT (3U)
#define DDRPHY_DX_GSR2_WDWN_SET(x) (((uint32_t)(x) << DDRPHY_DX_GSR2_WDWN_SHIFT) & DDRPHY_DX_GSR2_WDWN_MASK)
#define DDRPHY_DX_GSR2_WDWN_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR2_WDWN_MASK) >> DDRPHY_DX_GSR2_WDWN_SHIFT)

/*
 * WDERR (R/W)
 *
 * Write Bit Deskew Error: Indicates, if set, that the DATX8 has encountered an error during execution of the write bit deskew training.
 */
#define DDRPHY_DX_GSR2_WDERR_MASK (0x4U)
#define DDRPHY_DX_GSR2_WDERR_SHIFT (2U)
#define DDRPHY_DX_GSR2_WDERR_SET(x) (((uint32_t)(x) << DDRPHY_DX_GSR2_WDERR_SHIFT) & DDRPHY_DX_GSR2_WDERR_MASK)
#define DDRPHY_DX_GSR2_WDERR_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR2_WDERR_MASK) >> DDRPHY_DX_GSR2_WDERR_SHIFT)

/*
 * RDWN (R/W)
 *
 * Read Bit Deskew Warning: Indicates, if set, that the DATX8 has encountered a warning during execution of the read bit deskew training.
 */
#define DDRPHY_DX_GSR2_RDWN_MASK (0x2U)
#define DDRPHY_DX_GSR2_RDWN_SHIFT (1U)
#define DDRPHY_DX_GSR2_RDWN_SET(x) (((uint32_t)(x) << DDRPHY_DX_GSR2_RDWN_SHIFT) & DDRPHY_DX_GSR2_RDWN_MASK)
#define DDRPHY_DX_GSR2_RDWN_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR2_RDWN_MASK) >> DDRPHY_DX_GSR2_RDWN_SHIFT)

/*
 * RDERR (R/W)
 *
 * Read Bit Deskew Error: Indicates, if set, that the DATX8 has encountered an error during execution of the read bit deskew training.
 */
#define DDRPHY_DX_GSR2_RDERR_MASK (0x1U)
#define DDRPHY_DX_GSR2_RDERR_SHIFT (0U)
#define DDRPHY_DX_GSR2_RDERR_SET(x) (((uint32_t)(x) << DDRPHY_DX_GSR2_RDERR_SHIFT) & DDRPHY_DX_GSR2_RDERR_MASK)
#define DDRPHY_DX_GSR2_RDERR_GET(x) (((uint32_t)(x) & DDRPHY_DX_GSR2_RDERR_MASK) >> DDRPHY_DX_GSR2_RDERR_SHIFT)



/* ZQ register group index macro definition */
#define DDRPHY_ZQ_0 (0UL)
#define DDRPHY_ZQ_1 (1UL)
#define DDRPHY_ZQ_2 (2UL)
#define DDRPHY_ZQ_3 (3UL)

/* DX register group index macro definition */
#define DDRPHY_DX_0 (0UL)
#define DDRPHY_DX_1 (1UL)
#define DDRPHY_DX_2 (2UL)
#define DDRPHY_DX_3 (3UL)
#define DDRPHY_DX_4 (4UL)
#define DDRPHY_DX_5 (5UL)
#define DDRPHY_DX_6 (6UL)
#define DDRPHY_DX_7 (7UL)
#define DDRPHY_DX_8 (8UL)


#endif /* HPM_DDRPHY_H */
